{
  "analysis_id": "stats_stats_20250923T023724Z",
  "step": "statistical_analysis",
  "model_used": "vertex_ai/gemini-2.5-pro",
  "statistical_analysis": "Here is the statistical analysis for Experiment 2b_cff_cohesive_flourishing.\n\n***\n\n### **Statistical Analysis Report: Experiment 2b_cff_cohesive_flourishing**\n\n**Date:** October 26, 2023\n**Analyst:** Statistical Analysis Agent\n**Framework:** Cohesive Flourishing Framework (CFF) v10.4\n\n---\n\n### **1. Executive Summary**\n\nThis report presents a framework-centric statistical analysis of rhetorical strategies within the provided corpus, guided by the Cohesive Flourishing Framework (CFF) v10.4. The primary research question is: \"How do rhetorical strategies in this corpus manifest through the Cohesive Flourishing Framework dimensions?\"\n\n**Critical Methodological Limitation:** The provided analysis data contains scores for only a single document (N=1), identified as the 2018 State of the Union address. The corpus manifest describes seven documents, but data for the remaining six were not available for analysis. Consequently, this report is restricted to a descriptive case study of one speech. Inferential statistics, such as correlations, t-tests, or ANOVA, could not be performed.\n\n**Key Findings for the Analyzed Document (2018 SOTU):**\n*   **Dominant Rhetorical Themes:** The discourse is characterized by a potent and highly salient mix of **Tribal Dominance** (`raw_score`=0.90, `salience`=0.95), **Hope** (`raw_score`=0.90, `salience`=0.90), and **Cohesive Goals** (`raw_score`=0.90, `salience`=0.85). This indicates a primary strategy of combining a strong, exclusionary in-group identity with an optimistic vision for the future and calls for unity-building projects.\n*   **Strategic Contradiction:** The speech exhibits a complex rhetorical strategy of employing opposing appeals simultaneously. Significant tension was observed on the **Identity Axis** (`identity_tension`=0.26), where strong appeals to Tribal Dominance were paired with weaker but present appeals to Individual Dignity. Conversely, the **Relational Axis** showed no tension (`relational_tension`=0.00), with Enmity and Amity appeals being equally intense and salient.\n*   **Overall Cohesion Profile:** The composite Cohesion Indices, which weigh both intensity and salience, hover near neutral. The **Full Cohesion Index** is slightly negative (-0.060), suggesting that the highly salient appeals to Tribal Dominance, Fear, and Enmity slightly outweigh the appeals to Individual Dignity, Hope, and Amity. This complex balance reveals a message that is neither purely fragmentative nor purely cohesive but strategically leverages elements of both.\n\n**Conclusion:** The analysis of this single document demonstrates the CFF's capacity to quantify complex and contradictory rhetorical strategies. However, without the full corpus, no conclusions can be drawn about trends, relationships between dimensions, or broader patterns in the speaker's communication.\n\n---\n\n### **2. Methodology**\n\n#### **2.1. Analytical Framework**\nThe analysis was conducted using the **Cohesive Flourishing Framework (CFF) v10.4**. This framework measures ten rhetorical dimensions across five opposing axes: Identity, Emotional Climate, Success Orientation, Relational Climate, and Goal Orientation. A key feature of the CFF is the independent measurement of both the intensity (`raw_score`) and rhetorical prominence (`salience`) of each dimension, which allows for the calculation of advanced composite metrics for rhetorical tension and cohesion.\n\n#### **2.2. Corpus and Sample Size**\nThe corpus manifest details seven presidential speeches from 2017-2025. However, the provided data file contained processed scores for only **one document (N=1)**, corresponding to the January 30, 2018, State of the Union address.\n\n#### **2.3. Statistical Protocol and Power Analysis**\nFollowing the THIN Statistical Analysis Protocol, the available sample size of N=1 places this study in the **Exploratory Analysis (N<15)** tier, at its most extreme limit.\n*   **Permitted Analyses:** Descriptive statistics for a single case and calculation of derived metrics as defined by the framework's formulas.\n*   **Prohibited Analyses:** All inferential statistical tests requiring variance and a sample size greater than one (e.g., correlations, t-tests, ANOVA, reliability analysis) were not applicable.\n\nAll derived metrics were calculated internally using the formulas specified in Section 5.4 of the CFF Machine-Readable Appendix. Results are reported according to APA 7th edition standards.\n\n---\n\n### **3. Descriptive Analysis of Dimensional Scores**\n\nThe dimensional scores for the 2018 State of the Union address reveal a rhetorically complex profile where both fragmentative and cohesive themes are present and often highly salient.\n\n**Table 1: CFF Dimensional Scores for the Analyzed Document**\n| Axis | Dimension | Raw Score | Salience | Interpretation |\n| :--- | :--- | :---: | :---: | :--- |\n| **Identity** | **Tribal Dominance** | 0.90 | 0.95 | **Dominant:** Strong, highly emphasized in-group supremacy rhetoric. |\n| | **Individual Dignity** | 0.40 | 0.30 | **Minor:** Weak, low-emphasis appeals to universal human worth. |\n| **Emotional** | **Fear** | 0.80 | 0.75 | **Prominent:** Strong, emphasized appeals to crisis and threat. |\n| | **Hope** | 0.90 | 0.90 | **Dominant:** Strong, highly emphasized optimistic and progress-oriented vision. |\n| **Success** | **Envy** | 0.60 | 0.50 | **Present:** Moderate resentment and zero-sum thinking with moderate emphasis. |\n| | **Mudita** | 0.10 | 0.10 | **Negligible:** Very weak, unemphasized joy for others' success. |\n| **Relational** | **Enmity** | 0.80 | 0.70 | **Prominent:** Strong, emphasized hostility and adversarial positioning. |\n| | **Amity** | 0.80 | 0.70 | **Prominent:** Strong, emphasized friendship and cooperation appeals. |\n| **Goal** | **Fragmentative Goals** | 0.60 | 0.55 | **Present:** Moderate emphasis on divisive, zero-sum objectives. |\n| | **Cohesive Goals** | 0.90 | 0.85 | **Dominant:** Strong, highly emphasized integrative, positive-sum objectives. |\n\n**Interpretation:**\nThe most powerful rhetorical drivers in this speech are **Tribal Dominance**, **Hope**, and **Cohesive Goals**. The speaker's strategy appears to be rooted in framing a specific in-group (\"our people,\" \"American citizens first\") as the central beneficiary of a hopeful, forward-looking vision. This is combined with strong, equally salient appeals to both **Fear/Enmity** (identifying threats and enemies) and **Amity** (calling for unity and cooperation), a classic \"rally around the flag\" strategy that defines an external threat to justify internal cohesion. The minimal presence of **Mudita** suggests a discourse not focused on celebrating external or others' success.\n\n---\n\n### **4. Analysis of Derived Metrics**\n\nThe derived metrics quantify the strategic interplay between the core dimensions.\n\n#### **4.1. Rhetorical Tension Analysis**\nRhetorical Tension measures the use of contradictory appeals where both poles of an axis are present but are emphasized differently. A high score suggests a potentially incoherent or strategically complex message.\n\n**Table 2: Rhetorical Tension Indices (0.0 to 1.0 scale)**\n| Tension Index | Score | Interpretation |\n| :--- | :---: | :--- |\n| **Identity Tension** | 0.260 | **Moderate Tension:** Strong appeals to tribalism are significantly more salient than weaker appeals to universal dignity. |\n| **Emotional Tension** | 0.120 | **Low Tension:** Strong fear and hope appeals are used, but hope is slightly more salient, creating a small tension. |\n| **Success Tension** | 0.040 | **Very Low Tension:** Resentment (Envy) is present, but joy for others' success (Mudita) is so minimal that there is little contradiction. |\n| **Relational Tension** | 0.000 | **No Tension:** Hostility (Enmity) and friendship (Amity) appeals are equally intense and equally salient, creating a balanced but polarized relational message. |\n| **Goal Tension** | 0.180 | **Low-to-Moderate Tension:** Cohesive goals are more intense and salient than fragmentative goals, creating some strategic tension. |\n| | | |\n| **Strategic Contradiction Index** | **0.120** | **Low Overall Contradiction:** The average tension is low, indicating a rhetorically consistent, albeit complex, message. |\n\n**Interpretation:** The highest tension exists on the **Identity** axis. The speech strongly emphasizes exclusionary identity (`salience`=0.95) while making less prominent gestures towards universal inclusion (`salience`=0.30). The complete lack of tension on the **Relational** axis is noteworthy: the speaker invests equally in framing enemies and calling for friendship, suggesting a dual strategy of confrontation and unification aimed at different audiences or contexts within the same speech.\n\n#### **4.2. Salience-Weighted Cohesion Analysis**\nCohesion Indices measure the overall leaning of the discourse toward fragmentation or cohesion, normalized by the total salience of the contributing dimensions. Positive scores indicate a cohesive emphasis, while negative scores indicate a fragmentative emphasis.\n\n**Table 3: Salience-Weighted Cohesion Indices (-1.0 to +1.0 scale)**\n| Cohesion Index | Formula Components | Score | Interpretation |\n| :--- | :--- | :---: | :--- |\n| **Descriptive Cohesion** | Emotional, Success, Relational | -0.022 | **Neutral/Slightly Negative:** The immediate emotional and relational climate is balanced, with a very slight tilt toward fear, envy, and enmity when emphasis is considered. |\n| **Motivational Cohesion** | Adds Goal Orientation | 0.070 | **Neutral/Slightly Positive:** Factoring in the highly salient cohesive goals pushes the motivational profile of the speech into slightly positive territory, suggesting a push toward cooperative action. |\n| **Full Cohesion** | Adds Identity Axis | -0.060 | **Neutral/Slightly Negative:** When the highly salient and intensely negative identity component is included, the comprehensive \"democratic health\" profile becomes slightly negative. |\n\n**Interpretation:** The cohesion profile of the speech is remarkably balanced around zero. This demonstrates a sophisticated rhetorical strategy where fragmentative appeals (especially **Tribal Dominance**) are almost perfectly counterweighted by cohesive appeals (especially **Hope** and **Cohesive Goals**). The final **Full Cohesion Index** of -0.060 indicates that, despite strong calls for unity and a hopeful future, the underlying, highly salient message of in-group preference and exclusion is powerful enough to pull the overall tone into fragmentative territory.\n\n---\n\n### **5. Framework Performance and Corpus Fit**\n\nA quantitative assessment of framework-corpus fit is impossible with a single data point. However, a qualitative assessment can be offered.\n\n*   **Dimensional Variance & Effect Size:** Cannot be computed (Requires N > 1).\n*   **Theoretical Validation (Qualitative):** The CFF is designed to capture rhetorically complex texts where opposing appeals are used simultaneously. The analyzed speech, with its high scores on opposing dimensions like Fear/Hope and Enmity/Amity, is a prime example of such a text. The framework successfully quantified this complexity, which supports its theoretical utility. The high `raw_score` and `salience` for `tribal_dominance` alongside high scores for `cohesive_goals` aligns with populist rhetoric that uses exclusionary identity to define a \"people\" for whom cohesive action is then proposed.\n*   **Corpus Suitability:** The corpus consists of formal presidential speeches, which are a form of persuasive and strategic communication. This is the ideal text type for which the CFF was designed.\n*   **Overall Fit Score & Interpretation:** A quantitative fit score cannot be computed. Based on a qualitative review, the framework demonstrates a **High Potential Fit** with the corpus. The dimensions are well-specified to detect the nuanced and often contradictory appeals common in high-stakes political discourse. This initial finding, however, requires statistical validation across the entire corpus.\n\n---\n\n### **6. Conclusion and Recommendations for Future Research**\n\nThis analysis provided a detailed descriptive case study of a single presidential address using the Cohesive Flourishing Framework. The results reveal a rhetorically sophisticated speech balancing powerful cohesive appeals (Hope, Amity, Cohesive Goals) against equally powerful fragmentative appeals (Tribal Dominance, Fear, Enmity).\n\nThe primary and most critical recommendation is to **conduct the analysis on the full corpus of seven documents.** Such an analysis would enable a robust, statistically-grounded investigation of the research question. With the full dataset, the following analyses should be prioritized:\n\n1.  **Corpus-Wide Descriptive Statistics:** Calculate means and standard deviations for all 10 raw scores and salience scores to establish baseline rhetorical patterns for this speaker.\n2.  **Dimensional Relationship Analysis:** Perform a correlation matrix analysis (Pearson's r) between all 10 dimensions to test the framework's theoretical assumptions (e.g., a negative correlation between opposing pairs like `hope` and `fear`) and uncover other strategic linkages (e.g., correlation between `tribal_dominance` and `enmity`).\n3.  **Analysis of Change Over Time:** Treat `year` as a variable to analyze trends in the speaker's rhetoric across the 2017-2025 period. This could involve correlation analyses against time or ANOVA comparing presidential periods ('early', 'mid', 'late', 'recent').\n4.  **Comparison of Speech Types:** Use t-tests or ANOVA (with appropriate caveats for small group sizes) to compare the rhetorical profiles of different `speech_type` categories (e.g., 'inaugural' vs. 'state_of_union').",
  "documents_processed": 28,
  "timestamp": "2025-09-23T02:38:37.658379+00:00"
}