{
  "analysis_id": "stats_stats_20250923T031405Z",
  "step": "statistical_analysis",
  "model_used": "vertex_ai/gemini-2.5-pro",
  "statistical_analysis": "Here is a comprehensive statistical analysis based on the provided framework and data.\n\n***\n\n### **Statistical Analysis Report: Cohesive Flourishing Framework (CFF) v10.4**\n\n**Experiment ID:** 2b_cff_cohesive_flourishing\n**Analysis Date:** October 26, 2023\n**Framework:** Cohesive Flourishing Framework (CFF) v10.4\n**Corpus:** Cohesive Flourishing Framework Analysis Corpus (v10.0)\n\n---\n\n### **Executive Summary**\n\nThis report presents a statistical analysis of rhetorical patterns within a subset of the specified corpus, utilizing the Cohesive Flourishing Framework (CFF) v10.4. The analysis was conducted on a dataset of **N=2** documents: the 2017 State of the Union (SOTU) address (Index 1) and the 2025 SOTU address (Index 5).\n\nDue to the extremely small sample size (N=2), this analysis is strictly a **direct quantitative comparison** between the two texts. Standard inferential statistics (e.g., t-tests, correlations, ANOVA) and robust descriptive statistics are not applicable. The findings herein describe specific differences between these two documents and cannot be generalized to the broader corpus or used to infer statistical trends.\n\nThe analysis reveals a substantial rhetorical divergence between the 2017 and 2025 speeches. Key findings include:\n\n1.  **Shift Towards Fragmentation:** The 2025 speech demonstrates a marked shift towards a more fragmentative and less cohesive rhetorical profile compared to the 2017 speech. This is most clearly captured by the **Full Cohesion Index**, which declined sharply from **-0.060** in 2017 to **-0.371** in 2025.\n\n2.  **Erosion of Bridging Rhetoric:** The most dramatic changes occurred in dimensions related to social connection. **Amity** (friendship appeals) collapsed from a raw score of 0.80 to 0.10, while **Individual Dignity** (universal human worth) disappeared entirely (0.40 to 0.00). Concurrently, **Enmity** (hostility) and **Envy** (resentment) intensified.\n\n3.  **Increased Rhetorical Consistency:** The 2025 speech, while more divisive, was more rhetorically coherent. The **Strategic Contradiction Index** decreased from 0.120 to 0.042, suggesting a reduction in mixed messaging and a more focused, consistent application of fragmentative appeals.\n\n4.  **Framework Performance:** While a full Framework-Corpus Fit analysis is impossible, the CFF demonstrated its capacity to discriminate between the two texts, capturing an average difference of **0.205** on a 1.0-point scale across the 10 core dimensions.\n\nThis analysis provides a quantitative snapshot of rhetorical evolution between two specific points in time, as measured by the CFF. All findings should be considered preliminary and exploratory, requiring a larger dataset for validation.\n\n---\n\n### **1. Methodological Limitations and Analytical Approach**\n\nThe provided dataset contains analysis results for only two documents (N=2). This sample size falls below the minimum threshold for any meaningful inferential or descriptive statistical analysis. Consequently, the standard Tier 3 protocol (for N<15) cannot be fully applied.\n\nThe analytical approach has been adapted as follows:\n*   **No Inferential Statistics:** P-values, confidence intervals for population parameters, and tests of statistical significance are not calculated or reported.\n*   **Direct Comparison:** The analysis is limited to a direct, side-by-side comparison of the CFF scores for the two documents.\n*   **Metric Calculation:** All derived metrics from the CFF v10.4 specification (Tension Indices, Cohesion Indices) have been calculated for each document to facilitate a framework-centric comparison.\n*   **Interpretation:** All interpretations are explicitly limited to the two documents under examination and are presented as observations rather than generalizable findings.\n\n---\n\n### **2. Framework Performance and Discriminatory Power**\n\nA complete Framework-Corpus Fit analysis, which relies on corpus-wide variance and correlational structures, cannot be performed. However, we can assess the framework's fundamental ability to differentiate between the two provided texts.\n\nThe average absolute difference between the two documents across the 10 primary `raw_score` dimensions was **0.205**. This indicates that the framework was sensitive enough to detect moderate-to-large rhetorical differences between the speeches, particularly on the Relational Climate and Identity axes. For instance, the framework measured a difference of 0.70 for `Amity` and 0.40 for `Individual Dignity`, demonstrating its discriminatory power on key theoretical constructs.\n\n---\n\n### **3. Comparative Rhetorical Analysis: 2017 vs. 2025**\n\nThe following table presents the complete CFF v10.4 metrics for the 2017 SOTU address and the 2025 SOTU address.\n\n| Metric Type | Dimension / Index | 2017 SOTU (Index 1) | 2025 SOTU (Index 5) | Change |\n| :--- | :--- | :--- | :--- | :--- |\n| **Raw Score** | **Tribal Dominance** | 0.900 | 0.900 | 0.000 |\n| | **Individual Dignity** | 0.400 | 0.000 | **-0.400** |\n| | **Fear** | 0.800 | 0.900 | +0.100 |\n| | **Hope** | 0.900 | 0.950 | +0.050 |\n| | **Envy** | 0.600 | 0.750 | +0.150 |\n| | **Mudita** | 0.100 | 0.000 | **-0.100** |\n| | **Enmity** | 0.800 | 0.950 | +0.150 |\n| | **Amity** | 0.800 | 0.100 | **-0.700** |\n| | **Fragmentative Goals** | 0.600 | 0.900 | **+0.300** |\n| | **Cohesive Goals** | 0.900 | 0.800 | -0.100 |\n| **Salience** | **Tribal Dominance** | 0.950 | 0.900 | -0.050 |\n| | **Individual Dignity** | 0.300 | 0.000 | **-0.300** |\n| | **Fear** | 0.750 | 0.900 | +0.150 |\n| | **Hope** | 0.900 | 0.950 | +0.050 |\n| | **Envy** | 0.500 | 0.700 | +0.200 |\n| | **Mudita** | 0.100 | 0.000 | -0.100 |\n| | **Enmity** | 0.700 | 0.900 | +0.200 |\n| | **Amity** | 0.700 | 0.050 | **-0.650** |\n| | **Fragmentative Goals** | 0.550 | 0.900 | **+0.350** |\n| | **Cohesive Goals** | 0.850 | 0.800 | -0.050 |\n| **Derived** | **Identity Tension** | 0.260 | 0.000 | -0.260 |\n| **Metrics** | **Emotional Tension** | 0.120 | 0.045 | -0.075 |\n| | **Success Tension** | 0.040 | 0.000 | -0.040 |\n| | **Relational Tension** | 0.000 | 0.085 | +0.085 |\n| | **Goal Tension** | 0.180 | 0.080 | -0.100 |\n| | **Strategic Contradiction Index** | 0.120 | 0.042 | **-0.078** |\n| | **Descriptive Cohesion Index** | -0.022 | -0.366 | **-0.344** |\n| | **Motivational Cohesion Index** | 0.070 | -0.279 | **-0.349** |\n| | **Full Cohesion Index** | -0.060 | -0.371 | **-0.311** |\n\n#### **3.1. Analysis by Thematic Axis**\n\n*   **Identity Axis:** While `Tribal Dominance` remained at a consistently high intensity and salience in both speeches, `Individual Dignity` was a moderately present theme in 2017 (Score: 0.40, Salience: 0.30) but was entirely absent in 2025 (Score: 0.00, Salience: 0.00). This indicates a shift from a mixed \"us vs. them\" / \"common humanity\" message to a purely exclusionary identity framework.\n\n*   **Emotional Climate:** Both speeches scored high on `Fear` and `Hope`, a common feature of strategic political communication. The 2025 speech saw a slight intensification of both, suggesting an escalation of the perceived stakes (both crisis and opportunity).\n\n*   **Success Orientation:** The 2025 speech shows a stronger reliance on grievance rhetoric. `Envy` (resentment of others' success) increased in both intensity (0.60 to 0.75) and salience (0.50 to 0.70), while `Mudita` (joy in others' success) disappeared. This points to a hardening of zero-sum thinking.\n\n*   **Relational Climate:** This axis shows the most profound shift. In 2017, `Enmity` and `Amity` were both present with high intensity (0.80) and salience (0.70), indicating a classic rhetorical strategy of identifying enemies while simultaneously calling for unity. In 2025, this balance collapses: `Enmity` intensifies (Score: 0.95, Salience: 0.90) while `Amity` becomes rhetorically insignificant (Score: 0.10, Salience: 0.05). This marks a move from a \"conflict-and-reconciliation\" frame to a purely adversarial one.\n\n*   **Goal Orientation:** The objectives presented in the speeches shifted from building to breaking. In 2017, `Cohesive Goals` (Score: 0.90) outweighed `Fragmentative Goals` (Score: 0.60). By 2025, this inverted, with `Fragmentative Goals` (Score: 0.90) becoming more intense than `Cohesive Goals` (Score: 0.80) and significantly more salient (0.90 vs. 0.80).\n\n#### **3.2. Analysis of Composite Indices**\n\n*   **Strategic Contradiction:** The `Strategic Contradiction Index` fell from 0.120 to 0.042. This suggests the 2025 speech was more rhetorically *consistent* than the 2017 speech. The 2017 speech balanced opposing appeals (e.g., Tribal Dominance vs. Individual Dignity; Enmity vs. Amity), creating rhetorical tension. The 2025 speech largely abandoned the cohesive side of these pairs, resulting in a more uniform—though more divisive—message.\n\n*   **Cohesion Indices:** All three cohesion indices, which provide a salience-weighted measure of the discourse's overall leaning, shifted dramatically downward into negative territory.\n    *   The **Descriptive Cohesion Index** (emotional/relational climate) fell from -0.022 to -0.366, reflecting the sharp rise in Enmity and Envy.\n    *   The **Motivational Cohesion Index** (behavioral drivers) fell from +0.070 to -0.279, indicating a shift from rhetoric encouraging positive-sum cooperation to that encouraging zero-sum competition.\n    *   The **Full Cohesion Index** (overall democratic health indicator) fell from -0.060 to -0.371. According to the framework's theoretical grounding in deliberative democracy, this represents a significant shift towards discourse that undermines social solidarity and promotes fragmentation.\n\n---\n\n### **4. Conclusion and Recommendations**\n\nThis quantitative comparison of two speeches through the lens of the Cohesive Flourishing Framework v10.4 reveals a clear and measurable rhetorical evolution. The analysis documents a shift from a complex message balancing cohesive and fragmentative appeals in 2017 to a more consistent, but starkly more divisive and adversarial, rhetorical posture in 2025. The collapse of `Amity` and `Individual Dignity`, coupled with the rise of `Enmity`, `Envy`, and `Fragmentative Goals`, is the primary driver of the steep decline in the overall `Full Cohesion Index`.\n\n**Crucial Caveat:** These findings are based on N=2 and are purely observational. They describe a difference between two specific texts and **cannot** be used to infer a trend, make causal claims, or be generalized to the speaker's overall communication patterns.\n\n**Recommendation for Future Research:** To validate these exploratory patterns, the analysis should be expanded to the full corpus of N=7 documents. This would enable a more robust Tier 3 exploratory analysis, including the calculation of descriptive statistics, non-parametric correlations (Spearman's rho), and an initial assessment of the framework's internal consistency (Cronbach's alpha), providing a more reliable, though still preliminary, picture of the rhetorical strategies present in the corpus.",
  "documents_processed": 7,
  "timestamp": "2025-09-23T03:15:42.218090+00:00"
}