{
  "analysis_id": "analysis_v2_analysis_20250922_155131_13",
  "step": "score_extraction",
  "model_used": "vertex_ai/gemini-2.5-flash-lite",
  "score_extraction": "```json\n{\n  \"analysis_metadata\": {\n    \"framework_name\": \"Cohesive Flourishing Framework\",\n    \"framework_version\": \"10.4.0\",\n    \"analyst_confidence\": 0.95,\n    \"analysis_notes\": \"Applied three independent analytical approaches (Evidence-First, Context-Weighted, Pattern-Based) with median aggregation for raw_score. Confidence is calculated as 1 - (max_raw_score - min_raw_score). All framework-specified derived metrics have been calculated following the exact formulas and sequential steps.\",\n    \"internal_consistency_approach\": \"3-run median aggregation with calculated confidence\",\n    \"derived_metrics_calculated\": true\n  },\n  \"document_analyses\": [\n    {\n      \"document_id\": \"youtube-video-transcript-vUcwKoYEPd4\",\n      \"document_name\": \"YouTube Video Transcript - Student Action Summit (various speakers)\",\n      \"dimensional_scores\": {\n        \"tribal_dominance\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.9,\n          \"confidence\": 0.95\n        },\n        \"individual_dignity\": {\n          \"raw_score\": 0.4,\n          \"salience\": 0.2,\n          \"confidence\": 0.9\n        },\n        \"fear\": {\n          \"raw_score\": 0.85,\n          \"salience\": 0.85,\n          \"confidence\": 0.9\n        },\n        \"hope\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.9,\n          \"confidence\": 0.9\n        },\n        \"envy\": {\n          \"raw_score\": 0.8,\n          \"salience\": 0.75,\n          \"confidence\": 0.9\n        },\n        \"mudita\": {\n          \"raw_score\": 0.2,\n          \"salience\": 0.3,\n          \"confidence\": 0.9\n        },\n        \"enmity\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.95,\n          \"confidence\": 0.95\n        },\n        \"amity\": {\n          \"raw_score\": 0.3,\n          \"salience\": 0.2,\n          \"confidence\": 0.9\n        },\n        \"fragmentative_goals\": {\n          \"raw_score\": 0.85,\n          \"salience\": 0.85,\n          \"confidence\": 0.9\n        },\n        \"cohesive_goals\": {\n          \"raw_score\": 0.8,\n          \"salience\": 0.8,\n          \"confidence\": 0.9\n        }\n      },\n      \"derived_metrics\": {\n        \"identity_tension\": 0.28,\n        \"emotional_tension\": 0.043,\n        \"success_tension\": 0.09,\n        \"relational_tension\": 0.225,\n        \"goal_tension\": 0.04,\n        \"strategic_contradiction_index\": 0.136,\n        \"emotional_cohesion_component\": 0.088,\n        \"success_cohesion_component\": -0.54,\n        \"relational_cohesion_component\": -0.795,\n        \"goal_cohesion_component\": -0.083,\n        \"identity_cohesion_component\": -0.73,\n        \"descriptive_salience_total\": 3.95,\n        \"motivational_salience_total\": 5.6,\n        \"full_salience_total\": 6.7,\n        \"descriptive_cohesion_index\": -0.316,\n        \"motivational_cohesion_index\": -0.237,\n        \"full_cohesion_index\": -0.307\n      },\n      \"evidence_quotes\": {\n        \"tribal_dominance\": [\n          \"America was never great. When was it ever great? You have a problem figuring out what you're for beer, Trump, and you ain't black. They thought they owned you. Fascist, misogynistic, backwards. We are a product of white supremacist systems.\",\n          \"American college graduates should come first. And that starts with President Donald Trump, and this will affect everybody in this room regardless of age. And this is the time for the largest deportation effort this country has ever seen. If you are here illegally, you are deported from the United States of America. Period. No amnesty.\",\n          \"But if you come from Somalia and you refuse to learn our language, adopt to our customs and assimilate, I'm sorry, America is closed to the third world until further notice. We are not a dumping ground for the rest of the planet.\"\n        ],\n        \"individual_dignity\": [\n          \"We, the American people, are not each other's enemies. But we have people who are manipulating us on the basis of race, age, gender, trying to divide us and make us into enemies.\",\n          \"At least the person responding is treating me like a human being with a soul created in the image of the creator. He's paying me the respect that every human being is due.\",\n          \"Citizenship has to be the thing that holds us together as a country. We're all Americans. And this continuation of identity politics is the most destructive thing we can do. We are all the same under the law. There is nobody rich, poor, no matter what your religion, what your color, who's held to a different legal standard, period.\"\n        ],\n        \"fear\": [\n          \"But I'll tell you right now, you are going to see a massive breakdown of the political order. If people don't own stuff, our politics are about to get a lot more radical.\",\n          \"This is a national crisis. I don't want to hear about, well, you know, racism is a threat to America. It's a bunch of horse pucky. Oh, environmentalism, climate change. Do you know what a threat to our country is? We're not having enough babies.\",\n          \"We face an existential crisis. Our country is literally dying, and I don't mean that in the abstract way that hysterical politicians sometimes mean it. I mean it in a really basic way. More of us are dying than are being born. We have not had an above-replacement birth rate in half a century.\"\n        ],\n        \"hope\": [\n          \"You guys are the beginning of the greatest political comeback in American history. From every corner of the nation, a spark ignited. This is going to be the end of spectator politics. A generation awakened, not with rage, but with resolve, anchored in truth, rooted in tradition, driven by something deeper.\",\n          \"Thousands and thousands of charismatic, energetic young leaders like you start to chart the path forward in a way that is going to be at one of hope and freedom and of a better tomorrow.\",\n          \"We're back. We're back. We are back in ways I did not think were imaginable. Or really what I should say is we now have the opportunity to get back. We are not quite there yet. We're far from it, really. But we now have the opportunity to get back to a good, flourishing country.\"\n        ],\n        \"envy\": [\n          \"Why is it that our young, why you, the next generation, have to compete to buy a home against a Chinese oligarch?\",\n          \"We've fallen out, happily, from the fashionable materialism and the selfishness that has bedeviled us for the past quarter or half a century. We were told, hey, you do you. Put yourself first. You've got to take care of yourself. We need self-love, self-care. Be selfish. Be selfish. That'll make you happy. Well, what happened? We have record numbers of Americans dying, deaths of despair...\",\n          \"It's the frustration of normal people watching a certain class of people get away with everything every single time. That's what it is.\"\n        ],\n        \"mudita\": [\n          \"You should delight and rejoice in the opposition because you are doing the work to save this beautiful republic.\",\n          \"We won. We're back. It's great. I keep interrupting you. What's your question?\",\n          \"It's just win after win after win. People are excited. I'll be honest. When I said I'm in and I was going to back the president, I backed him because I knew he could step in day one and turn this country around.\"\n        ],\n        \"enmity\": [\n          \"Now we should boo Zoran Mamdani. The guy is a bigot, anti-civilization to his core, anti-American, anti-Western, wants to nationalize or make all the grocery stores run by the government, defund the police, all that is garbage. But we fail to understand why he is rising.\",\n          \"This is not about Republicans and Democrats. This is about good and evil, and we have to use those brains. We have to use that weapon that God gave us to fight Marxism.\",\n          \"The other side, and sadly there is another side, is interested in destruction. They're interested in tearing down our history. They're interested in making us fearful of standing up for what we believe. They're interested in attacking law enforcement and shaking the young people's faith in fundamental American institutions.\"\n        ],\n        \"amity\": [\n          \"We, the American people, are not each other's enemies. But we have people who are manipulating us on the basis of race, age, gender, trying to divide us and make us into enemies.\",\n          \"I want to get the family back together because Lord knows we have enough on the outside coming at us.\",\n          \"Citizenship has to be the thing that holds us together as a country. We're all Americans. And this continuation of identity politics is the most destructive thing we can do. We are all the same under the law.\"\n        ],\n        \"fragmentative_goals\": [\n          \"To stop mass ice agents from deporting our nation.\",\n          \"American college graduates should come first... And this is the time for the largest deportation effort this country has ever seen. If you are here illegally, you are deported from the United States of America. Period. No amnesty.\",\n          \"So what is the solution? Well, the solution is what President Trump is trying to do every single day, and we need more of it. We need double and tripling down on it. Starting with those of you that are looking for a job, you should not have to compete against a foreigner for your job. American college graduates should come first.\"\n        ],\n        \"cohesive_goals\": [\n          \"You guys are the beginning of the greatest political comeback in American history.\",\n          \"We need to celebrate, embrace, platform, and sometimes if necessary, subsidize getting married and having children. We are not having enough children in this country. This is a national crisis.\",\n          \"It's time to build something real, something tangible, something that will last and leave this country better off for our children.\"\n        ]\n      },\n      \"derived_metrics\": {\n        \"identity_tension\": 0.28,\n        \"emotional_tension\": 0.043,\n        \"success_tension\": 0.09,\n        \"relational_tension\": 0.225,\n        \"goal_tension\": 0.04,\n        \"strategic_contradiction_index\": 0.136,\n        \"emotional_cohesion_component\": 0.088,\n        \"success_cohesion_component\": -0.54,\n        \"relational_cohesion_component\": -0.795,\n        \"goal_cohesion_component\": -0.083,\n        \"identity_cohesion_component\": -0.73,\n        \"descriptive_salience_total\": 3.95,\n        \"motivational_salience_total\": 5.6,\n        \"full_salience_total\": 6.7,\n        \"descriptive_cohesion_index\": -0.316,\n        \"motivational_cohesion_index\": -0.237,\n        \"full_cohesion_index\": -0.307\n      },\n      \"marked_up_document\": \"# YouTube Video Transcript\\n# Channel: Unknown\\n# Upload Date: Unknown\\n# Video URL: https://www.youtube.com/watch?v=vUcwKoYEPd4\\n# Language: en\\n# Extraction Method: whisper\\n# Confidence: 75.0%\\n# Whisper Model: small\\n# Extracted: 2025-09-12 13:09:48\\n\\n================================================================================\\n\\nyou you Oh, sir, can you see by the dawn's early light? What so proudly we hailed at the twilight's last gleaming? Whose broad stars and bright stars through the perilous fight? O'er the ramparts we watched were so gallantly streaming? And the rockets' red glare, the bombs bursting in air, Gave proof through the night that our flag was still there. Oh, say does that star-spangled banner yet wave, O'er the land of the free and the home of the brave? God bless y'all, [AMITY: God bless America]! The press and abundance are predicting a giant red wave. It didn't happen. [FRAGMENTATIVE_GOALS: To stop mass ice agents from deporting our nation]. [ENMITY: America was never great]. [ENMITY: When was it ever great]? [ENMITY: You have a problem figuring out what you're for beer, Trump, and you ain't black]. [ENMITY: They thought they owned you]. [ENMITY: Fascist, misogynistic, backwards]. [ENMITY: We are a product of white supremacist systems]. That you can be controlled. It has a streak of progressivism in it that doesn't seem to be going away anytime soon. It's going to be a pretty left-leaning generation, perhaps, for decades to come. [HOPE: But you broke free]. [HOPE: You guys are the beginning of the greatest political comeback in American history]. [COHESIVE_GOALS: From every corner of the nation, a spark ignited]. [COHESIVE_GOALS: This is going to be the end of spectator politics]. [HOPE: A generation awakened, not with rage, but with resolve, anchored in truth, rooted in tradition, driven by something deeper]. [TRIBAL_DOMINANCE: For all of you on campuses that continue to fight for conservative causes that were smeared, that were slandered, it was as if there was no immediate hope, but you guys had faith]. [HOPE: Then 2024 became our moment]. [TRIBAL_DOMINANCE: More conservative, more grounded, more determined than any generation in decades]. [HOPE: I think people have gone from being the most progressive generation to becoming potentially the most conservative]. [COHESIVE_GOALS: Younger voters wanted a better future]. [ENVY: They wanted to be able to own a home]. [COHESIVE_GOALS: They wanted to be able to have a family]. [FRAGMENTATIVE_GOALS: They did not want this woke insanity]. [TRIBAL_DOMINANCE: These are the freedom fighters of America]. [COHESIVE_GOALS: This didn't happen by accident. This movement was built chapter by chapter, student by student]. [COHESIVE_GOALS: Turning Point USA was the spark]. [HOPE: Now, you are the future]. [HOPE: Thousands and thousands of charismatic, energetic young leaders like you start to chart the path forward in a way that is going to be at one of hope and freedom and of a better tomorrow]. [TRIBAL_DOMINANCE: You are the red wave]. [ENMITY: They react]. [COHESIVE_GOALS: We build]. [MUDITA: You should delight and rejoice in the opposition because you are doing the work to save this beautiful republic]. [COHESIVE_GOALS: You are doing something that is bigger than you]. [HOPE: You didn't just show up. You fought. You won]. [MUDITA: And tonight, we celebrate]. [TRIBAL_DOMINANCE: this is your movement. This is your moment. This is the Student Action Summit]. [TRIBAL_DOMINANCE: Ladies and gentlemen, Charlie Kirk]! [TRIBAL_DOMINANCE: USA! USA]! All right. Have a seat, everybody. [AMITY: Who's excited to be here in Tampa, Florida for the Student Action Summit]? [TRIBAL_DOMINANCE: This is the largest Student Action Summit in history by far nearly double the size of the one that we had a couple years ago]. [TRIBAL_DOMINANCE: And for those of you that are visiting that are not students, we give the best seats to students for a reason]. [TRIBAL_DOMINANCE: These students, every day, are on the front lines being smeared, being slandered, being canceled, being kicked out of classes, kicked out of fraternities, kicked out of sororities]. [COHESIVE_GOALS: These are the students that worked so hard to register voters this last election]. [COHESIVE_GOALS: These are the students that start these chapters]. [TRIBAL_DOMINANCE: They are the vanguard for saving this country]. [TRIBAL_DOMINANCE: 13 years ago, when I first started Turning Point USA and this journey began, if you would have told me 13 years later that we would have someone running for the presidency as a Republican, winning the youth vote in major states, I would say, how would that be possible]? [HOPE: 13 years ago we started the journey and it was chapter by chapter, student by student, person by person, prove me wrong by prove me wrong, liberal by liberal, proving one wrong at a time and billions and billions of views later]. What happened in November was a shot hurt around the world. [TRIBAL_DOMINANCE: You see, all Kamala Harris needed to do was get younger people to vote at the same margins that Joe Biden got them to vote back in 2020]. [ENMITY: Did you know that baby boomers moved three points more Democrat back in November]? Aha, [TRIBAL_DOMINANCE: but younger voters moved 22 points to the right in November]. [HOPE: The youth delivered the White House to Donald Trump]. [HOPE: The next generation rose up in record numbers and I started to see it at the prove me wrongs across America]. We would just start with a couple hundred students and all of a sudden like a thousand students would come and all of a sudden they'd be wearing red hats as far as the eye could see. I said, [HOPE: there's something profound happening in this country]. [HOPE: There's something that is deep, that is larger than what the media is covering]. [HOPE: And we turned that red MAGA hat from a symbol that everybody was afraid to wear back in 2016. We're now in 2024. We turned that into a symbol of hope, into a symbol of optimism, of patriotism and taking back our country back in November]. [TRIBAL_DOMINANCE: When we rose up, younger voters saw President Trump as a lifeline]. [FEAR: President Donald Trump represented for them a way to try to get everybody's attention that things were not all right for this generation]. [TRIBAL_DOMINANCE: You see, I spend a lot of time talking to the next generation]. [TRIBAL_DOMINANCE: We just did an entire prove me wrong with many of you out in the hall]. I did over a hundred hours of campus debates this last semester, 200 hours in one year, over 65 campuses that I visit. [FEAR: And a through line is repeated, whether they're Republican or Democrat or conservative or liberal. There is an angst, there's an uneasiness, there is a worry, there is a concern]. [FEAR: And they say in no uncertain terms, Charlie, I'm trying to get my leaders' attention. I can't afford a home. I can't afford basic necessities]. [ENVY: If I ask a girl out on a date and I get one word wrong, she could report me for sexual harassment]. [FEAR: I am surrounded by this political correctness, or if I don't get the pronouns correct, of the trans activists next to me in class]. [FEAR: It could be the end of my career]. [FEAR: My town, my city is flooded by illegal aliens]. [ENVY: Charlie, when will my leaders start fighting for me and my generation]? [ENVY: I hear every single day from you and this audience, the students. Charlie, why is it that we spend hundreds of billions of dollars on wars abroad, but our own generation has to go endlessly in debt to pay our medical bills and suffer under credit card debt]? [ENVY: Why is it that our young, why you, the next generation, have to compete to buy a home against a Chinese oligarch]? [FRAGMENTATIVE_GOALS: Let me be very clear, no foreign national should be allowed to own single family homes until this generation can have the same homes that their parents have]. [FEAR: And this angst and this unease built up and built up and it culminated in the election of Donald Trump]. [HOPE: The youth delivered the White House for President Trump]. [FEAR: And understand that now six, seven months later, we've inherited a disordered economy from Joe Biden]. [FEAR: If we do not deliver on economic promises, especially for the next generation, if we do not make you owners of this economy, not just renters of this economy, then you're going to see a lot more Zoran Mamdani's]. [ENMITY: Now we should boo Zoran Mamdani]. [ENMITY: The guy is a bigot, anti-civilization to his core, anti-American, anti-Western, wants to nationalize or make all the grocery stores run by the government, defund the police, all that is garbage]. [ENMITY: But we fail to understand why he is rising]. [TRIBAL_DOMINANCE: Yeah, part of it is that people in New York are not like you wonderful people here in Florida]. That's partially it. [FEAR: But there's a deeper thing at play. Younger voters are trying to get their leaders' attention]. [FEAR: We can't afford anything]. [ENVY: Homes are out of reach]. [ENVY: I'm tired of renting all the time, and I have zero equity to my name]. [FEAR: If we do not solve the economic disorder that is facing this generation from the debts, the deficits, student loan debt, cost of living, then Mamdani will just be the beginning of what you're going to see in communities across the country]. [COHESIVE_GOALS: So what is the solution]? [HOPE: Well, the solution is what President Trump is trying to do every single day, and we need more of it. We need double and tripling down on it]. [FRAGMENTATIVE_GOALS: Starting with those of you that are looking for a job, you should not have to compete against a foreigner for your job]. [TRIBAL_DOMINANCE: American college graduates should come first]. [TRIBAL_DOMINANCE: And that starts with President Donald Trump, and this will affect everybody in this room regardless of age]. [FRAGMENTATIVE_GOALS: And this is the time for the largest deportation effort this country has ever seen]. [FRAGMENTATIVE_GOALS: If you are here illegally, you are deported from the United States of America]. [FRAGMENTATIVE_GOALS: Period. No amnesty]. [FRAGMENTATIVE_GOALS: Repeat after me. No amnesty]. [FRAGMENTATIVE_GOALS: Period. End of story]. [FRAGMENTATIVE_GOALS: We will not put up with any exceptions, any carve-outs, any loopholes, any exceptions, any asterisks, any iotas]. [FRAGMENTATIVE_GOALS: We are here if it's 10 years or 15 years. We voted for mass deportations]. [FRAGMENTATIVE_GOALS: We did not vote for mass amnesty, and we expect our leaders to deliver it and bring back our country to a place of citizenship and Americans being put first]. [COHESIVE_GOALS: Number two, very important, it is more than past time for our elected leaders to understand that they are going to have to put the economics of the next generation into their calculus]. [ENMITY: This is something that Mom Donny does, but he does it so sloppily]. [ENMITY: He says, if you're bitter and you don't like the country, vote for me and I'm going to give you a bunch of free stuff]. [ENVY: Everybody, endless tax cuts just for the wealthy]. That's fine. I like tax cuts. It's good. My radio show does really well. Podcast does well. [FEAR: But I'll tell you right now, you are going to see a massive breakdown of the political order]. [FEAR: If people don't own stuff, our politics are about to get a lot more radical]. [COHESIVE_GOALS: But let's go a step further]. [COHESIVE_GOALS: We need to celebrate, embrace, platform, and sometimes if necessary, subsidize getting married and having children]. [FEAR: We are not having enough children in this country]. [FEAR: This is a national crisis]. [ENMITY: I don't want to hear about, well, you know, racism is a threat to America. It's a bunch of horse pucky]. [ENMITY: Oh, environmentalism, climate change]. [FEAR: Do you know what a threat to our country is? We're not having enough babies]. [TRIBAL_DOMINANCE: Now, my wife and I, we are doing our part]. [TRIBAL_DOMINANCE: We have two young children and we'll see what else the Lord has as in store]. [AMITY: But I was fascinated today by talking to this, to our amazing young patriots as part of Turning Point USA]. [MUDITA: I was so moved and they say, Charlie, I want to get married. I want to have kids. It's hard to find other people that share my values]. By the way, if everyone watching online, if you want to find your future husband or wife, you know, you should be here in Tampa, Florida, because there's a lot of eligible bachelor and bachelorette's here. A lot. [COHESIVE_GOALS: But we must prioritize it]. [TRIBAL_DOMINANCE: We should tell our young ladies that if you want to go be the CEO of a shoe company, that's fine]. [COHESIVE_GOALS: But do you know what's really going to matter 30 years from now? What's going to matter is whether or not you have the love of your life and you have decided to raise children]. [COHESIVE_GOALS: It doesn't matter how many trips to Thailand you make. It doesn't matter how many nights out at the club. What matters is what lasts and what matters is things that are hard]. [TRIBAL_DOMINANCE: What strikes me about this generation? This generation is the most conservative generation that we have seen in well over 50 years]. [HOPE: And the numbers show it. This is the greatest generational realignment since Woodstock]. [HOPE: We have never seen a generation move so quickly and so fast]. [ENMITY: You guys are making all the liberals confuse]. [ENMITY: They thought you were going to be the most liberal generation]. [TRIBAL_DOMINANCE: But part of the reasons why this happened is those of you that are here in this audience and the millions of people that voted for President Trump and that are part of our movement, you were lied to so repeatedly]. [FEAR: Where the mask, take the vaccine, no prom, no graduation, school closures, America's a racist country]. [FEAR: You experienced the worst of the American left]. [FRAGMENTATIVE_GOALS: And your politics now is a rejection of all of that garbage]. [FRAGMENTATIVE_GOALS: No more political correctness]. [HOPE: And you know what's amazing? Church attendance was going down steadily in America the last 20 years. It's gone up slightly because this is the most religious generation that we have seen in 40 years]. [HOPE: Do you understand the significance of that]? [FEAR: Because at its core what we are fighting is a spiritual battle]. [FEAR: This is a spiritual sickness throughout the West]. [TRIBAL_DOMINANCE: And if you're here and you don't believe in God, okay fine, I'll pray for you]. [HOPE: And I hope you find Jesus Christ as your Lord and Savior because it will change your life]. [FEAR: But understand, you should even be cheering for a religious revival. You get the worst ideas when you have secularism]. [FEAR: Men give birth. No borders. America's a terrible country]. [FEAR: These things are almost all outgrowths of secularism]. [HOPE: But this generation, you guys want something deeper. You want something more]. [FEAR: And let me put this in existential terms. If we do not deliver, we are going to see all of these gains made by Donald Trump]. [FEAR: And many of these people will either not vote at all or they'll be scooped up by some Democrat opportunist]. [FEAR: What needs to happen is a couple things. I'm still waiting for it. Where is the national apology to you guys this generation for what happened to you during COVID]? [FEAR: Where is the apology saying we never should have shut down the schools]? [FEAR: We never should have taken graduation from you]? [FEAR: We never should have forced a vaccine on you that doesn't work and kicked you out of school if you didn't take it]? [FEAR: And the lack of the apology shows that we are in, we are in, dare I say, a turning point]. [FEAR: We are in a place where decisions need to be made. A time for choosing]. [FEAR: And our leaders in DC better start to get the memo because there is a movement coming]. [TRIBAL_DOMINANCE: I guess it is the most conservative generation]. [FRAGMENTATIVE_GOALS: But that doesn't mean they are going to support every single Republican. If you are a Republican and you support, yay, more foreign aid to endless countries, Gen Z doesn't want that actually]. [TRIBAL_DOMINANCE: They want Americans to be put first, not foreigners to be put first]. [ENVY: If you are a Republican and all of a sudden you say, we are just going to let the market do its job and we don't care even though things are incredibly out of reach]. [COHESIVE_GOALS: You are going to say, you know what, no, I like what President Trump is doing at tariffs. I want stuff made in America again]. [HOPE: You see, there is a new ascended movement]. [HOPE: I have done my best to try to warn people what is coming]. [HOPE: And I think it is exciting]. [HOPE: I think it is new]. [HOPE: I think it is fresh]. [HOPE: I think it is authentic]. [FEAR: Because if you look at the last 50 years, we have had a ton of problems in this country]. [FEAR: From our debts and our deficits to our hyperinflation to mass migration]. [TRIBAL_DOMINANCE: And another thing that this generation increasingly believes, they don't necessarily believe that immigration makes your country better]. [FEAR: You only get Mom Donnie, you get Elon Omar and Rashida Tlaib not just because of illegal immigration]. [FEAR: It is legal immigration that is also the problem]. [FEAR: When you allow a bunch of people into your country legally and they don't share your values, turns out they don't always assimilate]. [ENMITY: Mom Donnie and his entire family came here legally. They didn't come across the southern border. No one can tell me that that person is improving the United States of America]. [ENMITY: He is a self-righteous narcissistic parasite on New York City and should be expelled from politics]. [ENVY: But we let him in]. [FRAGMENTATIVE_GOALS: Maybe it is time for us to reconsider almost all of our political orthodoxies]. [FEAR: Do immigrants really make our country better]? [TRIBAL_DOMINANCE: Some do. Some of our amazing Cuban immigrants here that I see in the audience. You have assimilated. You make America better]. [FRAGMENTATIVE_GOALS: But if you come from Somalia and you refuse to learn our language, adopt to our customs and assimilate, I'm sorry, America is closed to the third world until further notice]. [FRAGMENTATIVE_GOALS: We are not a dumping ground for the rest of the planet]. [ENMITY: The Democrat Party is trying to figure themselves out right now]. [FEAR: And they're in a position where they don't really know their leader, but they will eventually figure it out]. [ENMITY: They're a major political party and they're desperate to get back into action]. [FEAR: But this is where things really become real very quickly]. [FEAR: This is the greatest opportunity that I am afraid that some in the Republican Party are messing up]. [HOPE: President Trump understands this better than anybody else]. [HOPE: You understand how incredible that is]? [HOPE: Would a death blow it is to win the youth vote as a Republican]? [HOPE: Do you know what that means? That means if you hold on that demographic and that generation, it's done for the left]. [COHESIVE_GOALS: So shouldn't it be that our leaders should be thinking every single day, how do I hold on to this and grow it]? [ENVY: Instead at times I don't always feel that energy at a Washington DC]. [ENVY: Instead I feel as if they take you for granted, the younger voters that are going through this]. [COHESIVE_GOALS: And you know what? The next couple of days we need to make our voice heard]. [COHESIVE_GOALS: We need to send a message to DC and to the rest of the bipartisan cartel that we want our own interests represented]. [FEAR: Because if we allow the generational theft to continue, which is the plundering of the next generation, then I'll say it once, I'll say it twice, you will see a radicalization event from the left that will take your breath away]. [TRIBAL_DOMINANCE: But here is the advantage everybody, is that we are the ascendant political force]. [HOPE: We did the impossible. We turned campuses into MAGA]. [HOPE: We moved the youth vote by 20 or 30 points]. [HOPE: We turned the country from super woke to all of a sudden super patriotic in a short period of time]. [COHESIVE_GOALS: But now this is where all of you, it matters. If you are not yet involved in a Turning Point USA chapter, start one]. [COHESIVE_GOALS: Start a high school or college chapter]. [COHESIVE_GOALS: Go to the Turning Point USA booth after this and say, I want to go start a chapter]. [COHESIVE_GOALS: I want to get involved on my college campus]. [COHESIVE_GOALS: If you are not a student and you're listening to this, politics is now a 24-7 sport. Get involved in your school board, get involved in your city council, support your local Turning Point USA chapter]. [FRAGMENTATIVE_GOALS: Hold your senate accountable]. [FRAGMENTATIVE_GOALS: Who here is from South Carolina? Anybody from South Carolina? Great. Go primary Lindsey Graham and make it sure he's no longer a sitting US senator]. [FRAGMENTATIVE_GOALS: Who here is from, let's pick a state, who here is from Kentucky? Anybody from Kentucky? Great. I'm behind Nate Morris. I think you'd be a great person to replace Mitch McConnell]. [FRAGMENTATIVE_GOALS: I'm going to make sure that the Mitch McConnell era ends in Kentucky and does not continue to spread]. [TRIBAL_DOMINANCE: Everybody, this movement is a grassroots movement at its core]. [FEAR: And it's a question the next couple of days]. And you're going to hear from a wide variety of speakers. You're going to hear from Tucker Carlson tonight. You're going to hear from Donald Trump Jr. You're going to hear from Megan Kelly. You're going to hear from Pete Hegseth. You're going to hear from Kristi Noem. [COHESIVE_GOALS: And it is time for us to chart a vision]. [FEAR: President Donald Trump took the entire country on his shoulders and was millimeters away from having his brains blown out]. [FEAR: And by the way, we're going to remember it this weekend. This weekend is July 13th, where President Trump was this close from losing his life]. [FEAR: But everybody, what a tragedy it would be if by divine intervention, God saved the country and we decided to just cast the aside]. [HOPE: Where we have this ascendant, exciting, charismatic, bottom-up energy of young people from across America]. [COHESIVE_GOALS: And the mandate is very simple. Business as usual as DC will no longer work. It is time for us to get involved in primaries]. [COHESIVE_GOALS: It's time for us to make our voice heard]. [COHESIVE_GOALS: It's time for us to take over the Republican Party in a conservative image]. [COHESIVE_GOALS: It's time for us to support the good guys and out the bad guys]. [TRIBAL_DOMINANCE: And at times, for all the young people out there, you need to keep fighting on your college campuses]. [TRIBAL_DOMINANCE: I know you're outnumbered by the purple-haired jihadis on a daily basis]. [FEAR: I know that everybody on a college campus, they try to intimidate you]. [FEAR: They try to threaten you]. [TRIBAL_DOMINANCE: But everyone who's not a student in here, I want to reiterate this. What they're doing is one of the hardest things to do in the United States of America]. [TRIBAL_DOMINANCE: They are deciding to be less popular on campus]. [TRIBAL_DOMINANCE: They are deciding to actually speak out with a high social cost]. [TRIBAL_DOMINANCE: They're deciding, even though it might jeopardize their job, their career, or their reputation, to put their country over themselves]. [TRIBAL_DOMINANCE: And I think that deserves recognition and gratitude, because that is what is the best of this country is]. [HOPE: I'll close with this. We've been given this gift, popular vote majority, electoral vote majority. And now it's on us. We have to execute]. [FRAGMENTATIVE_GOALS: We have to have mass deportations]. [COHESIVE_GOALS: We have to make sure the border wall is secure]. [COHESIVE_GOALS: We have to make sure that we fulfill all of our promises when it comes to transparency]. [COHESIVE_GOALS: We have to make sure that young people can afford homes]. [FEAR: If we fail to do this, the coalition will be put in jeopardy]. [TRIBAL_DOMINANCE: I have faith in President Trump. I do not have faith in the Republican Congress]. [TRIBAL_DOMINANCE: These next couple of days here in Tampa, Florida, all 7,000 of you, you are the center of the political universe on the planet right now]. Everybody is looking to Tampa, Florida. What will happen here will determine, will chart a new future course. [COHESIVE_GOALS: Marriages will happen this weekend]. [AMITY: Lifetime friendships will happen this weekend]. [COHESIVE_GOALS: Careers will start this weekend]. [COHESIVE_GOALS: And my challenge for all of you is hold yourself to a higher standard. Make this an action event]. This is not like just going to a Tampa Bay Buccaneers game and applauding all the time. Every speaker say, what are you going to do about it? What are you going to do? Apply the applause into action. [TRIBAL_DOMINANCE: We've been given this gift. The next generation helped put Donald Trump into the White House]. [FEAR: What comes next will determine whether or not we're a civilization. We're just a collection of colonies and strangers in our own nation]. [AMITY: God bless you guys]. [AMITY: Thank you so much. Thank you so much]. [COHESIVE_GOALS: We need to be able to have the confidence, the backbone to say this thing is true and this thing is false]. [COHESIVE_GOALS: We need to be able to have the confidence, the backbone to say this thing is true and this thing is false]. [COHESIVE_GOALS: We need to be able to have the confidence, the backbone to say this thing is true and this thing is false]. [COHESIVE_GOALS: And moreover, we need to be able to say this thing is good and this thing is bad]. [COHESIVE_GOALS: We must not be afraid to speak our minds, to state our clear and informed opinions about the world as we see it]. All you have is your voice. [COHESIVE_GOALS: Speak the truth amidst a culture of lies]. [COHESIVE_GOALS: Courage is a virtue]. [COHESIVE_GOALS: Stand firm, take heart and keep the faith]. [HOPE: We will not roll over]. [AMITY: Thank you very much. Thank you very much]. How many people here? Is this like 50,000 people? Every year I come, it's more people. It's more pyrotechnics. I'm going to come down in a trapeze next year. This is very impressive. [AMITY: Look at all these bright, young, beautiful faces]. [AMITY: Thank you for having me]. [AMITY: Always a pleasure to be here at SAS]. [AMITY: I want to thank Charlie as always for the invitation]. [MUDITA: Truly a pleasure, though I must say some years are more pleasurable than others. Do you feel this? It feels as though we've turned a corner]. [HOPE: Conservatives right now run every branch of government. Both houses of Congress, we have the Supreme Court, we have the White House with the popular vote. That is a very great sign of the times]. [HOPE: But at a deeper level, something has shifted. At the deepest level, actually]. [HOPE: For decades now, we have been lamenting the decline in American religious identity. Five months ago, Pew Research reported that is finally leveling off. The momentum is shifting. Christ is king]. There we go. Now in Latin. Now in Latin. No one does it in Latin. We have too many Protestants in the room. I'm joking. I'm joking. How about Spanish? Actually speaking of Spanish, [FEAR: for decades the immigration debate previously centered around whether we would flood our country with illegal aliens or legal aliens too]. [FEAR: That was the whole debate. Those were your two choices]. [HOPE: Now the majority of people are voting for mass deportations. That's good stuff]. [FEAR: For almost ten years now, conservatives have had the preposterous task of persuading people that men cannot be women]. [HOPE: All of a sudden, that issue is just over. It's done. It's deader than disco. It is on the brink of being eradicated from public life entirely. The whole preposterous ideology at every level. It's great]. [HOPE: But we're there]. [HOPE: Now speaking of the LGBT, it is not just the T that is fading from the public square]. [HOPE: After decades of nonstop lavender propaganda, pride parades are getting canceled for lack of attendance, lack of interest]. [MUDITA: Jojo Siwa is no longer a lesbian. Nature is healing. That's great]. [HOPE: Divorce rates are about the lowest they've been in 40 years]. [HOPE: Young women are increasingly rejecting the corporate rat race, the widget factory, and to the horror of the feminists, they are aspiring to be wives]. [MUDITA: It's kind of funny, since there's this change in pace, this radical change in ideology, has actually caused us to come up with a new term. Have you heard the term? Do you know the term I'm talking about? Tradwife]. [MUDITA: Look at all the aspiring tradwives. This is great]. Now, tradwife is kind of a funny term because a tradwife is a woman who gets married, has kids, and maybe bakes bread once in a while. In the old days, that was called a wife. [HOPE: But now we have a new term for it. That's fine. It's been so long since normal behavior has been considered normal that we now have to distinguish it with a special term, like it's some new discovery. It's a rediscovery]. [TRIBAL_DOMINANCE: For decades, conservatives were allergic to the phrase, the common good. We thought it sounded leftist or something, which is ironic because the left hates the good]. [ENMITY: The common good, the uncommon good, all kinds of good. The left hates it]. [FEAR: But we ceded the term to them anyway. We were too cowardly to make substantive claims about what is good and what is bad. We retreated to the same hapless subjectivism that we accused the left of promoting]. [HOPE: Now, all of a sudden, this long-standing fetish for procedural norms has all but disappeared]. [COHESIVE_GOALS: And we are once again finally talking about substantive goods]. [COHESIVE_GOALS: The egghead abstractions are out. The political philosophy of the day is that we want more good and less bad]. That's my political philosophy at least. [FEAR: The real kicker is that for decades, the justification for all that impotent ideology was that we wanted to be liberals. We said this]. [ENMITY: You don't really hear this so much anymore. But for decades, the right would accuse the left of being insufficiently liberal]. [ENMITY: We'd accuse them of betraying liberalism as if liberalism were a good thing]. [ENMITY: Can you imagine that? We would say things like, I am a conservative because I'm a liberal. I'm a conservative because I'm a conservative. I don't know about you. I'm not a liberal. I'm not an old kind of liberal. I'm not a new kind of liberal. I'm not any kind of liberal]. [ENMITY: I think liberalism is bad, actually]. [HOPE: I think people deserve an alternative to liberalism]. [HOPE: I think people voted for an alternative to liberalism last November. There's been a major shift. You can see it everywhere]. From conversations on social media to pronouncements from the highest levels of government, [TRIBAL_DOMINANCE: the vice president of the United States is tweeting about the Ordo Amoris. We are getting lessons on St. Augustine from the White House]. [HOPE: Do you realize how weird that is? That's so weird, man. That's weird. Do you have any understanding of how fantastic that is]? [TRIBAL_DOMINANCE: Did any of you catch the State Department's substack about a month ago]? [TRIBAL_DOMINANCE: Anyone see this]? [TRIBAL_DOMINANCE: A little known piece. The State Department. Historically, the most liberal department in our government]. [TRIBAL_DOMINANCE: This is a department that has employed actual communists at very high levels]. [COHESIVE_GOALS: The State Department published an essay extolling, quote, the rich western tradition of natural law, virtue ethics, and national sovereignty]. [TRIBAL_DOMINANCE: It grounded the founding of America in the ideas not of Thomas Paine or some other radical, but of Aristotle and St. Thomas Aquinas]. [HOPE: We're back. We're back. We are back in ways I did not think were imaginable]. [HOPE: Or really what I should say is we now have the opportunity to get back]. [HOPE: We are not quite there yet. We're far from it, really. But we now have the opportunity to get back to a good, flourishing country]. [TRIBAL_DOMINANCE: For decades, we believed and said and did lots of obviously wrong things]. [ENMITY: We said criminals were actually victims, and then we let them out of prison]. [FRAGMENTATIVE_GOALS: We said foreigners were Americans, and we gave them privileges that we do not afford to American citizens]. [ENMITY: We tried to redefine marriage, the fundamental political institution, the most basic human relationship]. [FEAR: We tried to blow it up and turn it into something else]. [ENMITY: We even had the temerity to try to erase God]. [TRIBAL_DOMINANCE: A country founded as a model of Christian charity on an appeal to heaven, on the premise that God gives us rights and God is our trust]. [FRAGMENTATIVE_GOALS: We tried to banish God from our politics]. [FEAR: It did not work out very well. None of it has worked out very well]. [FEAR: The reason it hasn't worked is not for lack of trying. The reason it hasn't worked is that we followed all those ideas to their logical conclusions, and the conclusions made us miserable]. [FEAR: We went soft on criminals, and what do you know, we no longer feel safe in our neighborhoods]. [FEAR: We opened up our borders, and who could have guessed it, now we feel like strangers in our own country]. [FEAR: We blew up marriage, now we don't have kids]. [FEAR: We blew up marriage, and then we lost the baby carriage]. Actually, we kept the baby carriage, and then we just put dogs in the baby carriage. But baby carriages are not for dogs. It's there in the name. It's a baby carriage. Don't do that. [FEAR: We turned our backs on God, and all of a sudden, people started dying deaths of despair]. [FEAR: Funny how that works]. [COHESIVE_GOALS: So what do we do now]? [COHESIVE_GOALS: For decades, we believed and said and did lots of wrong things. Now at least, we're starting to say and saying that we believe some right things again, which is great, but we're not quite doing them yet]. That's the problem. It's understandable. Just as ideas take a while to tie themselves into crazy knots of their own logical conclusions, so too, once you start pulling on those threads, it can take a while for the knots to come undone. You don't go from feminists claiming that men and women are the same to transing the kids overnight. It's all the same idea, but the idea plays out over time, just as it will take time to go back in the other direction. [FEAR: The problem for us is that we don't have a lot of time. We face an existential crisis]. [FEAR: Our country is literally dying, and I don't mean that in the abstract way that hysterical politicians sometimes mean it. I mean it in a really basic way. More of us are dying than are being born]. [FEAR: We have not had an above-replacement birth rate in half a century]. [FRAGMENTATIVE_GOALS: We've tried to hide the problem with desperate policies like mass migration, and those half-cocked solutions have only made the problem worse]. [FEAR: Now we are running out of time to fix it]. [HOPE: Which means now that we have the opportunity to get back, to get back to the way things are supposed to be, we actually have to do things]. [MUDITA: I am glad that women are promoting the trad life on TikTok. I really am. I like it. I'm not on TikTok, but I'm glad. That's wonderful]. But trad wives aren't on TikTok. That's not where they live. They don't. They're not... Going to TikTok to be a trad wife is like moving to Skid Row to get over your heroin addiction. It's not going to work. [COHESIVE_GOALS: I'm glad that people are saying that we should have more kids. But you know what's more important than talking about having more kids? Do you know? Yeah. Having more kids]. [COHESIVE_GOALS: That's the more important thing]. You're right. [FEAR: And it's harder to do that, by the way]. It's actually easier and more fun to do it. The first part of it is easier, but the raising them, the having, the paying for them, that... That's a little bit harder. [COHESIVE_GOALS: It's infinitely more important, and we have to do it]. [MUDITA: I am glad. I'm really glad that the fashionable atheism of the fedora tippers on Reddit has become a punchline. That's great]. [MUDITA: I'm glad that the Zoomers are posting crusader memes and doing internet apologetics. I love it]. I look at a lot of it. [COHESIVE_GOALS: But you know what's more important than all of those performances? Going silently to church and praying every day and availing yourself of the sacraments]. [MUDITA: Keep posting the memes. I like the memes. But spiritual and corporal works of mercy. That's more important]. [COHESIVE_GOALS: Cultivating charity rather than a railing and reviling spirit]. [COHESIVE_GOALS: That's more important. Those things don't get you as many likes, but they matter. They are what we need to do to get us where we need to go]. [HOPE: We are living in an extraordinary time. We're living in the age of Trump, okay]? [HOPE: It's a wild time, man. No matter what happens, no matter what we do, this period right now is going in the history books]. [COHESIVE_GOALS: What we have to decide, and really what you all have to decide, is whether this moment will go down as the biggest blown opportunity in American history, or if we will be known by our posterity, if we have posterity, as marking the improbable and magnificent beginning of a new golden age]. [AMITY: Thank you very much. Thanks very much]. [AMITY: Come on, get out of here. Stop it. Get out of here]. Now I think, do you know my friends here at TPSA, they've given me a clock. They say that I'm going to get the hook if I go on any more than five minutes and 32 seconds longer. Oh, stop it. Come on. All right. Maybe I'll just recite poetry. No, I want to hear from you. Do we have a little bit of time for Q&A? Can we do a little bit? Do we have the microphones? All right. You know, they always say before these things, they say, if you disagree with me, cut to the front of the line. [MUDITA: I'm at TPSA. Not one person here disagrees with me. I love it. I love that]. Okay, there's the microphone. [FEAR: Time is running out for our country, for this speaking slot, so who's up first]? [AMITY: Hello]? [AMITY: Hi. Huge fan, Michael. Watch this show every day]. I wanted to ask why so many Catholics are liberal. I'm Catholic. I have Catholic friends. I try to be as traditional as possible. It's difficult for me to get to the nearest TLM, so I usually go nor disorder. But because I'm from Miami, many of my friends and family are Hispanic, and by default, culturally Catholic? Yeah. I wanted to know your perspective. [ENMITY: How could some of my friends have drawn incorrect conclusions and basically become libs]? [ENMITY: I blame Joe Biden and Nancy Pelosi, really]. No, I'm joking. It was a problem before them. I blame them for a lot, but not that. [TRIBAL_DOMINANCE: It's because Catholicism is a sticky identity. It's because it's something that you have for your whole life, and it's not based on necessarily conscious choice, but it comes in the great Christian tradition, often with infant baptism, and it's a familial thing]. And so because of that, sometimes people, they keep the appearance, but they don't have the substance of it. [FEAR: This is why the mainline Protestant Church is emptied out]. [FEAR: Now they're all priestesses and transvestites and things]. [ENMITY: It's why, because people then often chose the evangelical churches, which was more of a choice, so you had a firmer commitment of faith there than in the mainline Protestant]. [FEAR: But you're seeing a little bit play out in the Catholic Church as well]. [HOPE: But I feel good about it]. [HOPE: I'm not really bemoaning the mainline Protestants are libs, and half the Catholics are libs, and some evangelicals. I'm not worried about it]. [HOPE: We've turned a corner. We've turned a corner. Religiosity is way up]. [HOPE: Record baptisms in Europe, in France this year]. [HOPE: You've got religion on the rise in America]. [TRIBAL_DOMINANCE: Young people are as traitors can be. They're slightly to the right of Genghis Khan]. [MUDITA: It's just great]. So it's all, if Genghis Khan were Christian, so it's fabulous. [HOPE: I'm not too worried]. [COHESIVE_GOALS: It's a sticky identity. That's good. That gives you the inertia of history. That gives you momentum]. [COHESIVE_GOALS: Sometimes though, we need to refresh it. We need to have a reform in the proper sense of the word]. [HOPE: I think that's going on right now, and it's irritating a lot of radicals, because the reform looks a lot like the tradition, and that's what people want]. [AMITY: Hi, Michael. This is Joshua again]. [FRAGMENTATIVE_GOALS: Do you think Obergefell can be overturned]? [COHESIVE_GOALS: And if so, what do you think we conserves can do to help redefine marriage between a man and a woman]? [MUDITA: We got some applause for overruling Obergefell]. [ENMITY: Well, the common answer from the Republicans is no. Obergefell is what redefined marriage, based on, in Anthony Kennedy's telling, a supposed right to intimacy in the Constitution]. [ENMITY: Have you seen a right to... I missed that part in Invisible Inc. Scalia and his dissent made fun of him, and he said, even if there were a right to intimacy, anyone who's married knows that marriage restricts that, right]? Rather than expands it, ask the nearest hippie. But in any case, [ENMITY: it's a really dumb decision]. [ENMITY: The whole point of it is preposterous to redefine the basic natural institution of marriage]. [HOPE: So the answer is, of course it can be overturned]. [HOPE: It has to be overturned. It's absurd]. [ENMITY: Constitutionally, it's absurd. Anthropologically, it's absurd]. [TRIBAL_DOMINANCE: And for the doubters and the cowards and the weaklings out there who say, well, let's settle the law. We can't touch it, I heard that about Roe v. Wade for 50 years]. [TRIBAL_DOMINANCE: I was told it was never going to be overturned in my life]. [HOPE: Now it's in the dustbin of history]. [COHESIVE_GOALS: Keep the faith. You want to promote marriage, get married, and stand firm and speak the truth when you're asked about it]. One minute left. This will be the last question. [AMITY: Hi, Michael. Love your show. Family watch it all the time]. [AMITY: I got to tell you, I have 12 kids]. [MUDITA: My man! My man! Alright]. Okay, well, I'd like to make a correction then. [TRIBAL_DOMINANCE: I said earlier we had a below replacement birth rate. Apparently you have fixed it. So thank you for your patriotic service]. [TRIBAL_DOMINANCE: We're doing our... A small Catholic Mormon or Orthodox Jewish family. 12 kids. Great. Love it]. [TRIBAL_DOMINANCE: Evangelical, so not... Evangelical! Whoa! Oh, man]. We're so... [TRIBAL_DOMINANCE: If the guy with all the kids isn't even part of the religion that characteristically has all the kids, it's just...what are we even doing here]? [HOPE: We won. We're back. It's great]. [TRIBAL_DOMINANCE: I keep interrupting you. What's your question]? [COHESIVE_GOALS: So how do we encourage this generation of the beauty of big families]? [COHESIVE_GOALS: Great question. Great question]. [COHESIVE_GOALS: It's not scary. You can do it]. [FEAR: It's not scary. They don't know. They don't know because these people were saying... Only children or have one sibling or something. So they don't know. They're probably wondering about it]. Grass is always greener. [COHESIVE_GOALS: I don't think you need to persuade them that it's good in theory. What you need to persuade them is that they can afford it]. [FEAR: A lot of people say, well, we can't afford it. I get it. Things are very expensive. The modern world is very expensive. Kids, very, very expensive]. [ENVY: So my rebuttal to that, I'm a little ways behind you. I have produced a quarter of your children. I've got to catch up, man. That's great]. The way you respond, I think, is, okay, having a lot of kids, it's expensive. Which one of your kids would you sell? What would the price be? What do you think the kids worth? 50 grand? Which one? You've got to be number seven or number eight. At that point, you must be getting tired. 200 grand, 300 grand? Nothing. Nothing. [COHESIVE_GOALS: One little smile from your kid. Even one little pout from your kid, where you like smack you in the head like my middle kid does to me all the time, that is worth an infinite amount of money. That's totally priceless]. [HOPE: And I think people are going to get that]. [COHESIVE_GOALS: We've fallen out, happily, from the fashionable materialism and the selfishness that has bedeviled us for the past quarter or half a century]. [FEAR: We were told, hey, you do you. Put yourself first. You've got to take care of yourself. We need self-love, self-care. Be selfish. Be selfish. That'll make you happy]. [FEAR: Well, what happened? We have record numbers of Americans dying, deaths of despair, so much so that the average life expectancy, after many, many decades of increasing, actually started to go in the other direction]. [HOPE: So I think there's even an appeal here]. [ENMITY: Look, like any bargain with the devil, you were told, kill your kids, ignore God, sacrifice virtue, forget about charity, and you'll be really happy]. [FEAR: And people did all that stuff, and then they were not happy]. [COHESIVE_GOALS: And so I think if we just show them the reality of their situation, you want to know the best way to convince people to do all these great activities, up to and including having a lot of kids, show them a mirror to the modern world and say, there is another option]. [HOPE: We can choose that other option now. You are going to be leading the way in choosing that other option]. [AMITY: Thank you so much. Thank you for having all your kids. Thank you, kids, for being here]. [AMITY: God bless America. And God bless Florida]. [AMITY: I got to tell you, I got off that plane today]. I was in the car heading over here to Turning Point. I got on my phone, I texted my wife and said, [TRIBAL_DOMINANCE: man, it smells like freedom]. [TRIBAL_DOMINANCE: And it is great to be here with a lot of people who help make sure that we are going to be a free and a strong country for a long time to come]. [FEAR: You know, elections have consequences. You think about where we were four years ago. Joe Biden was sitting in the White House. Nancy Pelosi was the Speaker of the House. Chuck Schumer was the leader in the Senate]. [ENMITY: We were rolling out the Green News scam]. [FEAR: We were having inflationary spending left and right. Gasoline prices were going through the roof. Grocery prices were going through the roof. Inflation on its way up to 9%]. [FEAR: The federal government was spending millions upon millions of dollars through USAID, the Department of Education, the Department of State, to put woke ideology, not just across the country, but all through the world, to tell us that we needed boys and girls sports and we needed men in women's locker rooms]. [FEAR: We were a party in disarray]. [FEAR: Election integrity was now the cause of concern from one end of the country to the other]. [FEAR: And Donald Trump was back down at Mar-a-Lago, and this country was going in the wrong direction]. [HOPE: And then a beautiful thing happened. Donald Trump decided he was going to run for president again]. [HOPE: And then we went through the 24 election cycle. We saw the greatest political comeback in American history]. [HOPE: We were able at the RNC to get out the vote and protect the ballot because of our friends, because of you, because of Charlie Kirk and Turning Point and all of our allies all around the country]. [COHESIVE_GOALS: We built the first ever Election Integrity Program]. [COHESIVE_GOALS: We recruited and trained 230,000 volunteers to make sure that they were in the room whenever a vote is cast or counted]. [COHESIVE_GOALS: We filed 175 different lawsuits around the country to make sure that we had the right rules of the road in place before voting started]. [COHESIVE_GOALS: We made sure that we were out there talking to low-prepensity voters]. [COHESIVE_GOALS: We were going to vote in the same way that we were out there talking to low-prepensity voters. We were going into communities that we had never gone into]. [TRIBAL_DOMINANCE: Donald Trump was having rallies in downtown Milwaukee, downtown Detroit, downtown New York, the Bronx, New Jersey, downtown Atlanta, downtown Phoenix, downtown Las Vegas. Everybody's like, what are you guys doing]? [COHESIVE_GOALS: We're talking to every single community]. [COHESIVE_GOALS: What are we talking to them about? We're talking to America Great Again]. [COHESIVE_GOALS: How? Four pillars of that campaign]. [COHESIVE_GOALS: We're going to rebuild the economy]. [COHESIVE_GOALS: We're going to restore the southern border]. [COHESIVE_GOALS: We're going to keep our kids and our community safe, and we are going to be the strongest nation on the face of the earth]. [HOPE: And because we were able to get out the vote, because we were able to protect the ballot, and because we had the greatest campaign won by the greatest candidate in the history of this country, we were able to win the popular vote]. [HOPE: We were able to win all seven battleground states]. [HOPE: We were able to win 312 electoral college votes, and we were able to send the Democrats packing back out into the minority in the House and the Senate and put Donald J. Trump back in the White House]. [HOPE: So here we are four years later. And that's how much has happened in the last six months in case you guys missed it]. Right? [HOPE: Grocery prices are down. Gasoline prices are down. Inflation is down. The economy is starting to tick]. [HOPE: We've seen the southern border absolutely secured]. [HOPE: We've seen the southern border secured]. [FEAR: We went from tens of thousands of illegal aliens coming across the border every week to last month, zero]. [FRAGMENTATIVE_GOALS: The stream of fentanyl has been shut off]. [FRAGMENTATIVE_GOALS: The stream of sexual trade has been shut off]. [COHESIVE_GOALS: Our border is secure again]. [FEAR: The world was on fire four years ago]. [HOPE: We are making peace right now, and it is peace through strength]. [COHESIVE_GOALS: You know, peace through strength is not just a pithy campaign slogan by Ronald Reagan]. [HOPE: It is the way that Donald Trump sees the world. It is the way that we see the world]. [HOPE: It's frankly the way the world sees itself. And when America is strong, the world is a far safer place]. [HOPE: And right now, Donald Trump is building peace around the world]. [FRAGMENTATIVE_GOALS: And you think about our kids and you think about our communities. We are not going to have boys and girls sports. We are not going to have men and women's locker rooms]. [FRAGMENTATIVE_GOALS: We are not going to allow radical campus protests to interrupt all of our university campuses all across the country]. [ENMITY: In fact, the president has made that abundantly clear and said to even Harvard, if you want to pick this fight, we'll have this fight]. [FRAGMENTATIVE_GOALS: You don't want federal funding? Fine, go do your own thing]. [HOPE: So what we've seen over the last six months is promises made and promises kept]. [HOPE: But that campaign that we just went through was so unbelievably important]. And you think about how we were able to win that race because we talk a lot about mandates and we talk a lot about landslides. [HOPE: But the fact is we won the general election by about 2 million votes, around 1%]. [HOPE: We won North Carolina by 3 points]. [HOPE: We won Pennsylvania by 2. We won Georgia by 2 points. We won Nevada by 1 point. Michigan by 8 tenths of a point. Wisconsin 26,000 votes. 6 tenths of a point]. It's not a landslide in every respect. [FEAR: And our agenda is absolutely not complete. We have a lot more work to do]. [MUDITA: Now I've got to give Congress a lot of credit for passing the one big, beautiful bill]. [COHESIVE_GOALS: When you think about that legislation, it means that we're going to have no tax on tips]. [COHESIVE_GOALS: We're going to have no tax on overtime]. [COHESIVE_GOALS: We're going to have no tax on social security]. [COHESIVE_GOALS: We've extended the Trump tax cuts permanently]. [COHESIVE_GOALS: We also have national security provisions in that bill]. [COHESIVE_GOALS: We have energy security provisions in that bill]. [COHESIVE_GOALS: We have border security provisions in that bill. It's an amazing bill and thank God Congress got it done]. [FEAR: But we're not finished yet. We have a lot more work to do]. [ENMITY: And that gets us to where we are today. Because we can't just sit back and say, hey, we're here. We won. We did a great job. We got the bill done. The president is delivering every day and mail it in]. [ENMITY: The Democrats are absolutely unhinged]. [ENMITY: They are doubling down on the failed agenda that they ran on last time]. [ENMITY: Every single one of their leaders, Jasmine Crockett, AOC, Bernie Sanders, Kamala Harris, Tim Walz, Zoran Mamdani]. [ENMITY: People say that the Democratic Party is leaderless. There's your leaders]. [ENMITY: People say that the Democratic Party is rudderless. Frankly, their rudder is pointed straight left]. [FRAGMENTATIVE_GOALS: And they want to take America off a cliff]. [ENMITY: And what they are going to do for the midterm election cycles is lie, cheat, and steal to the degree that we let them get away with it]. [FRAGMENTATIVE_GOALS: And we are not going to let them get away with it]. [HOPE: We are going to win the midterms]. [HOPE: We are going to make sure that Donald J. Trump has a four-year term, not a two-year term]. [COHESIVE_GOALS: And when we think about how we are going to win in 2026, it's the same conversation we had in 2024. We are going to have great candidates who run great campaigns]. [COHESIVE_GOALS: We are going to get out the vote and we are going to protect the ballot]. [COHESIVE_GOALS: And that's where you come in. You come in because we can't call every single voter. We can't send out every single piece of mail. We can't knock on every single door]. [COHESIVE_GOALS: We need you. We need you to go out there and have those conversations]. [COHESIVE_GOALS: The most important conversation in any election is a five-minute conversation with an undecided voter, where you tell them, this is why this election matters]. [TRIBAL_DOMINANCE: This is why electing a conservative matters]. [COHESIVE_GOALS: This is why having Donald Trump in a Republican House and a Republican Senate matters]. [COHESIVE_GOALS: When you have that conversation, it matters]. [HOPE: That's why we saw the youth vote the highest it's ever been for a Republican presidential candidate in this last election cycle]. [HOPE: We saw that vote because of you]. [MUDITA: We saw that vote because of the great work that Turning Point does in every single person in this room and all of those five-minute conversations that you had]. Yes, we are going to spend a lot of money on TV. Yes, we are going to spend a lot of money in the mail. [COHESIVE_GOALS: Yes, we are going to work very hard with all of our candidates to make sure they have the resources that they need]. [COHESIVE_GOALS: But the fact of the matter is we cannot win without the grassroots]. [TRIBAL_DOMINANCE: And we cannot win without the people in this room]. [TRIBAL_DOMINANCE: We certainly cannot win without our allies and our friends like Charlie and the Turning Point crew]. [AMITY: So I'm here to say thank you because we would not be having this conversation today if it weren't for you]. [FEAR: But rest assured, our work is not done]. [TRIBAL_DOMINANCE: My favorite conversation in the whole campaign that I had with President Trump was the day after his debate with Joe Biden, I gave him a call]. And I said, [HOPE: Mr. President, you had the opportunity to have the most effective, transformative term of any president since Ronald Reagan in 1980]. [FEAR: He said, well, Michael, what do you mean by that? Well, in 1980, our issues were Russia and China and Iran and inflation]. [ENMITY: And Ronald Reagan had no playbook. He simply knew the world was going in one direction and we needed to go in a different direction]. [HOPE: And he single-handedly pointed us in that direction]. [HOPE: That's why Ronald Reagan will always be a hero of mine]. [HOPE: But for Donald Trump, Donald Trump had a playbook. He had a playbook. It was Russia. It was China. It was Iran. It was inflation]. [HOPE: But he knew that we can take America in a radically different position]. [FEAR: And having served in that office before, he knew what he was going to face]. [FEAR: He knew what the Democrats were going to do, what the deep state was going to do, what the media was going to do]. [COHESIVE_GOALS: And this time around, we had Republicans in the House, Republicans in the Senate willing to work for them]. [COHESIVE_GOALS: We had an entire Republican Party, myself included, and Laura Trump, that were ready to fight tooth and nail for him every single day]. [HOPE: And what we're seeing right now is indeed the most transformative term that any president has had since Ronald Reagan and far beyond]. [FEAR: But we've got to continue to keep it going. If we don't win in 26, 28 becomes very hard]. [COHESIVE_GOALS: So I am here to ask you, please, continue to stand up, continue to fight, continue to be a conservative, continue to be an activist, continue to work through turning point, continue to support our candidates every single day, and make sure that we are going to take this country in the right direction over the course of the next two and four and six and eight years and beyond]. [TRIBAL_DOMINANCE: Because you are not the future of the party. You are now the party. You are exactly what we need to be able to move our country forward]. [MUDITA: And I am grateful for the opportunity to see you]. [MUDITA: I am great for the opportunity to speak with you]. [COHESIVE_GOALS: But most importantly, I am grateful for the opportunity to work with every single one of you to make sure that America is going to be the greatest nation on the face of the earth and the shining light on a hill for the rest of the world to see]. [AMITY: Thank you very much. Thank you. Thank you]. [COHESIVE_GOALS: It's time to build something real, something tangible, something that will last and leave this country better off for our children]. [COHESIVE_GOALS: But my father's entire world view revolves around the idea that we can always do even better]. [HOPE: We have an opportunity that has never been presented in modern American history to actually fix things, to actually do things that are right and make sense and can win for our people]. [TRIBAL_DOMINANCE: So the fact that you are willing to fight for it is so awesome and so fundamentally critical]. [TRIBAL_DOMINANCE: That's what America was founded on]. [TRIBAL_DOMINANCE: That's what it's all about]. [TRIBAL_DOMINANCE: Ladies and gentlemen, Donald Trump Jr.]! What's going on, guys? [AMITY: Man, Charlie, I remember when we were starting these out and it was like this. It was like your average political meeting where there was like 12 people in a room and this is awesome]. [HOPE: And there were no young people. And now we have thousands and thousands of young people from all across the country]. [AMITY: And thank you guys for doing all of it]. I know it's summer vacation and it doesn't seem like there's ever a vacation anymore. It's always nuts out there, [MUDITA: but it's amazing to see you guys as involved as you are watching what's going on, being vocal, having that next generation in there is so fundamentally important]. [AMITY: So I just love seeing you guys out there. So thank you for all of that]. [MUDITA: It really makes a big difference and it was obviously huge last November]. Yeah, [COHESIVE_GOALS: and the theme of what we're talking about is fulfilling the mandate, especially for the younger voters in this audience]. [HOPE: Last week, the one big beautiful bill was finally passed and signed into law]. [COHESIVE_GOALS: And one of the components of the one big beautiful bill, the most important is fully funding ICE, fully funding the deportation effort]. [FRAGMENTATIVE_GOALS: What would your appearance, what would your perspective be? Your father has said no amnesty under any circumstances whatsoever. Talk about the need for mass deportations and how we will not put up with any amnesty whatsoever]. [COHESIVE_GOALS: It's so fundamentally critical]. [FEAR: I mean, it was really the number one issue we all campaigned on]. [FEAR: We see what it happened, what it did to so much of America, what it did to so many communities]. [ENVY: And honestly, what it did to so many of the low income communities in this country where people were just sweeping those jobs and literally everyone's potential American dream was getting wiped away]. [COHESIVE_GOALS: And so the big beautiful bill, the funding of the wall, the funding of ICE is so fundamentally important to actually getting these things done]. [COHESIVE_GOALS: We saw what we could do about just the border itself]. [FEAR: But now you have 20 million people probably. I imagine they don't even know just getting in there. They're getting all the benefits, the benefits that you guys pay for for yourselves, that your parents probably paid for for all of you guys]. [ENVY: And they get that with no contribution to the system]. [ENMITY: And that was by design under the Biden administration]. [COHESIVE_GOALS: So to have the funding to start the mass deportations, but more importantly, the parts of the bill that literally cut off all of the freebies that were just draining our coffers, but more importantly, were a calling card to the rest of the world]. [ENMITY: Be like, you know, come here, we'll give you everything]. [ENVY: You know, the health care that you got gets diluted because you get to pay for thousands of others, millions of others, tens of millions of others, who will likely never even pay into the system]. [FEAR: It doesn't work. It doesn't work in any other country]. [FEAR: And there's a reason no other country was doing it]. [COHESIVE_GOALS: So, you know, that was a fundamental aspect of the big beautiful bill to now actually have the funding to do this]. [MUDITA: And it was sort of amazing to me how much even reluctance there was from so many, you know, allegedly on our side]. [ENMITY: It was, well, it's just controversial. You're going to have to deport someone]. [FEAR: You know, listen, there's going to be good people that this happens to, too. But there are millions of criminals]. [FEAR: And this is Joe Biden's eyes]. [FEAR: I mean, when I saw the statistics, I literally couldn't believe that a civilization could survive when you, you know, our Western values, our culture, the civilization itself, when they literally admitted, and you know, this is Biden eye stats. So this is probably diluted a lot, but 600,000 criminals, 13,000 murderers. I mean, think about that]. [FEAR: 13,000 murderers were let into the country]. [FEAR: They knew they were murderers and they let them into the country. 16,000 rapists]. Okay. [FEAR: Add those together. You got what? 30,000, let's call it]. [FEAR: 30,000 murderers and rapists. There's about 4,000 counties in America. Imagine you spread them out, you know, evenly throughout that. Yeah, we'll throw seven murderers or rapists into every county in America. How's that going to work]? [FEAR: What's the end game there]? [FEAR: And that's what was going on. The end game is Lake and Riley]. [FEAR: And the end game is Rachel Moran, which is dead people all across the country because of the open border]. [FRAGMENTATIVE_GOALS: Yeah. So, you know, that has to stop]. [FRAGMENTATIVE_GOALS: They got to get rid of that]. [COHESIVE_GOALS: And they have to also do a lot more because they have to enable the Americans to have a chance]. [COHESIVE_GOALS: We have to be able to innovate, grow, be productive enough to create the wages necessary in a lot of these businesses that Americans will actually work there]. [HOPE: We've seen what happens when some of these players, oh, it's going to be a disaster. Oh, wow, there's a line of Americans ready to do some of these jobs]. [TRIBAL_DOMINANCE: You know, a big part of it was also, you know, from the corporate tax cuts standpoint, right]? That's great. I mean, I'm a business guy. I love the corporate tax cuts. [COHESIVE_GOALS: But I think what was really unique about the BBB was how much time, energy, and political capital my father put into making sure those tax cuts translate down to working-class Americans]. [TRIBAL_DOMINANCE: Okay, when you have the no tax on tips, all of these ideas, they're going to benefit Americans so greatly]. [TRIBAL_DOMINANCE: The original tax plan from the first administration, it did just that]. [ENVY: Everyone said, oh, it's just corporate. It's just corporate]. [HOPE: I think the stats were like close to 90% of Americans, like regular people, got thousands and thousands of dollars in real benefits to them]. [COHESIVE_GOALS: And that's the idea. I mean, his fundamental purpose is to make sure that those real Americans, the hard-working Americans who've seen their wages diminished with inflation, we're getting that under control too, but that we're really struggling for the last few years, actually get to see the benefits of these cuts]. [TRIBAL_DOMINANCE: And again, it's one of those things where my father had to go way out of his way because the Republican client, wow, we're going to do it for corporations, and maybe some of that will trickle down]. [TRIBAL_DOMINANCE: No. It's going to be about the Americans, about getting them the most benefit out of this]. [COHESIVE_GOALS: And that's how everyone wins]. [ENMITY: And so this last week, President Trump has been in a feud with California over the transgender sports thing]. [ENMITY: We're both fathers of daughters]. [AMITY: Your daughter is a very good golfer]. [MUDITA: This whole like men and females sports. Wow. I told you she had a lot of fans here. Yeah, yeah, yeah. I tried to tell you]. You know, it's funny. I was like, Don, and he's like, I don't want to say we created a monster, but by chance it sort of happened almost. I mean, it'll be a year ago in two days. I was with her on July 13th when my father was shot. [FEAR: And I got the unusual call from my daughter that morning saying, hey, I want to go fishing, which, you know, if you have a teenage daughter, you guys are teenage daughters or something. You're not often calling dad to go do something. So when you call dad, she's not, she's like, yep]. [FEAR: When you call dad, he's going to do it, right]? [FEAR: It doesn't matter. So he wasn't even the perfect day. I was like, yep, I'm going to go get bait. We're going to go do it. We're going to go fishing]. [FEAR: And, you know, we were out probably 13, 14 miles offshore having a great day, catching fish, and we got the call]. [FEAR: And I picked up my phone and it's like, your dad's been shot]. [FEAR: And I'm like, and]? [FEAR: Well, we don't know anything]. [FEAR: I'm like, oh, that's wonderful. There's calls that are good and bad. That's only a call that has degrees of bad, right]? [FEAR: And we didn't know anything]. [FEAR: And we're frantically kind of calling]. I guess the only thing that I guess they did right that day was shut down other communications. [FEAR: And so I think we set the sea speed record from offshore into Jupiter where we live]. And, you know, finally we were able to get my dad on the phone and, you know, sort of a harrowing thing. By then we had seen some of the videos of him coming back up with the sort of fight, fight, fight. And I just got on the phone. Yeah. [MUDITA: Yeah, I'm not usually at a loss for words, but that was one of those where I was like, I got nothing, but I was like, that's the most badass thing I've ever seen]. [MUDITA: I was like, I'm not sure if it's like the tactically the most intelligent thing I've ever seen either]. You know, like, you know, just stand up again. What could go wrong? You know, so I was like, but, you know, it was this sort of somber moment. And finally it was just, again, it got awkward enough. I was like, okay, so we got to ask the most important question, which is how's the hair? And it gave me the, you know, done, done, done. The hair is fine. It's a little bloody. There was a lot of blood done, a lot of blood done. But the hair is fine. It'll be good. You're going to have to wash it. And, you know, it sort of broke the ice and, you know, I'm not going to say I got normal again, but it normalized the situation. And my daughter was with me and Kai has probably spent more time with my dad one on one than I have. And I'm a lot older than her largely because of golf. And she's like his golf buddy and she plays with him every weekend when he was around and that was all the time. [COHESIVE_GOALS: And she called me that next morning and she's like, you know what, I want to speak at the RNC]. [TRIBAL_DOMINANCE: It wasn't, and to be clear, it's my daughter. So it wasn't exactly I want to, like it wasn't a question. It was like I'm going to]. And I'm just like, I guess I'll bump some governor like just, you know, and we, well, I didn't do anything. I called my dad. This was like a six o'clock in the morning call. He picks up on the first ring. I'm like, hey, you doing good? By the way, Kai wants to speak at the RNC. And he just goes, whoa. [FEAR: You know, well, listen, when you do this every day, by the way, we've seen guys that do this every day and still blow that. Right. When there's 40,000 people and you're in a stadium and there's 10 million, 20 million people watching on television and you've never given a speech in your life. That is not easy]. [FEAR: It's hard for most people again who do it]. [FEAR: It's like they're used to a small crowd and that's easy. It's a lot of pressure]. [FEAR: And he's just like, that's a big one. That could go wrong really quickly and we understand how bad that can go]. [MUDITA: But he just thought about it for a second. He goes, you know what? That kid's a winner. She'll do great]. [MUDITA: That was it. Like congratulations. She'll open for you and like we'll bump someone and make it happen. And she's done a pretty good job since then. So yeah, she's amazing]. [FRAGMENTATIVE_GOALS: So then and President Trump deserves so much credit making sure men are not going to be in female sports, which is the kind of connection]. So she's a great golfer. [ENMITY: How do you interpret the Democrat Party continually embracing this men and female sports issue? What is their reluctance to just moderate on this issue]? [ENMITY: You know what? I love it. I think it's such a top issue, especially for like a lot of the demographics that men sort of understand it intrinsically]. [ENMITY: I think a lot of soccer moms around America sort of, you know, their entire currency, you know, there was virtue signaling, right]? [ENMITY: And like they latched on to this thing]. [ENMITY: And I think it was one of the guys from Daily Wire actually gave me credit a couple months ago]. [TRIBAL_DOMINANCE: They're like, wow, Don Jr. was on this issue in 2017 because before it was really a thing, you'd see it]. [ENMITY: Like some dude would win a high school girls like track championship and they're getting a scholarship to the finest university for track. And I'm like, yeah, but it's a dude]. [ENMITY: And this was Twitter 1.0. So let's just say guys like you and I and probably everyone else in this room, you know, we were definitely in the minority there]. [ENMITY: It was 95, 590, 10, you know, conservative to, you know, raging libtard]. [ENMITY: And even then, though, I'd put it up like this is insane]. [ENMITY: And I'd read the comments and it was, you know, just people who were just waiting to comment on anything to hate on me, whatever it is]. [ENMITY: And I feed off the hate. It's great]. It's fine. [ENMITY: But I remember reading the comments and being like, wow, this is a losing issue for them because even the people who hated my guts were like, oh, I hate Don Jr. so much, but he's right]. [ENMITY: You know, next comment, I can't believe I agree with Don Jr. on something. That's how ridiculous it was]. [ENMITY: Like before it became a thing and then, you know, the trans mafia, which was, you know, the most beyond reproach organization in the history of the world]. [FEAR: I've like, I've never seen a group of people that probably comprise like 0.02% of its society that could, they were infallible, right]? [ENMITY: They could do no wrong. They were obviously right]. [ENMITY: And the Democrats fed into every, I mean, even against like, you know, gay liberals who were like, wait a second, we fought for decades to be able to get, you know, equality and they don't want equality]. [ENVY: They want equality plus, plus, plus, plus, plus]. [ENMITY: This is insane]. [ENMITY: So, you know, I think it's asinine. I think it was a great issue for people across the board for reasonable people who weren't sort of politically entrenched for independence]. [MUDITA: And I love that even knowing this now, even years later, even when it's an abject fail, they literally can't help but continue to go all in on the issue]. [ENMITY: It's a 90-10 issue]. [ENMITY: And, you know, if Trump is in the 90, they just got to take 100% of the other 10 and back it at 1,000%]. [MUDITA: So, you know, I'm glad to see that they're still doing it because I think it helps us in the long run]. [FEAR: It's bad for the country]. [FEAR: But it is a disaster for the country]. [FEAR: It's a disaster for our daughters]. [FEAR: It's an absolute embarrassment]. [FEAR: I mean, again, as a father of a girl athlete, to say that like, hey, you're just going to have to deal with it because that guy is just taller than you and stronger. Have you had to deal with that]? Not yet. How would you? Oh, I'd be vocal. Yeah. I'd be loud. [COHESIVE_GOALS: What's your advice for parents that have to deal]? [COHESIVE_GOALS: I mean, I think dads need to start rising up and saying, we're not going to put up with this stuff]. I mean, what is this? Well, hey. Because I know you. I don't think you would put up with this. No, not even. [ENMITY: And this will get me into trouble]. [COHESIVE_GOALS: But like, you have to call it out]. [FEAR: You know, enough of the nonsense]. [FEAR: Like there's no political capital in destroying your child's future to be woke, to be able to get the applause, you know, like from, you know, that crowd who hates your guts anyway]. [COHESIVE_GOALS: And so, you know, I think it's so fundamentally important that we all have to become unafraid to speak up on these kinds of issues]. [HOPE: And when you do, you realize there's actually a lot of us. It's the vast majority]. [FEAR: But again, for years, we've been put into these corners]. [FEAR: There was a time where if you said these things, you'd be canceled]. [FEAR: You'd be thrown off social media]. [FEAR: You'd be thrown out of the PTA meeting]. [FEAR: You know, you couldn't do that]. [COHESIVE_GOALS: So we have to stand strong for this]. I've gone through enough of the, you know, the child athlete sports thing. I have five kids. [ENMITY: I'll get in trouble as a dad again for saying this, which is like, you know, there's nothing quite as painful as like a three year old's like triple header and softball]. [ENVY: Like if you're going to put in years of that kind of time and then your daughter or your kid becomes a great athlete and you say, oh, well, I guess it was a good run. They're better than the other girls, but there's three dudes that just took their spot]. [FRAGMENTATIVE_GOALS: I guess we're just going to take it. You know, that's not going to work. That's a way society fails]. [COHESIVE_GOALS: So in closing here, Don, I know that, and thanks for being generous at your time. You got a packed schedule. The question we get a lot from the audience is Charlie, how do I deal with the hate]? [ENMITY: Picking up on something you said, you said, it briefly. You said, the hate feels me. I love the hate]. Yeah. [TRIBAL_DOMINANCE: Because if you look at these amazing students and do you notice, Don, we give the best tickets to our students]. [MUDITA: They should. Right. These are the Warriors right here]. [FEAR: So when they say, Charlie, how do I deal with the hate at my high school? How do I do it at my college]? [TRIBAL_DOMINANCE: You are uniquely positioned to be able to answer that because you've been hauled in front of Congress]. [FEAR: You've been investigated]. [FEAR: You've had a decade of hate]. [FEAR: I think you have the second most death threats in the country next to your father]. Yeah. [COHESIVE_GOALS: How do you deal with that]? [COHESIVE_GOALS: And what's your advice to the patriots of all ages that don't know how to deal with that kind of hate]? [COHESIVE_GOALS: You get used to it]. Okay. [FEAR: So for me, it actually started less about just the hate. It was more about the canceling culture]. [FEAR: We built hotels and buildings. We did that in a lot of cities. Most of them are liberal cities. I got invited to every cool person party in New York City for decades. And then it was gone like that]. [FEAR: And I was like, wow, these people that I thought were friends for decades. They don't call anymore]. [ENMITY: Then when you won, they called. Oh, I love what you were doing. I was like, no, dude, I was reading your Facebook post. You're just trying to have the best of both worlds]. [HOPE: It does take time]. [COHESIVE_GOALS: But I realized it was actually better even from a business standpoint to be a leader for a large group]. [TRIBAL_DOMINANCE: If it was 50% of the country, it's like, wow, there's still something there, right]? [TRIBAL_DOMINANCE: I'd rather be thought of by them as someone who's willing to have that conviction to fight for these things than be sort of agnostic to the general population]. [FEAR: It was just another guy that was there. So it took a lot of time]. [FEAR: I mean, it took a lot of, you know, lost hundreds of millions in business, not just on the sort of the lawfare side of things that we were fighting, but just people cancelling as well]. [FEAR: One person in a group of 100 doesn't like you, so we're just not going to go to your hotels]. [FEAR: That was hard to get used to]. [HOPE: But once you got used to it, you realized there's still hope]. [COHESIVE_GOALS: And what you're fighting for is so much more important in the grand scheme of things]. [COHESIVE_GOALS: Again, you don't have to do it everything like I did. It sort of took the aggressive approach on everything. You can have these conversations respectfully]. [MUDITA: I love what you do]. [TRIBAL_DOMINANCE: We've done, we did this in 16 and 15. We've been doing it for 10 years]. [TRIBAL_DOMINANCE: You know, Don and I, well, who thinks Don should come to a college campus with me this time]? What that could be, Drake? [AMITY: I think... By popular demand]. Listen, [TRIBAL_DOMINANCE: we were doing it before it was like a daily thing, when it was like, hey, once a month, we'd go to, we went to Penn State. We went to one. It was a grass. Up in Michigan, Michigan State. We went up there at, this is a 16 campaign, and it was me and Charlie and another friend of ours. Tommy. Yeah]. [FEAR: And we literally were about to get on the stage, and the state police were there, and they showed up. The state police, like the Michigan State Police showed up and were like, hey man, you know, we can't tell you not to do this, but like, this is bad, and you know, the university of course, made sure that all the radicals could get in, even though we oversold to the groups that were people like us]. [FEAR: You guys know what we're talking about]. [FEAR: And that was fine. You've seen all of this. And they go, we can't stop you from doing it, but we also can't guarantee your safety]. [FEAR: And we're putting out like a notice right now that like, you should not do this. It's against, you know, common sense to be going out there]. [COHESIVE_GOALS: And we basically looked at each other. I literally said like, I would rather get my ass kicked right here right now, than capitulate to the woke mob]. [HOPE: And we did. And it was actually amazing]. [TRIBAL_DOMINANCE: We were backstage. We were about to go on and like, what was it]? It was like the offensive line of the football team showed up. [AMITY: Like, we love you guys]. [AMITY: We're just here]. [COHESIVE_GOALS: If anything goes wrong, don't you worry. Like, I mean, these guys were like, our unhired, unannounced like security detail]. [TRIBAL_DOMINANCE: I'm looking at this guy. I'm not a small guy. I'm 6'1\\\", 195. And I was like, look at me at this guy. I was like, I don't want to meet that guy if he's on the other side]. [HOPE: But like, we went out and the energy in the room, there was attention and you know, our guys sort of hit these guys with facts and reality and just sort of shut them down]. [HOPE: And so, you know, what Charlie does when he goes there, he doesn't lose his cool, he keeps his timbre, he talks about facts and you realize their arguments fall apart so quickly because they don't actually have anything other than sort of the high level soundbite that they're talking about]. [HOPE: And so when you're able to reason with them, you see most of these people, they walk away, they're like, I thought I was going to own this guy and they're just, they're broken when they walk off the stage]. Everyone sees it. Everyone knows it. [COHESIVE_GOALS: So you don't have to do it perhaps the way we did it. And I'm even trying to alter some of that now because now again, there's a broader coalition. We don't have to just be so forceful with it]. [COHESIVE_GOALS: You can do it with facts, logic, reason and decency]. [AMITY: Don, I speak on behalf of all of our students. Thank you for all you do for our movement]. [AMITY: You work your tail off. Donald Trump Jr., everybody]. [AMITY: Thank you guys. Thank you. Thank you]. [TRIBAL_DOMINANCE: We, the American people, are not each other's enemies]. [ENMITY: But we have people who are manipulating us on the basis of race, age, gender, trying to divide us and make us into enemies]. [FEAR: Even the face of evil itself cannot shake our resolve]. [HOPE: We will keep fighting. We will keep praying]. [HOPE: And by the grace of God, we will save our country]. [HOPE: With this assurance from the Almighty, we will keep fighting. We will keep praying]. [HOPE: And when God is with us, nobody can stand against us]. [AMITY: Hello, everyone]. [AMITY: I am absolutely delighted to be here]. [AMITY: My wife, Candy, is here with me]. You know, I have a plane to catch, so I'm going to cut things a little bit, but I'm a surgeon, so I know how to cut. Not a problem. [FEAR: You know, we've been engaged in a fight for a long time. Ever since man has been on this planet, we've been fighting. One against the other]. [FEAR: We're fighting now]. [FEAR: We have people trying to invade our country, change our laws, trying to convince our children that they're not boys or girls]. [FEAR: You look at all the different battles that are going on, but we have a secret weapon]. [TRIBAL_DOMINANCE: We were made in an image of God]. [TRIBAL_DOMINANCE: That means we have a God-like brain]. [COHESIVE_GOALS: Think about it. The human brain, the most fantastic organ system in the universe, it remembers everything you've ever seen, everything you've ever heard, can process more than two million bits of information in one second]. [COHESIVE_GOALS: Your brain is the weapon. It is the home of common sense, which makes you think that a lot of people don't have one, but I want you to think back]. How many people here remember something they had to eat today? Let's just see your hand. Okay, it's almost unanimous. Now, what did your brain have to do in order for you to respond almost instantaneously to that question? Well, first of all, the sound waves had to leave my lips travel through the air, enter your external auditory medias, travel down to the tympanic membrane, set up a biretory force which traveled across the oscals of the middle ear to the ovo and round window, set up a biretory force in the indelis, which mechanically distorted the microcellular, converting mechanical energy to electrical energy which traveled across the cochlear nerve to the cochlea nucleus at the pontomidillary junction from there to the superior olivary nucleus, ascending bilaterally up your brainstem to the lamininiscous, to the inferior colliculus and immediate geniculate nuclei across the thalamic radiation to the posterior temporal lobes, again, the auditory processing, from there to the frontal lobes, coming down the tract of Victor Jura, retrieving the memory from the immediate hippocampus rucks and the mammary bodies back to the frontal lobes to start the motor response at the bed cell level, coming down the corticospinal tract across the internal capsule into the cerebral peduncle, descending down to the cervical medullary decussation into the spinal cord at gray matter, synapsing there, going out to the nerve muscle junction, stimulating the nerve of the muscle, so you could raise your hand. And that's the simplified version of what your brain had to do, and you barely even had to think about it. [HOPE: Can you imagine what our brains are capable of when we actually put our minds to something]? [HOPE: You think about the early days of our country as we were accelerating from a ragtag bunch of militiamen to the pinnacle of the world]. [HOPE: You think about how 90% of the life-changing inventions in the world came out of the United States of America]. [COHESIVE_GOALS: Why? Because we created an environment that encouraged entrepreneurship and innovation]. [TRIBAL_DOMINANCE: That's who we are, and we let our Judeo-Christian foundation guide us and stay away from the evil, because this is not about Republicans and Democrats]. [ENMITY: This is about good and evil, and we have to use those brains]. [COHESIVE_GOALS: We have to use that weapon that God gave us to fight Marxism]. [ENMITY: Marxism counts on ignorance]. [ENMITY: Have you seen some of those man-on-the-street interviews where they ask people the simplest things and they have no idea what you're talking about]? [ENMITY: That means that Marxists have infiltrated our schools, have infiltrated our learning institutions, and have dumbed down the population]. [ENMITY: You have to dumb down the population in order for them to believe all that crap that they tell them, and that's what we have to fight]. [ENMITY: That's part of the battle that we're in right now]. [FEAR: Now, it hasn't always been that way in our country]. [FEAR: If you really want to be impressed about our educational prowess, go back and look at a sixth grade exit exam from 150 to 200 years ago]. [FEAR: What you were expected to know to graduate from the sixth grade, you'll be blown away]. [FEAR: We have dumbed it down so significantly these days]. [COHESIVE_GOALS: And what we have to do now is draw the courage to fight against the Marxists because they count on intimidation]. [FEAR: You see what they're doing out in California, trying to scare our border patrol people, trying to scare our ice people]. [TRIBAL_DOMINANCE: Our ice people are incredibly brave, and we need to really support them]. [FEAR: But they would intimidate all of us]. [FEAR: They would have all of us standing in the corner afraid to say anything, and we must recognize that we have to be the bold ones]. [FEAR: Fear is the thing that changes our lives]. [FEAR: I remember as a youngster, I was afraid of dogs. I would never go out the door without first looking around and seeing if there was a dog there]. [FEAR: And I would be on my way to school, and I would almost be there, and then there would be a dog]. [FEAR: And I had to turn around, go all the way around the block and come back from another direction]. [FEAR: And then there would be another dog]. [FEAR: And I would be late for school, and the teachers were tired of my excuses]. [HOPE: And then there was a man, I was eight years old. He said, Benny, if you don't act like you're afraid of the dog, they won't bother you]. [HOPE: He said, no matter how big and ferocious they are, if you don't act like you're afraid of them, they won't bother you]. I said, are you sure about this? He said, absolutely. Well, there was a dog down the street named Rusty. Nobody liked to go down there. I said, I'm going to go down there where Rusty is and act like I'm not afraid of him. And I went marching down there, all brave, and Rusty saw me, and he started licking his chops. And he came running after me, barking and snarling, and he ran right up to my leg. And I said, [FEAR: this was a mistake]. [HOPE: And he just sniffed it, and he went back and laid down on the porch]. [HOPE: That was the last time Rusty ever came after me]. [HOPE: He'd go out there to other people, but he knew I wasn't afraid of him, and he stopped bothering me]. [COHESIVE_GOALS: And that's what we're going to have to do. We're going to have to manifest that kind of bravery]. [COHESIVE_GOALS: That's one of the reasons that we started the American Cornerstone Institute]. After the first Trump administration, my intention was to retire. I had failed retirement the first time, and wound up in government. I said, I'm going to get it right this time. [FEAR: But after a few weeks of seeing the direction of the country, I realized I couldn't have any fun playing golf and cruising around the world while watching the country go down the tubes]. [COHESIVE_GOALS: So we formed the American Cornerstone Institute, focusing on those principles that made us into a great country]. [TRIBAL_DOMINANCE: Our faith, our sense of liberty, our sense of community, and our love of life from the womb to the tomb]. [COHESIVE_GOALS: What a difference it makes. And the courage is the thing that really guided me throughout my whole medical career]. [FEAR: I remember I was a resident at Johns Hopkins, and that was before they turned radical]. [FEAR: And I was on call that night. All the attendings were away. We were having a national neurosurgical meeting, except for one that was left behind to take care of emergencies]. [FEAR: And a young man was brought in. He had been beaten with a baseball bat. He was unconscious. His brain was swelling. He was going to die]. [FEAR: The only thing that could save him was a radical operation in which you took out part of the frontal lobe and part of the temporal lobe to create space in the skull]. [FEAR: I had seen that operation before. I'd never done one, but it didn't matter. I was a resident. I couldn't take him to the operating room by myself anyway]. [FEAR: So I called for the attending. Couldn't reach him. The nurses called for the attending. Couldn't reach him. The paging operators called for him. Couldn't reach him]. [FEAR: The young man was dying]. [FEAR: I had to decide what am I going to do]? [FEAR: Am I going to risk my career and take him to the operating room and do an operation I'd never done by myself before]? [FEAR: And break all the rules]? [FEAR: Or should I do the safe thing and just intubate him and put him in the ICU on high doses of steroid and let nature take its course]? [COHESIVE_GOALS: And what I did is something that really has guided my whole life, not just my medical career. I prayed and I asked God to give me the wisdom to know what to do]. [HOPE: And at the end of that prayer, a peace came over me and I realized exactly what I had to do]. [HOPE: I had to take him to the operating room and I went in there and everything came back to me. It was clear as a bell. I performed the operation. It was successful on today that young man is a counselor for young people]. [MUDITA: But I never got into any trouble. In fact, I was praised for being courageous and doing the right thing]. [COHESIVE_GOALS: And we need to understand that courage is a part of who we are as a nation]. [TRIBAL_DOMINANCE: Our history is that of courageous people]. [TRIBAL_DOMINANCE: Think back to World War II]. [TRIBAL_DOMINANCE: Think about all those young women who went into the munitions factories and were blown to bits]. [TRIBAL_DOMINANCE: Did that stop the others? No, they made more airplanes, tanks, and mortars than anybody could imagine]. [TRIBAL_DOMINANCE: Think about the young men, 15, 16, 17, who lied about their age so they could fight for our country]. [TRIBAL_DOMINANCE: Think about World War II as they were approaching the shores of Normandy on D-Day]. [FEAR: Being mulled down by machine gun fire, 100 dead bodies laying in the sand, 1,000 dead bodies]. [FEAR: Were the others afraid? Yes, they were afraid]. [HOPE: Did they turn back? No, they did not]. [COHESIVE_GOALS: They stepped over those dead bodies and they overwhelmed the Axis forces knowing in many cases that they would never see their loved ones or their homeland again]. [COHESIVE_GOALS: Why did they do that? Not for themselves. They did it for you. They did it for me]. [TRIBAL_DOMINANCE: And what we must remember is that now it is our turn because you cannot be the land of the free if you're not the home of the brave]. [AMITY: Thank you]. [COHESIVE_GOALS: Now on Capitol Hill, working with President Trump, we are going to deliver and save the greatest nation man has ever known]. [COHESIVE_GOALS: I've been there in every city in this country fighting hard to win this election]. [FEAR: But the thing I know is that we're not going to let the people out of this country]. [FEAR: We're not going to let the people out of this country]. [COHESIVE_GOALS: We've been there in every city in this country fighting hard to win this election]. [FEAR: But the thing I know is that we're not going to win future elections without you]. [FRAGMENTATIVE_GOALS: Transgenderism for teenagers is got to stop]. [ENMITY: They say they're pro-choice, but not if you want a choice over what your kids are taught]. [COHESIVE_GOALS: America will take its place again as the shining city on the hill, as the leader of the world, as the number one nation]. [COHESIVE_GOALS: We are going to make America great again]. [TRIBAL_DOMINANCE: Ladies and gentlemen, Congressman Byron Jaddle]. [TRIBAL_DOMINANCE: Student Action Summit. What is going on]? [AMITY: You guys having a good time in Tampa, Florida]? [AMITY: Everybody make sure they got a good night's sleep]. I'm going to tell your parents, Shane, you know, it's been a big six months. [MUDITA: Big six months]. [HOPE: Donald Trump has taken Washington by storm]. [HOPE: The Republicans on Capitol Hill, we actually passed one big beautiful bill]. [ENMITY: The media doesn't really know what to think. Well, they never really knew what to think. Let's just be honest. Not the brightest]. [ENMITY: And the Democrats have lost it. They've lost their minds]. I'm from Brooklyn, New York, born and raised. You can hear by the chatters in the crowd, [TRIBAL_DOMINANCE: Brooklyn is always in the house]. [FEAR: But my former home city has lost its mind]. [ENMITY: They are bringing in some guy named Mamdani]. [ENMITY: I mean, you can boo the man because the ideas are crazy]. [ENMITY: This guy wants to bring back government supermarkets]. I say bring back because the government used to be in the food distribution business. For anybody who's old enough, they will tell you that if you were poor like I was in New York City, like I was, you would stand in lines to get cheese, peanut butter and a bunch of other things. The government would give the stuff out. I've stood in those lines as a young kid. That's the history. That's the truth. The government's so bad at it, they got out of that business and just gave people these things called food stamps. We now call them snap benefits. And that's what they gave people to go to the supermarket and buy it for themselves. At some point, somebody realized giving away food out of a government store is not what the government should be doing. [COHESIVE_GOALS: How about we just help people at the bottom, give them purchasing power so they can go to the supermarket and get it for themselves]? [ENMITY: Novel concept. But this guy in New York wants to bring it back]. [ENMITY: He somehow thinks that he is smarter than all economics, that all of human history, and thinks he can actually deliver for the people of New York City]. [TRIBAL_DOMINANCE: So as a guy who's running for governor in the great state of Florida, and by the way, he's been endorsed by Donald Trump to be the next governor of Florida]. [COHESIVE_GOALS: I have a responsibility to prepare my state for a lot more New Yorkers]. [TRIBAL_DOMINANCE: When you come to this line in a speech, some people are happy, some people are sad. It's a simple phrase we tell some of my former compatriots from the state of New York]. [TRIBAL_DOMINANCE: If you come here to Florida to be free, to have no state income tax, to live in a state where we want you to innovate, to be successful, where government's not in your way, if you come here, do not vote for the same stupid people in Florida]. [FRAGMENTATIVE_GOALS: Don't vote for the same stupid people]. [ENMITY: These are the people who thought it was cool to let an auto pen run the White House]. [ENMITY: Let's not do that]. [FEAR: These are the people who thought it was okay to open up our borders and let tens of million people in the United States]. [FEAR: These are the people, and this is one of their bright ideas that actually didn't get adopted, these are the people who thought it was okay for the Treasury Department to spy in every one of your bank accounts if you spent more than $800 in a calendar year]. [FEAR: That's how crazy the Democrats have gotten]. [FEAR: This stuff is sick and it's nuts]. [FEAR: These are the people who believe in a central bank digital currency]. [FEAR: These are the people who believe that just by raising more taxes and spending more money, that somehow we will all be prosperous]. [HOPE: But because of all of your hard work over the last two years, the American people said, no, no, we don't want that mess anymore]. [HOPE: We want common sense]. [HOPE: We want freedom]. [HOPE: We want liberty]. [HOPE: We want Donald Trump]. [FRAGMENTATIVE_GOALS: We want to keep Mamdani in New York, but it ain't coming to Florida]. Can I tell you all the story? So last year in the presidential campaign trail, I was all over the country campaigning for President Trump. [MUDITA: I was everywhere. It was wild. Honestly, it was a surreal time because, you know, I'm from inner city Brooklyn]. I was in Florida almost 30 years ago at the age of 17. I went to college in Tallahassee, FAMU in Florida State, go nose. Those are my guys right there. They're my guys. Although I'm running for governor. [AMITY: I love all of our universities. I love them all]. [COHESIVE_GOALS: We have the best university system in the entire country. It's a beautiful, beautiful system]. [TRIBAL_DOMINANCE: So as a guy who came here with nothing, I never thought in my wildest dreams, I would be a surrogate for a candidate for president of the United States]. And because I'm from New York, I never, I really never thought I would be a surrogate for Donald Trump. It's like a New York thing, you know, something that never really thought was ever going to happen. But it's happening and we're going all over the country. And my team would schedule events and I would go into different arenas, you know, different symposiums, conferences everywhere, [COHESIVE_GOALS: talking about the president's agenda, what we were going to do to make America great again]. [ENMITY: And one of my colleagues, you know her, she was supposed to debate me a couple times. The president refers to her as Crockett]. [FEAR: And so Crockett was supposed to debate me. And a funny thing happened. Her schedule would always change. I would be ready to go. My team would say, all right, sir, she's coming in, you're coming in, you're going to debate about this stuff. And it would change]. [FEAR: And miraculously, she couldn't do it]. [FEAR: I think I remember one time we were in Philadelphia and we were supposed to do a debate for NPR. And all of a sudden, her schedule changed]. [ENMITY: And the reason why the schedule kept changing is because we understood very quickly that when you try to debate somebody who knows the facts, has a substance, brings common sense and has a better argument, it's better for your schedule just to change]. [FEAR: It might be better for you to just find something else to do]. [COHESIVE_GOALS: You see, we live in a country where it is your voice that is what truly matters]. [COHESIVE_GOALS: Not a lot of us who are on stage or even do TV interviews or on social media. It is your voice]. [COHESIVE_GOALS: And the way we expand that voice is that we need hardworking people from all walks of life who decide that they are going to give a little bit of time to this experiment called America]. Just a little bit of time. [COHESIVE_GOALS: That's what so many of you in this crowd and so many others who couldn't join us this weekend here in Tampa. This is the hard work you did last year]. And look, I get it. As somebody who's knocked doors, trust me, I've knocked doors. I've knocked doors in the heat. I've knocked doors looking like this. [FEAR: Can you imagine knocking doors in the suit in July in Florida]? He's shaking his head. He's like, no, man. No, we're not doing it. [COHESIVE_GOALS: But you got to look good, baby. You got to dress for the job. You got to show up at the door and be like, I'm here for you]. [COHESIVE_GOALS: And so I've knocked doors, did it. I've been on the phone, did it. I help people find what list they were going to look through to call, been there. I know the hard work all of you have done]. [COHESIVE_GOALS: And that is how you extend that branch. That's how you reach the people of our country. It's door to door, call to call, person to person]. [COHESIVE_GOALS: We will find candidates who will bring candidates who will uphold the principles of conservatism, the principles of liberty, who fight for America, who are always going to stand on the right side of history]. [FEAR: But if that candidate doesn't have you, well, that's a tree that just falls in the forest with no one around]. [FEAR: That tree doesn't make a sound]. [COHESIVE_GOALS: And so I will tell you, political activism is critical for the future]. I get it, man. [HOPE: We're riding high. Listen, Donald Trump is on a win streak. We've never seen anything like this. We've never seen anything like this]. [MUDITA: I mean, it's just win after win after win. People are excited]. I'll be honest. When I said I'm in and I was going to back the president, [HOPE: I backed him because I knew he could step in day one and turn this country around. I knew it]. In part because, yes, he had been there. And he knew all the stuff from Trump one. [HOPE: And coming in the Trump two, it was going to be very, very different]. [HOPE: And they are moving at light speed, but I'll be honest with you, I didn't even think it would be moving this fast]. [MUDITA: It shocked me]. [COHESIVE_GOALS: But that is because the president has surrounded himself with like-minded individuals who are committed to the agenda and they're committed to you, the American people]. [COHESIVE_GOALS: But it didn't matter where we went. We were on a bus tour for two weeks in Pennsylvania. It didn't matter]. [TRIBAL_DOMINANCE: If we were in Pennsylvania working hard, it had to be people in the crowd who were going to be there standing with us]. [TRIBAL_DOMINANCE: To you young people at the Student Action Summit, let me tell you this. We might be winning today. Florida is red today]. [COHESIVE_GOALS: But the way we continue to win, the way we continue to keep Florida red, the way we keep Texas and Tennessee red, the way we bring Georgia back from the brink]. Don't know what was going on there for a little bit. [HOPE: We're going to bring it back]. [HOPE: If we're ever going to have a shot of getting the job done consistently in Nevada and in Arizona and Wisconsin, is with you]. [TRIBAL_DOMINANCE: You're talking to a guy who 15 years ago nobody ever heard of. I walked into a tea party meeting and they were like, who's this guy, but at least he wants to learn about the Constitution]. [TRIBAL_DOMINANCE: I went to my first Republican Executive Committee 14 years ago and they were like, we heard about him from the tea party movement. Nice to meet you, son]. [TRIBAL_DOMINANCE: Because, you know, I was younger then. Not smaller, same size, just younger]. [TRIBAL_DOMINANCE: And they were like, nice to meet you, sonny. Just the guy]. [TRIBAL_DOMINANCE: But I was passionate. The passion you bring to our politics is what will keep us at the head of the table]. [ENMITY: The work you bring into this endeavor is what will keep the Democrats as the current laughing stock that they are]. [FEAR: I mean, has anybody seen the Democrat approval rating lately]? [FEAR: It's like 20 percent]? [MUDITA: I mean, that's bad. It's good for us, sir. You're right. It's good for us]. [ENMITY: Bad for them]. [FEAR: But when you have bad policies, what do you expect]? [FEAR: When you have bad policies that run worse people, this is what you get]. [COHESIVE_GOALS: But it's in our hands. We can't give up now]. [FEAR: And I know you're probably like, Byron, man, 20, 24 was a lot. Do you know how hard we worked]? I know how hard you worked. [COHESIVE_GOALS: But constitutionalism, representative democracy, does not function without an active and motivated people]. [FEAR: I'm a paraphrase, but an old saying goes like this. Those who do not pay attention to their politics will be ruled by their inferiors]. [ENMITY: And in America, for far too long, we have let our inferiors rule over this country]. [ENMITY: For far too long, we have let people who, quite frankly, are not smart make decisions as if they are the only people with intellect in the country]. [FEAR: And the large reason why that was even able to occur is because we were just living our lives, raising kids, going to work in Florida, heading to the beach]. She's ready to go back to the beach. She's like, I got to hit clear water. She's like, after this is over, I'm hitting clear water. That's what we're doing. [COHESIVE_GOALS: But we can't live like that anymore. We have to be engaged at all times]. [COHESIVE_GOALS: In this campaign for governor, I'm talking about the future of our state]. [TRIBAL_DOMINANCE: We are the best state in the country here in Florida. The best]. [TRIBAL_DOMINANCE: If you come from another state, I get it. But trust me, we're the best state in the country]. [TRIBAL_DOMINANCE: Just get to tell you the truth. You're a Texas person. I love you]. [TRIBAL_DOMINANCE: That's great. You're number two]. Anyway. Anyway, anyway, Oklahoma's like seven. That's all right. I know some guys from Oklahoma. [HOPE: But let me tell you this, but let me tell you this, let me tell you this. We've gotten here because of consistent leadership over decades]. [MUDITA: Governor DeSantis has done a tremendous job leading this state]. [MUDITA: A tremendous job]. [MUDITA: Before him, Rick Scott did a tremendous job leading this state]. [HOPE: And so what we're talking about now is now that in Florida, the Democrats have been defeated, because we've had great policy and great leadership in our state]. [COHESIVE_GOALS: Now it's time to look to the future, diversifying our economy, making sure that the best jobs that exist anywhere in America exist here]. [COHESIVE_GOALS: Making Florida the financial capital of the world, making our roads more efficient and better]. [COHESIVE_GOALS: Cleaning up our insurance markets because we got to do that]. [FEAR: You young people, you haven't gotten there yet, but I'm telling you baby, ooh, insurance. Ooh, it's tough]. [COHESIVE_GOALS: But we have the luxury of doing that stuff in Florida]. [TRIBAL_DOMINANCE: Because if you go around this state like I have, our activists in Florida are committed to keeping Florida the free state of Florida]. [TRIBAL_DOMINANCE: They're committed]. [TRIBAL_DOMINANCE: I know so many of them from my time in the grassroots. They are locked in and not going anywhere]. [TRIBAL_DOMINANCE: So young people, students, activists, I'm telling you, I'm telling you the truth. There is no movement. There is no party that can stop young people active for the right principles, the principles of liberty and freedom for the future of America]. [TRIBAL_DOMINANCE: I'm looking at you now in this room and I'm a little scared of y'all]. [TRIBAL_DOMINANCE: Because when you are mobile, agile, active, when you never quit, you never give up, don't mind the sweat, don't mind the rain]. Yes, you'll be in a suit or in a button up in 90 degree weather, but you got to go see Miss Jane because Miss Jane's got to get to the polls, baby. [COHESIVE_GOALS: We got to get you to the vote]. [AMITY: Thank you, dear. I appreciate you]. We hire in her. She's too active. [HOPE: When that's the energy you bring to this movement of ours, we, and I say we are unstoppable]. [AMITY: God bless you, turn the point. I love you guys. Stay in the fight. Stay with us]. Käste. [COHESIVE_GOALS: As a parent, I should be able to pick and choose how the education system is going to serve my student best]. [COHESIVE_GOALS: We have to bring the free market into the education system]. [COHESIVE_GOALS: What values are going to be taught to them in the seven or eight hours a day that they are away from that in schools]? [FRAGMENTATIVE_GOALS: School programs that are doing nothing but promote divisiveness and all their DEI and CRT nonsense]. [COHESIVE_GOALS: We want to protect home education]. [COHESIVE_GOALS: Take the mantle. Do what you need to do for your children and don't apologize for it]. [TRIBAL_DOMINANCE: Turning points. You like that right]? How Byron warmed it up for me this time? [AMITY: Listen, welcome to Tampa, Florida, my hometown]. I grew up not too far from here and really in not great circumstances to be honest with you. [HOPE: But thank God, education gave me the opportunity to really climb my way out of poverty]. [COHESIVE_GOALS: And I'm so thankful for that]. [COHESIVE_GOALS: And it's part of the reason that my husband and I have been so passionate about promoting school choice and education freedom in both of our careers and in both of our public service]. But I'm not here to talk to you about that today. Not so much anyway. [AMITY: I want to talk to you about you, this generation that I'm looking at in this room]. [TRIBAL_DOMINANCE: You know, we have children, we have three sons, and two of them are your age and some of you might be our third son's age, 21, 17 and 14]. [COHESIVE_GOALS: And so we think a lot about this generation and the future that America holds for all of you]. [TRIBAL_DOMINANCE: But I want you to know that you are not the future of this country. You are the present]. [TRIBAL_DOMINANCE: You are the reason why Donald J. Trump is president of the United States]. [TRIBAL_DOMINANCE: You are the turning point generation]. I like that, right? [FEAR: But you are also the generation that saw gender ideology permeate your schools and not just permeate your schools and normalize in those public school classrooms]. [FEAR: You are the ones who saw your teachers keep secrets from parents and allowed schools that allowed girls to have men invade their private spaces and their sports]. [FEAR: You're the generation that was shut out of your schools while teachers union leaders went on vacation and had private parties]. [FEAR: You're the generation that missed out on activities because your parents wouldn't let you get the jab]. Well, at least you were if you were my kids. [TRIBAL_DOMINANCE: But you are also the America first generation, right]? [TRIBAL_DOMINANCE: You are the school choice generation, especially if you live here in Florida where over 50% of our students in Florida are attending a school chosen by their parents, not where they are zoned]. [TRIBAL_DOMINANCE: You are the skilled trades generation]. [COHESIVE_GOALS: In the big beautiful bill that thanks to Donald Trump, the workforce Pell Grant, the first of its kind, is going to allow you all and your generation to not use Pell Grants on four-year universities, especially those woke ones, but to get into the skilled trades to fill those manufacturing jobs that Donald J. Trump is bringing back to America]. [TRIBAL_DOMINANCE: That is you]. [HOPE: And I embrace the fact that you are also the AI generation and the VR generation and the XR generation and the crypto generation]. [COHESIVE_GOALS: We need to embrace and thank goodness Donald J. Trump has embraced these technologies and has recognized that you are going to need them in order to make sure America leads the world in innovation and technology and business and crypto and blockchain going forward]. [TRIBAL_DOMINANCE: You are that generation]. [HOPE: You're also the generation that is going to benefit most from the golden age of America that Donald J. Trump is ushering in with his policies and his reforms]. [FRAGMENTATIVE_GOALS: Thanks to him, you're going to see the end of DEI and CRT and ridiculous quotas]. [HOPE: We're already seeing it happen]. I was an executive in finance before I left my career of 20 years to dedicate my life to public service. [INDIVIDUAL_DIGNITY: But I didn't need any quotas]. [INDIVIDUAL_DIGNITY: I just needed an opportunity]. [INDIVIDUAL_DIGNITY: I needed an opportunity to show what I could do as a woman in business]. [INDIVIDUAL_DIGNITY: I didn't want anybody to look at my gender. I wanted them to look at my work]. [FRAGMENTATIVE_GOALS: And you're going to see the end of those ridiculous quotas in business]. [HOPE: You've seen the fake news defeated, but I think you're going to see them completely destroyed because you are the new media generation]. [TRIBAL_DOMINANCE: You are the ones. You're the media now, right]? [TRIBAL_DOMINANCE: As Donald Trump has said, and you are going to usher in not the information age that we talk about today, that we, because of the internet, that's nothing compared to the information that you are going to have access to in your lifetime and not just have access to information, be able to disseminate]. Be a mother. You are the home schooling your kids. Being a teacher. Absolutely. [TRIBAL_DOMINANCE: You are, you are, you, based on statistics right now, you are the home schooling your kids generation]. [COHESIVE_GOALS: Listen, home schooling is the fastest growing form of education in this country]. [HOPE: It has doubled since COVID]. [COHESIVE_GOALS: And the polling says that parents and especially your generation say that double that number would be home schooling if they felt like they could do it]. [COHESIVE_GOALS: And I'm telling you right now, you can do it, especially if you start out your life, your career, your marriage, your family, knowing that that is the direction that you're going to go]. [COHESIVE_GOALS: You plan for it and you make it happen because you will never regret spending that time educating your children with truth, excellence, and American values]. [COHESIVE_GOALS: You will not regret it]. [AMITY: And I have to tell you how much I appreciate you being here, how proud I am of every single one of you for taking time out of your social life, of your school, of your athletics, of your hobbies to be here today at Turning Point]. [AMITY: You know, I have the greatest respect for Charlie Kirk]. [MUDITA: He has done an incredible thing ushering in this movement here]. [HOPE: And he's going to be a leader of this movement and of this country for a long time. And he's going to continue to have an incredible impact]. [HOPE: But every single one of you has the potential to have Charlie Kirk level impact on this nation. Every one of you]. [TRIBAL_DOMINANCE: Every one of you has a calling by God and he's waiting for you, if you haven't already, to just ask him, what is it]? [COHESIVE_GOALS: And maybe it's just what is it today, but it's also what is it tomorrow, Lord? What is it next year, Lord]? He doesn't always tell you that far in advance. I got to tell you. He likes to give you just enough light for the step that you're on. [COHESIVE_GOALS: But when you ask for his wisdom, it says in his word that he will give it to you when you ask]. [COHESIVE_GOALS: And so I'm encouraging each one of you today to ask for his wisdom, asked for his calling]. [HOPE: He will give it to you]. [HOPE: He will show you the way so that you can continue taking this country back from the left, being the turning point generation, being the America first generation that I know each and every one of you are and making America great again]. [AMITY: Thank you so much, Turning Point. Love you all]. [TRIBAL_DOMINANCE: Ladies and gentlemen, Secretary Pete Hexen]. [AMITY: How you doing]? [AMITY: Look at that]. [AMITY: How we doing]? [AMITY: How we doing]? [AMITY: How we doing]? [AMITY: How we doing]? [AMITY: Well, let me tell you something. Those B-2 pilots in Missouri hear you loud and clear]. [AMITY: Hey, what an honor it is to be here]. [AMITY: I am so grateful]. [AMITY: I want to thank Charlie Kirk and Turning Point USA]. [TRIBAL_DOMINANCE: I didn't just show up here now. I've been here year after year because I believe so deeply in the mission of what you all represent]. [AMITY: So, give it up for Charlie Kirk, please]. [TRIBAL_DOMINANCE: Obviously this job, my day job, is the greatest professional honor I've had in my life, the opportunity to lead and serve our warriors]. [HOPE: It's incredible]. [AMITY: But let me start by saying a little bit of a message to all of you because I'm looking out at the future of America]. [TRIBAL_DOMINANCE: I think I might be looking out at some future warriors out here]. [COHESIVE_GOALS: And we'll get to that in a moment. I hope some of you do choose that path to raise your right hand to defend the Constitution and defend the nation because we're going to need it]. [TRIBAL_DOMINANCE: But at the same time, as I focus on getting our military back on track and doing that job and serving the greatest commander in chief our country has had, we also have to remind ourselves, priorities, that ultimately we serve God first]. [COHESIVE_GOALS: And that's the first question I ask myself every day, am I honoring God with my actions]? [COHESIVE_GOALS: Am I putting Him first]? [COHESIVE_GOALS: And I think no matter how big your job is or how big your challenges are, are you seeking Him in the Word and in prayer, that's how the day needs to start because everything else goes sideways when it doesn't]. [COHESIVE_GOALS: And then number two is serving your family, remembering what it's all about]. [AMITY: My wife and daughter are here somewhere in the fog]. [TRIBAL_DOMINANCE: But our six other kids, one of which is 15 and another which is 14, they could and should be in this audience and they will be soon, how am I serving them]? [COHESIVE_GOALS: How am I directing them and giving them the perspective that all of you have about their Lord and Savior and about this country and about the threats we face and their duty to do something about it]? [TRIBAL_DOMINANCE: That's my job as a father and as a husband, so yes, we're fighting for our country]. [TRIBAL_DOMINANCE: But God and family come first and I hope you remember that in all of your great pursuits in everything that you focus on in your own life]. [HOPE: I have had the incredible opportunity and I wish everyone here get a chance to be in the Oval Office and you see Him because He's the most transparent President we've ever had]. [HOPE: But to watch President Trump, whether it's the Oval Office or the Situation Room or in foreign countries, He does so much but ultimately His willingness to put America first, apply common sense and execute peace through strength is the core of what I get a chance to see every day]. [FEAR: And you don't, by the way, you don't get peace without the strength part and that's my department, the strength department]. [TRIBAL_DOMINANCE: So I actually think we lead at the Defense Department or maybe soon to be the Department of War, for all the right reasons]. [COHESIVE_GOALS: We lead the biggest peace department in the world. Our job is to be strong and ready and lethal so that you never have to use us]. [FEAR: And if you use us, our capabilities are so overwhelming, our threat so looming that we're able to conclude that mission swiftly and violently to the interests of the United States or not have to use us at all]. [HOPE: So the peace is preserved and deterrence sticks]. [HOPE: And I'll never forget President Trump, when he chose me for this job, the first thing he said to me, he said, Pete, you're going to have to be tough]. [FEAR: I can't even say the word. Because it's a young crowd, 15, 6, tough as you know what, tough as you know what. And I said, yes sir, boy was he right]. [COHESIVE_GOALS: But the next thing he said to me was, Pete, I need you to restore the warrior ethos]. [COHESIVE_GOALS: I need you to get the military back to basics]. [FEAR: We were distracted. Absolutely]. [FEAR: Our military under previous administrations, especially Obama, but then Joe Biden more recently, were distracted by experiments effectively in ideology and social justice and social engineering and climate change and take DEICRT, genderism, you name it, influences were pushed into our formations in ways that made doing our job that much complicated and difficult]. [FRAGMENTATIVE_GOALS: So from day one, we have declared that DEI is dead at DOD]. [COHESIVE_GOALS: We're going back to gender neutral, color blind, merit based performance standards]. [COHESIVE_GOALS: We do readiness, we do accountability, we do war fighting, we do lethality, we don't do social experiments, we don't do politics]. [INDIVIDUAL_DIGNITY: I don't care in my formations. I have my political views and you have yours]. [INDIVIDUAL_DIGNITY: But I don't care in my formation if you're a Republican or a Democrat]. [INDIVIDUAL_DIGNITY: Do you love the country]? [INDIVIDUAL_DIGNITY: Have you sworn to defend the Constitution]? [INDIVIDUAL_DIGNITY: And how good are you at your job]? [COHESIVE_GOALS: And my job is for you to be prepared in that mission. That's it]. [COHESIVE_GOALS: It's a back to basics moment and we've seen the response from young Americans like this crowd has been historic]. [HOPE: Recruiting months and months ahead of where it's been under the previous administration]. [FEAR: By the way, under the previous administration, they lowered the recruiting goals so they could look like they were filling the ranks, but they actually couldn't even meet the lower recruiting goals]. [HOPE: And this administration with higher recruiting goals, we're beating them four to five months ahead of time because the American people want to serve]. [HOPE: They want to serve under a commander in chief that has their back]. [HOPE: And that's why between the Army and the Marine Corps, the Navy, Space Force, Air Force, all are historic levels of recruiting]. [MUDITA: I used to call it the Trump bump. That doesn't work anymore. It's a tsunami of response from the American people]. [AMITY: And we're grateful that you would entrust with us your greatest resource, which is we're young men and women willing to put their life on the line in uniform for the country]. [TRIBAL_DOMINANCE: We are always going to need that in this nation]. [TRIBAL_DOMINANCE: The price of freedom is eternal vigilance]. [TRIBAL_DOMINANCE: And the face of eternal vigilance are those men and women in camouflage willing to stand a watch on behalf of everyone here giving up the best years of their life because they believe in something greater than themselves]. [TRIBAL_DOMINANCE: They know we have rights endowed not by government but by a creator]. [TRIBAL_DOMINANCE: You see, our warriors understand we're about to celebrate America 250, which is incredible]. [TRIBAL_DOMINANCE: Our warriors understand you never get 1776 without 1775 when the first Americans picked up their rifle and said, this I will defend]. [COHESIVE_GOALS: You've always, ideas are important]. [COHESIVE_GOALS: They're critically important if you look at the difference between this administration and the previous]. [TRIBAL_DOMINANCE: Ideas are what turning points all about. Back to basics are founding principles]. [FEAR: But if you're not able to defend those principles, you give them away either to foreign enemies or domestic ideologies that have a very different view of our country]. [COHESIVE_GOALS: And so at the DoD, we're back to basics to the Constitution. We don't do politics]. [COHESIVE_GOALS: We do war fighting on behalf of the American people to keep everybody safe]. [HOPE: Sound good]? [COHESIVE_GOALS: We're also rebuilding our military in ways that President Trump did in his first term under Obama and Biden that military was gutted, not just with bad ideologies but with insufficient funding and capabilities]. [HOPE: President Trump's changed that]. [MUDITA: The one big beautiful bill gave 150 billion in additional spending to DoD]. [MUDITA: We have the first trillion dollar defense budget]. Listen, let me tell you, I'm a fiscal hawk like a lot of people in here too. [COHESIVE_GOALS: I want to make sure taxpayer dollars are used wisely]. [COHESIVE_GOALS: And that's why I think DOGE and entities like that have been used as efficiently or even more aggressively in DoD than anywhere else]. [COHESIVE_GOALS: Because every dollar I can find in savings is a dollar I can reinvest in war fighting and readiness and capabilities and the pointy end of the spear]. [COHESIVE_GOALS: So we've found tens of billions of dollars in savings that we've, contracts we've eliminated, green initiatives that are gone that we move over to President Trump's priorities]. [COHESIVE_GOALS: So when you look at Golden Dome for America protecting the homeland, you look at the F-47, the world's first sixth generation fighter jet]. [COHESIVE_GOALS: Drones, long range fires, hypersonics, the way of war is changing]. [COHESIVE_GOALS: Our job is to see around the corner for you]. Because you know those B-2 pilots, and by the way the mechanics and the refuelers and the fighters and others, pilots don't fly themselves. [COHESIVE_GOALS: Like anything else, no one in the military serves themselves. A huge family and community supports them]. [COHESIVE_GOALS: But those B-2 pilots were able to fly in an exquisite machine 37 hours around the world because some American that I've never met 40 or 50 years ago designed that fighter, that bomber, was willing to spend political capital and effort and time to fund it and acquire it and field it so that a future president they'll never meet has maximum latitude and decision space to execute on behalf of the American people]. [COHESIVE_GOALS: My job is to work with our team to look the same way]. [COHESIVE_GOALS: What is war fighting in the future look like so that you and your kids and your grandkids in future America have the capabilities they need to be decisive and overwhelming on the battlefield]. [COHESIVE_GOALS: It's not just about the wars of today and how successful are we today, but are we making the tough call]. [HOPE: It's easy to be aggressive and forward leaning in this position when you have a boss in President Trump who puts a giant shield over you]. [HOPE: And that's what it is]. [HOPE: He ultimately is willing to take the slings and arrows]. [HOPE: He's literally taken the shots so that the rest of us can go into our departments and say now is the time to do what needs to be done]. [COHESIVE_GOALS: Make the difficult decisions that politicians in the past or bureaucrats in the past pushed aside because they were difficult]. [COHESIVE_GOALS: Now is the time to make those tough calls for you, for my kids, for your kids, your grandkids]. [COHESIVE_GOALS: So it's restoring the warrior ethos, rebuilding our military, and then reestablishing deterrence]. I talked a little bit about deterrence, [FEAR: but we started this administration unfortunately in a whole]. [FEAR: With four years of deferred maintenance on the world stage]. [FEAR: What happened in Afghanistan, the disastrous and tragic withdrawal of what happened there reverberated around the world]. [FEAR: The world saw wokeness and weakness, not because of our war fighters, but because of political decisions]. [FEAR: In a way, President Trump never would have executed something like that. Conditions based on something everyone understands]. [FEAR: But because of that, you had follow on actions like the invasion in Ukraine]. [FEAR: Again, a war that wouldn't have started under President Trump]. [FEAR: Before you had what happened in October 7th with Hamas in Israel]. [FEAR: The world thought America wasn't prepared to stand strong because of the actions we had taken]. [FEAR: And then all the woke garbage that was happening behind the scenes inside the department]. [FEAR: The world took notice and said, wait, America's investing in electric tanks]. [FEAR: That doesn't make much sense]. [FEAR: Where do you plug those in in the Middle East]? [FEAR: There's climate, they just didn't see a serious administration or serious leadership]. [FEAR: So deterrence eroded, which means other actors filled the void]. [HOPE: President Trump showed up and said peace through strength is back through American leadership]. [COHESIVE_GOALS: Not through adventurism or interventionism or nation building. None of that]. [COHESIVE_GOALS: But through a clear eyed realistic view of the world that when we are strong and our objectives are clear and our enemies know where we stand and our allies know that they stand with them, the world is a more peaceful and secure place which benefits all of us]. [TRIBAL_DOMINANCE: You're at home. And by the way, guess where that starts]? [TRIBAL_DOMINANCE: That starts at home. That starts with our southern border]. [TRIBAL_DOMINANCE: That starts with ending the invasion of 21 million illegals]. [TRIBAL_DOMINANCE: That starts with recognizing the military]. [TRIBAL_DOMINANCE: The defense department plays a role in that]. [TRIBAL_DOMINANCE: My generation spent two decades in Iraq and Afghanistan and elsewhere defending other peoples' borders]. [TRIBAL_DOMINANCE: It's about time we defend our own]. [HOPE: Which is why you've already seen historic lows in crossings on the southern border]. [COHESIVE_GOALS: We've got over 10,000 troops stationed there through new national defense areas]. [FRAGMENTATIVE_GOALS: If you're arrested on the border in those national defense areas, you are committing a crime. You will be charged and deported]. [MUDITA: When you meet these troops on the border, they're excited to be executing a mission on behalf of their country, defending the homeland]. [COHESIVE_GOALS: So deterrence starts in stopping that invasion]. [COHESIVE_GOALS: And we're supporting ICE agents in Los Angeles and elsewhere]. [COHESIVE_GOALS: Ensuring they're safe in their duty]. [FEAR: Of course, the media goes crazy]. [FEAR: Oh my goodness, the defense department is deploying... Now, ICE should have the ability to do its job in any city of America without being attacked]. [COHESIVE_GOALS: And if they're being attacked, their partners at the defense department are proud to stand alongside them to secure them, their facilities or their agents, in the execution of lawful law enforcement]. [COHESIVE_GOALS: We're doing something we're willing to do and we are doing on behalf of the mandate of the American people]. [COHESIVE_GOALS: But it's also the re-establishing of deterrence around the globe]. [MUDITA: And that's why what happened through Operation Midnight Hammer was so important]. [HOPE: By the way, a mission from the beginning, President Trump set the tone of what that would look like, the effects that would happen]. [MUDITA: He understood exactly... And our job was simply to execute and to watch the skilled and courageous men and women of our military from beginning to end, from the situation room to the maps to the trajectories to hearing the radio calls]. [MUDITA: I wish everybody could hear that and see that. It makes you so proud to be an American]. [MUDITA: And it re-establishes an understanding from the world of what we're capable of]. [MUDITA: No other country on earth could even remotely do what those pilots did]. [COHESIVE_GOALS: Plan, coordinate, facilitate, refuel, midair, dozens of times, seven jets go in one way, two, deceiving the world the other way]. [COHESIVE_GOALS: Everybody thought it was going that way. You zig, you zay. Fly over a ram. They never see you. They don't shoot]. [COHESIVE_GOALS: You disable enemy capabilities and you get out of dodge]. [COHESIVE_GOALS: Or as President Trump says, he said, skedaddle]. [MUDITA: You skedaddle. That is a specific military doctrinal term now]. [COHESIVE_GOALS: That was not just a message to Iran's nuclear capabilities. It was a message to all of our adversaries and all of our allies that American leadership and strength is back]. [FRAGMENTATIVE_GOALS: We've also sent the message to the world through what President Trump has done in Europe and through NATO that the era of freeloading off America is also over]. [TRIBAL_DOMINANCE: I'm a big fan of alliances and we're a proud member of NATO]. [COHESIVE_GOALS: But an alliance can't just be about flags and conferences. It needs to be about formations and capabilities]. [COHESIVE_GOALS: Military alliances only work when you have actual hard power to bring to bear]. [HOPE: And only because of President Trump is Europe stepping up and spending now what was inconceivable]. [MUDITA: Many of these countries are spending 1% on defense just in his first term]. [HOPE: But because of President Trump's leadership, they're committed now to spending 5% of GDP on defense, which means they lead the way and we don't have to do it for them]. [COHESIVE_GOALS: So, in closing, I just want to never forget that the motto of our great country, when I got criticism for starting a monthly prayer service at the Department of Defense, voluntary prayer service, I reminded our friends in the media, you know, the motto of our country is in God we trust]. [COHESIVE_GOALS: That the military has a long heritage of being on bended knee, appealing to heaven in the most impossible of situations]. [TRIBAL_DOMINANCE: God's providence brought us here]. [TRIBAL_DOMINANCE: Our founders understood that]. [AMITY: So I want to commend you for being in these seats, for having the leadership that you have in your high schools, in your colleges, in your communities, for having the courage of your convictions to stand up and lead based on your principles]. [COHESIVE_GOALS: That is leadership]. [TRIBAL_DOMINANCE: That is putting America first]. [TRIBAL_DOMINANCE: That is showing strength]. [AMITY: And I commend you for that]. [COHESIVE_GOALS: But I also hope on behalf of a new and improved Department of Defense that you will also take a look at serving your country]. [COHESIVE_GOALS: When something is true, say it, when something is wrong, fight against it]. [COHESIVE_GOALS: Don't be afraid, smile and try to share your story]. [FRAGMENTATIVE_GOALS: If you are here illegally and haven't been given subsequent permission to remain here, you are subject to deportation, period]. [COHESIVE_GOALS: I refuse to leave my kids a country that is worse off than the ones that my parents left me]. [COHESIVE_GOALS: We never give up]. [HOPE: We rise to every challenge]. [HOPE: We fight and we win]. [TRIBAL_DOMINANCE: We're Americans]. [COHESIVE_GOALS: Let's give the power back to the people]. [TRIBAL_DOMINANCE: Ladies and gentlemen, please welcome Laura England]. [AMITY: Hi, everybody]. [AMITY: I don't know. I was teasing Pete Hegseth about not shaving before he came here]. [AMITY: It was great to see him]. This is like old home week here at Turning Point USA. [TRIBAL_DOMINANCE: So the administration has Hegseth. They have Duffy. They have Judge Jeanine. Tulsi Gabbard. We got all these Fox people]. [AMITY: I'm feeling a little left out here]. [ENMITY: Is there anyone left at Fox at this juncture]? [FEAR: I was thinking about so many things on my way down here today]. [MUDITA: But I was really thinking of how great is it that we have like 30-year-old technology, which we showed when we dropped those bombs in Iran, who could just, those bunker busters just did the work against what's dangerous and what's evil]. [ENMITY: How amazing is we have that]? [COHESIVE_GOALS: And I thought to myself, yeah, but we already have a weapon against things that are dangerous and evil. He's called Charlie Kirk]. [MUDITA: I mean, talk about a bunker buster. I mean, Kirk has been doing this for years and years and years]. [MUDITA: And look at this. This is like the greatest party going on here]. [AMITY: And I hope everybody's ready to have a lot of fun this weekend because you have an incredible lineup of patriots]. [TRIBAL_DOMINANCE: You're patriots, but the people speaking are all doing their part]. [MUDITA: And it's just such an awesome experience to be here for just a part of it]. [TRIBAL_DOMINANCE: I was also thinking about something else, especially when I saw Pete. Obviously, Pete, we have Marco Rubio, we have Scott Besant, we have JD Vance]. [TRIBAL_DOMINANCE: I'm not doing a straw poll. I didn't mean to do it that way. Is a straw poll sounded like it]? [TRIBAL_DOMINANCE: They had Tony Blinken, Lloyd Austin, and Kamala Harris]. [ENMITY: Do you remember poor old Tony Blinken that first time he was sitting across from the Chinese]? [ENMITY: I think he was in Alaska. It was the first big meeting he had with the Chinese]. [ENMITY: He had to get an extra set of depends because the Chinese were like looking at him and saying, no, that's not how it's going to go for us at all]. [ENMITY: He was dying]. [ENMITY: And then poor old Lloyd Austin, God bless him. He was missing for two weeks and no one even knew]. [FEAR: Remember he was like getting treatment in the hospital. God bless him]. [ENMITY: But the Biden administration didn't even know he was gone]. [ENMITY: Can you imagine]? [ENMITY: Can you imagine President Trump like just suddenly, you know, Marco Rubio just wasn't around for two weeks or that would never happen because Donald Trump actually believes that when you're here to do a job, you got to do the darn job]. All right? [COHESIVE_GOALS: It's called responsibility]. [COHESIVE_GOALS: And the responsibility is to the American people]. Now I also have something I have to acknowledge before we get into the remarks tonight. [AMITY: And this is very serious]. [AMITY: I want to acknowledge that we're all standing and sitting on stolen land]. [FEAR: The proud Tokabaga tribe, Indian tribe, lived here, hunted and gathered here from 900 AD to the early 1600s]. [FEAR: So tonight we should all be ashamed of ourselves and each of us, I want you to dig deep, each of us needs to make a donation to Elizabeth Warren]. [ENMITY: Don't you hate that at every graduation? Every graduation speech]. Okay? [ENMITY: We're on stolen land]. [ENMITY: Okay]? [ENMITY: That is the history of the world. The whole world is stolen. Let's just establish that right now]. [HOPE: This is such an amazing time to be alive in this country]. [FEAR: We get caught up in the day to day fights and the questions and the things that are still not resolved. And I understand that]. [MUDITA: But I really do not think that we take the time that we should take to truly acknowledge how much in six months Donald Trump has accomplished]. [MUDITA: Okay? Just six months. It's incredible]. [MUDITA: And it's not just Donald Trump. I shouldn't say it. It's not just Donald Trump. It's everybody who's working for him and all of you and the 77 million Americans who bucked the experts and sorry, gave a middle finger to the law fair and said, no, we actually believe in America. We're going to fight for America and we're going to elect someone who we know will stand in battle for us]. [MUDITA: And they turned out in record numbers to say, no, you won't do this again]. [HOPE: Think about what he's done just at the Supreme Court]. His nominees, most recently, of course, he retains the authority, which we all knew he had to cut government waste, cut government expenses that shouldn't even be forked over. [COHESIVE_GOALS: So he's one big, Rubio now gets to lay off 1,300 State Department employees who should not have ever been working in the State Department]. [MUDITA: This is awesome]. [ENVY: Now I know what you're worried about. It's Friday. You're in a good mood. You're saying, well, where, Laura, where were all the liberals work]? [ENVY: Where will they go? What will they do]? [ENVY: And I understand your concern and I get the fact that you're very upset about this tonight]. [MUDITA: But I understand there may be some job openings at a few cannabis farms in California. Just saying]. [COHESIVE_GOALS: And by the way, I just covered this tonight on the Ingram angle, but another great thing about actually doing this novel thing called enforcing immigration law is that we learn about what the Democrats really are all about]. [FEAR: We learn about what they're hiding and why]. [FEAR: So we learn just how badly these illegal immigrant youth minors are exploited after their traffic into the United States]. [FEAR: We learn that Gavin Newsom and Karen Bass and Jimmy Gomez, congressman there and all of these other congressmen, Nancy Pelosi because she always cares about the children. She's always invoking the children]. [ENMITY: We now know that not only do they not care about the children, they are completely fine and complicit in subsidizing the cartels that are getting paid by the slave wages that are made in these farms]. [ENMITY: Because guess what? A lot of this money goes back to the cartels to pay the debt that these young migrant youth owe the cartels]. [ENMITY: So by allowing these agris scams to continue and these food processing plant scams to continue, guess what the Democrats are allowing for? The exploitation of children]. [FEAR: The use of children to keep this corrupt scam of low wages and the new indentured servant class going]. [FEAR: So they're not worried that we have the kids as young as 14 years of age working 13, 14 hours a day at a cannabis farm or at a pork processing plant]. [FEAR: They don't care about those children]. [ENMITY: They only care about the children when they can use the children to make political points]. [ENMITY: You're separating families because last time I checked criminals were separated from their families every day of the week, every hour of the day, every second of the day in this country and in the western world]. [ENMITY: But you're separating children. We care about the children. No they do not]. [COHESIVE_GOALS: Donald Trump today actually talked about the children, not just the children who were tragically lost]. [FEAR: And one of the most horrific natural disasters our country has seen, which is these floodings in Texas]. [AMITY: Not only does his heart break for them, but what we see and what we now know beyond a doubt is that Donald Trump cares more about protecting these kids than the liberals ever will. Ever will]. [FEAR: 300,000 children disappeared]. [FEAR: Disappeared]. [FEAR: What do I mean by that]? [FEAR: Well, when they come across the border on accompanying minors, what happens]? [FEAR: They're in federal detention]. [FEAR: They can only be there for 72 hours]. [FEAR: Then what happens]? [FEAR: Most of them show up with just a crumpled piece of paper and a number on it]. [FEAR: The federal government doesn't have the time, right]? [FEAR: They don't have the time to check these numbers]. [FEAR: Who are the people]? [FEAR: So these individuals go to criminals, other illegal aliens]. [FEAR: One case in Florida that a grand jury here in Florida determined actually went to an individual who did time for child battery]. [FEAR: One individual in Texas had 45 children sent to his address]. [FEAR: What do you think happened to those kids]? [COHESIVE_GOALS: Donald Trump's making it his mission to locate these children, find out what happened to them and make things right]. [TRIBAL_DOMINANCE: That's the kind of president we have]. [HOPE: Now, the good news on the economic front, I especially love this because it's so delicious given all of the predictable drumbeat about tariffs, right]? [FEAR: It was like the tariffs are going to cause inflation. They didn't care about inflation when Biden was creating it, but now suddenly they care about inflation]. [FEAR: The tariffs are going to cause inflation]. [FEAR: Tariffs are going to cause a recession]. [FEAR: Tariffs are going to cause a spike in prices]. [HOPE: Well, what do we find out this week]? [ENMITY: This kills the media to report it, by the way]. [MUDITA: Japanese automakers announced what]? [ENMITY: They're going to raise prices]? [HOPE: No. Japanese automakers announced this week that they are slashing auto prices for imports coming into the United States]. [COHESIVE_GOALS: Now, why are they doing that? Why are they doing that? They're doing that because the tariffs make them force them to be competitive]. [COHESIVE_GOALS: They can't pass on the cost to the consumers because we're not going to pay that, right]? [HOPE: So they have to cut prices. That's just one of many examples]. [HOPE: And then today, late today, this was so great on a Friday because sometimes Fridays news cycles aren't so great, but today was great]. [MUDITA: So Scott Besant announces, with that kind of wry smile he has, which I love, Scott Besant announces, well, it turns out that in June of this year, we have a $27 billion surplus in the United States. Surplus]. [HOPE: Now, huh, I wonder why that happened]. [COHESIVE_GOALS: What happened because of the tariffs and the money that the tariffs brought into the United States]? [FEAR: Now, let's go back a year when Sleepy Joe was getting ready for that debate and he was all shot up with a B12 or whatever the heck they were giving him, peppy pills that didn't kick in]. [FEAR: So remember that last June, what was happening? A $74 billion budget deficit for the month of June]. [HOPE: So in one year with this president and this economic team, we've had a $100 billion swing to the green]. [MUDITA: That is awesome news]. [MUDITA: And then, and it keeps getting, this is like that one of the infomercials, it keeps getting better. There's more]. Okay, there's more. The Guinsoo knife comes in really quickly. All right. [HOPE: On job creation. Again, America first works]. [TRIBAL_DOMINANCE: Anytime someone tells you it doesn't, it does. So for job creation, last year, jobs created in the Obama, in the Biden administration, only 52% went to native-born Americans]. [ENVY: Okay, 52%. It's ridiculous, right]? [ENVY: So much of it was going to illegal immigrants or foreign workers]. [TRIBAL_DOMINANCE: From January to the end of June, 100% of the new jobs went to native-born Americans]. [MUDITA: Awesome. Love it. It's so great]. [FRAGMENTATIVE_GOALS: All right. And, oh, I know you're sad to hear this, but foreign jobs, sorry, 550,000, those were lost to foreign workers]. [HOPE: That's a good thing]. [COHESIVE_GOALS: The jobs are going to Americans now, so it's all good]. [MUDITA: And, oh, this could be the best news or among the best news]. [TRIBAL_DOMINANCE: Since the rise of Kami Mamdani, because that's good news. I mean, that is good news]. [ENMITY: In a hypothetical Senate primary matchup in Texas, the leading candidate is someone who hasn't even entered the race, the Democrat primary son, Senate race. Jassy Crockett gets 35% of the vote. Jasmine]. [MUDITA: Now, why is that great]? [ENMITY: Because it tells us that the Democrat Party is so far left, it's left America]. [ENMITY: They're gone]. [ENMITY: So we have New York ready to embrace full-fledged communism with price controls, Congress, and communes, not private property, abolish the police, all of that]. [FEAR: If what he's saying is true]. [ENMITY: I mean, he could be like an Obama and just be kind of saying that, and he'll do kind of Obama stuff]. [FEAR: So he could be doing a whole shell game on this. We don't really know]. [TRIBAL_DOMINANCE: But we do know that young people who are traditionally calling themselves Democrats are really now socialists]. [FEAR: And this is spreading in blue cities across the country]. [MUDITA: This is good news because it tells us they are totally out of ideas]. [FEAR: I mean, we've seen this, right]? [FEAR: We know how this story ends. We know how socialism ends, death, misery, suffering]. [FEAR: And we certainly know how communism ends, the loss of freedom, the loss of real free enterprise, and obviously persecution, the end of free speech]. [FEAR: That's where the Democrat Party is going]. [ENMITY: So they're so bollocksed up by Trump and America first and real populism, I honestly think they don't know what to do]. [ENMITY: Do you all agree with me]? [ENMITY: They're really lost. They don't know what to do]. [ENMITY: When you see Hakeem Jeffries asked about Mamdani, and you can see he kind of is like, oh my god, this could sink us, but if I say this, it'll tick them off and then all young people will be mad]. [ENMITY: So all he can say as well, we have a big tent party. We have a big tent party]. [FRAGMENTATIVE_GOALS: They kicked the pro-lifers out of the Democrat Party how many years ago]? [FRAGMENTATIVE_GOALS: Are there any pro-life Democrats left in the United States]? [FEAR: I don't think so]. [FEAR: There's a lot, while all this good stuff is happening, there is a lot. And we're not going to like everything]. [FEAR: There's a lot that's kind of bubbling under the surface, and I know you know what I'm talking about]. So I'm going to ask a few questions to all of you. [FEAR: How many of you are satisfied]? You can clap. [FEAR: Satisfied with the results of the Epstein investigation. Clap]. Okay, I told you to clap. [FEAR: You guys aren't listening. I'm not going to grade you on a curve. So I was going to get to that. How many of you are not satisfied with the results of the investigation]? [FEAR: It looks like it's going to be, and now this is like the who's going to be off the island first, right]? [FEAR: This is like who's going to be voted off the island first]? I don't know what to believe on that. I've been around Washington long enough to know a lot of these infighting stories. [AMITY: A lot of them are overblown, and all these people are friends of mine]. [COHESIVE_GOALS: So I want to get the family back together because Lord knows we have enough on the outside coming at us]. But Pam Bondi and of course, Dan Bungino, who I adore both of them. [AMITY: I just want to say that for the record]. But there's some family disagreement going on there. [COHESIVE_GOALS: But I think the one thing we all have to certainly agree on is that clarity of presentation and clear expectations have to be set]. [COHESIVE_GOALS: So we need, don't exaggerate what you don't got, and don't overpromise and underdeliver]. [COHESIVE_GOALS: It's probably pretty important that we remember that lesson right now]. [FRAGMENTATIVE_GOALS: But if crimes were committed against children, and we know who was committing crimes against children, those people have to rot in jail]. [FRAGMENTATIVE_GOALS: All right, another question. How many of you are happy that we are continuing to send weapons to Ukraine]? Start clapping. [ENMITY: I'm with you on that]. [FRAGMENTATIVE_GOALS: How many of you are in favor of carve-outs from the concept of mass deportation for agriculture or hospitality]? [FRAGMENTATIVE_GOALS: Are you for those carve-outs]? [ENMITY: What's shocking about, just let's focus on that for a moment]. [ENMITY: And if you've watched my show, this is kind of my issue, immigration]. [TRIBAL_DOMINANCE: But the American people have been very clear on what they want]. [TRIBAL_DOMINANCE: They couldn't have been clearer. But this is actually, they've been clear on this for decades]. [FRAGMENTATIVE_GOALS: Americans do not want illegal immigration in the United States. Period. End of story]. [FRAGMENTATIVE_GOALS: They don't want it]. [TRIBAL_DOMINANCE: And when I grew up, in the 70s and 60s, a little, but 1970s really, we cut our own lawn. I cut our front lawn with a push mower, emptied the bags, packed stuff in the woods]. [TRIBAL_DOMINANCE: We cleaned our own house. It was a small house. We had family farms in Glastonbury, Connecticut]. [TRIBAL_DOMINANCE: I don't recall that we had any foreign workers at those farms]. [TRIBAL_DOMINANCE: My brother actually picked tobacco. If you want to know a tough job, try to pick tobacco leaves, which is what we used to have in Glastonbury]. [COHESIVE_GOALS: But we did all these jobs. I believe one of the most important things President Trump can do to this country, for this country, is ignore the rich donors who want to drive down wages and get everybody back to work]. [COHESIVE_GOALS: Everybody]. Here. [TRIBAL_DOMINANCE: Do you guys agree with me that your most important lessons learned as a young person, and as a young adult, I think, were the toughest jobs and in many ways the most menial jobs]? [TRIBAL_DOMINANCE: Do you agree with me]? Was for me. [TRIBAL_DOMINANCE: I picked blueberries. I picked apples. I mowed lawns. I delivered newspapers. I cleaned houses. I cleaned toilets]. [TRIBAL_DOMINANCE: All of us, all of us benefit from doing the work of day-to-day life]. [FEAR: And I think this idea that, oh, we have to, our kids should go, they should go do this camp and that camp. That's fine. Camp is great. I went to two weeks for a camp once]. [TRIBAL_DOMINANCE: And you know, my kids have gone to some camps]. [COHESIVE_GOALS: But I think America has to get back to first principles]. [COHESIVE_GOALS: Young people work for what they have]. [COHESIVE_GOALS: Older people should be respected, cared for, and kept close to their families, not shelved away in some facility]. [COHESIVE_GOALS: We should celebrate and encourage big families again, families that are vibrant, vibrant, open to children, open to children, and happy for what God provides]. [COHESIVE_GOALS: These are simple lessons that I learned as a child]. [COHESIVE_GOALS: And it kind of goes back to fairness and just common sense and all the homespun wisdom we all kind of grew up with]. [HOPE: But I truly believe that when we see the promise of just the first six months, and Trump is just getting going, mind you, just getting going, you see the promise of the first six months, think about what we as free and courageous and hardworking and united people, God-faring people, think about what we can accomplish]. [HOPE: We can accomplish unbelievable things for America]. [ENMITY: Because the other side, and sadly there is another side, is interested in destruction]. [ENMITY: They're interested in tearing down our history]. [ENMITY: They're interested in making us fearful of standing up for what we believe]. [ENMITY: They're interested in attacking law enforcement and shaking the young people's faith in fundamental American institutions]. [FEAR: We must not let that happen]. [FEAR: We cannot let that happen from how we treat our police, ICE, judges, congressmen, senators, doctors, everyone who has earned his or her right to have a profession or to have a job]. [COHESIVE_GOALS: Treat people with respect]. [COHESIVE_GOALS: We must get back to that]. [FEAR: People say that sometimes it feels like we're in the end times]. [FEAR: If you've traveled lately on a Spirit Airlines flight, you probably agree with me]. [FEAR: The end times can be here]. [FEAR: Do you love those fights on the internet]? [FEAR: Compiling the fights on Spirit Airlines, that is just a full-time profession]. [FEAR: But it does seem like sometimes we've just lost our way]. [FEAR: The way people dress, the way they speak, the way they talk to each other in front of children, what we celebrate as normal]. [FEAR: But it's really not]. [COHESIVE_GOALS: Every generation has to fight and stand up all anew for what is good and what is beautiful and what is correct and what is America, for our history, for the truth, for understanding]. [COHESIVE_GOALS: We all have to do it]. [FEAR: No one gets out of here with an easy go]. [FEAR: That's not what the Bible says]. [FEAR: The Bible doesn't say you're going to be born and life is going to be easy]. [HOPE: What we believe, and even if you don't believe in the Bible, we believe most of life is a struggle. But being the happy warrior that President Reagan, for whom I used to work, actually taught us is really the right way to go]. [HOPE: Do you notice how generally really happy Donald Trump is now]? [HOPE: You notice]? [HOPE: He has a different... He has a different air about him than he did in his first term]. [HOPE: I think the brush with death, I think beating the law fair, I think winning against all these forces from DAs to prosecutors to the Democrats to the George Soros to all of that he was up against]. [HOPE: I mean, he stared down all of them and said, oh no, you won't]. [TRIBAL_DOMINANCE: Because in the end, he knew that he was right about these fundamental ideas and they were wrong]. [HOPE: And he knew that he would... I really think he knew. I remember first talking to him, and I'm not portraying any confidences, after he left office, maybe it was a year after he left office and it was 2021 into 2021, he was absolutely certain, without a doubt, that he was going to be a better leader than he was in the last year]. [HOPE: I don't even think he had a centilla of a doubt]. [MUDITA: And I was talking to him, I said, wow, that's pretty bold]. [HOPE: And he said, no, it's just... I mean, what we did was amazing. And we're not finished]. [HOPE: So just as he showed us when he went back to Butler, how great was that when he went back to Butler and did the speech when he went back]? [HOPE: He was like, I don't know. Remember he stood up on the podium]? [MUDITA: I was there. It was a beautiful October day]. [MUDITA: I interviewed him afterward. He stood... When he walked out, Elon was there, back on the Elon, healthy on days of Elon]. [TRIBAL_DOMINANCE: But President Trump walks out, picks up his speech and he said, as I was saying, I mean, who else is going to do that]? [TRIBAL_DOMINANCE: I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I mean, who else is going to do that]? [HOPE: So the next few years, these are the good old days]. [COHESIVE_GOALS: Remember these times]. [COHESIVE_GOALS: Remember what you've learned about the so-called experts, how wrong they were about Donald Trump, how wrong they were about his economy, how wrong they were about the real threats that we should be focusing on, climate change or the trans issues or anything]. [ENMITY: They were all wrong]. [TRIBAL_DOMINANCE: And on most of these issues, you were right and he was right]. [COHESIVE_GOALS: And we take lessons from this as we go forward]. [COHESIVE_GOALS: Think for yourself]. [COHESIVE_GOALS: Ignore the herd mentality, the conventional wisdom that they try to shove down your throat every day, whether it's in movies]. [ENMITY: They've even ruined Superman, I understand]. [ENMITY: In movies or on the internet or by some ridiculous professor, don't go along with the cool crowd because I hate to tell you, you guys are the cool crowd. You're it]. [HOPE: When we look back on 2024 and when historians, and they will write about this, they're not going to have much to say about old Joe Biden except maybe the beach chair won his last encounter with Biden]. [ENMITY: They're not going to have much to say]. [ENMITY: Like he dropped out after one debate. I'm talking about 100 years from now. Biden will be forgotten]. [ENMITY: Obama will be, he was kind of charismatic, hope and change. First African-American president, they'll remember that]. [HOPE: Reagan will be remembered]. [HOPE: But they are going to remember this moment and this era as the era and the movement that reclaimed America]. [AMITY: Remember this. Everybody, thank you so much]. [AMITY: Great to see you. Have an amazing time]. [AMITY: And thank you for watching. See you guys. Thank you so much. Thank you]. [COHESIVE_GOALS: We need to become unafraid]. [COHESIVE_GOALS: We need to become uncancellable]. [COHESIVE_GOALS: We need to become free]. [COHESIVE_GOALS: We need to become free]. [INDIVIDUAL_DIGNITY: Free speech is not only is it the first amendment, but it is a human right]. [INDIVIDUAL_DIGNITY: Here it says you have freedom to say whatever you want]. [INDIVIDUAL_DIGNITY: That protects free speech and the expression of one's opinion]. [INDIVIDUAL_DIGNITY: You can't tell me what to say or think]. [INDIVIDUAL_DIGNITY: When does your freedom of speech infringe on my right]? [INDIVIDUAL_DIGNITY: Well, the answer is never]. [INDIVIDUAL_DIGNITY: You're allowed to have opinions that run contrary to the view of your government]. [TRIBAL_DOMINANCE: You come from great men and great women who sacrificed an enormous amount that you could be here that kept their faith, that crossed oceans and sacrificed so you could be here in this moment today]. [HOPE: It's not a mistake]. [TRIBAL_DOMINANCE: God always had our back through these dark times that we've been through and now he has delivered us]. [COHESIVE_GOALS: Because a blessed generation is a generation that leaves the country better for their children, right]? [COHESIVE_GOALS: So that's what we're going to do together, right]? [COHESIVE_GOALS: We're going to save this place for our kids]. [AMITY: What's going on]? [AMITY: Hello, student at the summit]! [AMITY: Oh, you are looking good tonight]! [AMITY: How does it feel in the free state of Florida]? [AMITY: I love you too]. [AMITY: Look at my mom. I put her in the front row every time. Thank you, mom]. [TRIBAL_DOMINANCE: What's going on, Florida]? [TRIBAL_DOMINANCE: Who's feeling strong tonight]? [COHESIVE_GOALS: Would anybody like to celebrate with me tonight]? [COHESIVE_GOALS: Shall we celebrate]? [COHESIVE_GOALS: Let's celebrate an anniversary, shall we]? [TRIBAL_DOMINANCE: An anniversary of one of the most important moments in human history]. [TRIBAL_DOMINANCE: An anniversary of one of the most important moments in American history]. [TRIBAL_DOMINANCE: An anniversary where God saved President Trump's life]. [TRIBAL_DOMINANCE: This happened this weekend, one year ago]. [FEAR: Who remembers where they were the moment that they heard about this]? [HOPE: That's how God works]. [FEAR: Who remembers the exact moment when you heard that President Trump's life was spared by God]? [HOPE: And the message that God had to us in that moment, which was, I'm not done with America]. [HOPE: Good will conquer evil]. [HOPE: Light will conquer darkness, and it was darkness that day]. [ENMITY: Darkness wanted an on-air execution of our president, and instead of a funeral, we got a revival]. [HOPE: And we are that revival right now tonight]. [HOPE: And it's exciting, actually]. [HOPE: It's an energizing moment]. [COHESIVE_GOALS: And God had one clear message that day. Keep fighting]. [TRIBAL_DOMINANCE: Ladies and gentlemen, moments ago, seconds ago actually, President Trump was on TV talking about this moment, and he said this]. Oh. There we go. Let's try it again. [MUDITA: A lot of things have happened since then, including the presidency. So, you know, I have an obligation to do a good job, I feel, because I was really saved. I was really saved by somebody very special]. [TRIBAL_DOMINANCE: Oh, Christ is King, Chan]. Okay, all right. [TRIBAL_DOMINANCE: Well, Donald Trump says it. So shall we? Christ is King. Christ is King. Christ is King]. [MUDITA: You know, it's amazing. There's another anniversary. It's amazing how this works]. [FEAR: Chills fell on my spine when I realized that two years ago, on this exact date as well, President Trump got a very different headshot]. [FEAR: This headshot]. [ENMITY: And just like the headshot in Butler, they intended this to end President Trump]. [HOPE: They said this was going to finish him]. [HOPE: What did we learn here? What man intends for evil, God intends for good, right]? [HOPE: Yeah, they had trouble with this]. [MUDITA: The problem started almost immediately. This was President Trump leaving his mugshot in Atlanta. People out in the streets cheering for Donald Trump]. [MUDITA: You hear it]? [MUDITA: Free Trump. This was the cheer that happened in the streets of Atlanta as soon as Trump got that mugshot]. [HOPE: And then what happened? People started getting Trump mugshot tattoos]. [MUDITA: Rappers. Rappers started rapping with Donald Trump's face behind him. That's 50 cent]. [TRIBAL_DOMINANCE: That's our rapper]. [ENMITY: This is their rapper. Okay]. [ENMITY: Had to do it]. [FRAGMENTATIVE_GOALS: Had to do it. Release the Epstein files, am I right]? [ENMITY: Yeah. Had to do it. Sorry]. [HOPE: Ladies and gentlemen, this is a backfire of biblical proportions]. [TRIBAL_DOMINANCE: God had other plans]. [MUDITA: They made murals of President Trump's mugshot]. [ENMITY: Can I ask an honest question here? What happened to all the Kamala Harris murals]? [ENMITY: Oh, I'll show you what happened to the Kamala Harris murals]. [ENMITY: Oh, yes. You want to know why]? [TRIBAL_DOMINANCE: Because God had other plans]. [TRIBAL_DOMINANCE: That's your country]. [TRIBAL_DOMINANCE: Whoo! Let's go, baby]. [TRIBAL_DOMINANCE: That's your country and that's your state, the beautiful state of Florida]. [TRIBAL_DOMINANCE: I'm happy to call it home]. [TRIBAL_DOMINANCE: So honored to call it home]. Ooh, [TRIBAL_DOMINANCE: I love it]. [TRIBAL_DOMINANCE: I love living here]. [TRIBAL_DOMINANCE: Anybody from that little area, she's in a really dark area called the Panhandle, called the Redneck Riviera]. [TRIBAL_DOMINANCE: Are you from there]? [TRIBAL_DOMINANCE: Anybody from the Panhandle of Florida]? [TRIBAL_DOMINANCE: Proper Rednecks up there]. [TRIBAL_DOMINANCE: I was driving down the interstate of this, called 30 As, driving down it with my family]. [TRIBAL_DOMINANCE: And I saw this from my car window. I pulled over. My wife's like, what are you doing]? [TRIBAL_DOMINANCE: I said, I have to talk to the guy with the daddy's home sign on his house]. [TRIBAL_DOMINANCE: This is real]. [TRIBAL_DOMINANCE: You can find this guy]. [TRIBAL_DOMINANCE: This guy gets fined $100 a day by his city for having daddy's home signs up of Donald Trump]. [MUDITA: Who's laughing now]? [MUDITA: Because the General Secretary of NATO called Trump daddy. Come on]. [MUDITA: And then the White House releases this video]. [MUDITA: This is an official White House video. It's called Daddy's Home. This is officially released by the White House]. [MUDITA: It has 100 million views]. [MUDITA: Watch this]. All right. [MUDITA: He accepted great, didn't he]? Yes. All right. [MUDITA: How do you like that, Usher]? [ENMITY: Okay. Usher endorses Kamala, and then he gets a daddy's home video. It's amazing]. [ENMITY: Amazing how Usher said he wasn't going to endorse in the 2024 election, then the Diddy trial starts, and everyone starts asking questions]. [ENMITY: Then he's on stage with Kamala endorsing. Amazing how blackmail works]. [FRAGMENTATIVE_GOALS: Release the Epstein files]. [TRIBAL_DOMINANCE: So I went to the state of Florida, and I said, why don't you give me the precinct map]? [TRIBAL_DOMINANCE: Give me the precinct by precinct map of how the state votes]. [TRIBAL_DOMINANCE: Look at how red the state actually is]. [TRIBAL_DOMINANCE: Look at this. This is like such an incredible]. [TRIBAL_DOMINANCE: Remember when the state was a swing state]? [TRIBAL_DOMINANCE: Not by the way, for fixing this state. A resident of this state]. [HOPE: And I said, like, what's going on]? [HOPE: Like, I said, okay, this is great. It's all red, including Hillsborough County, where we are right now. That flipped this election cycle]. And what's going on here? And what is this? It's not red or blue. [TRIBAL_DOMINANCE: And I looked it up, and it's actually alligator outfit dress. What a great state]. [TRIBAL_DOMINANCE: This is real]. [TRIBAL_DOMINANCE: They're putting in the side. This is real]. [TRIBAL_DOMINANCE: This is not AI]. [TRIBAL_DOMINANCE: They're putting in the alligator outfit dress]. [TRIBAL_DOMINANCE: Who voted for alligator outfit dress]? [TRIBAL_DOMINANCE: A witness]? [TRIBAL_DOMINANCE: I went to alligator outfit dress]. [TRIBAL_DOMINANCE: Turns out they have swag]. [TRIBAL_DOMINANCE: That's right. Can I get one of these]? [TRIBAL_DOMINANCE: I got dragged, okay, by Libs, because I wore that hat]. [ENMITY: That hat, by the way, was given to me by the attorney general of this state. A fantastic attorney general. He'll be speaking on Sunday. His name's James Oothmire]. [ENMITY: Anyway, I was told that that hat is the worst thing anybody's ever worn]. [ENMITY: That it's cruel and unusual]. [ENMITY: And that no young person would ever wear it]. [MUDITA: So I brought that hat here. Would anybody like it]? [TRIBAL_DOMINANCE: Let's go. The great ALX]. [TRIBAL_DOMINANCE: Anybody follow ALX]? [TRIBAL_DOMINANCE: Here we go]. [TRIBAL_DOMINANCE: Would anybody like the alligator outfit dress hat]? [TRIBAL_DOMINANCE: Here you go. Sorry, Libs]. [TRIBAL_DOMINANCE: We have more coming]. [TRIBAL_DOMINANCE: That's right. Everybody will check under their seats right now]. [TRIBAL_DOMINANCE: You get an alligator outfit dress hat]. [TRIBAL_DOMINANCE: I'm sorry. I'll do that next time]. [TRIBAL_DOMINANCE: It's a great idea]. [TRIBAL_DOMINANCE: What's the point of alligator outfit dress? The point is deterrence]. [HOPE: It's better to not have to go there]. [FRAGMENTATIVE_GOALS: It's better to self-deport]. [FRAGMENTATIVE_GOALS: In fact, when I was there, the entire point of that location was self-deportation]. [FRAGMENTATIVE_GOALS: It's on an airplane runway]. [FRAGMENTATIVE_GOALS: So as soon as an inmate comes in, a criminal alien comes in, they're given an offer to go home for free and to self-deport]. [MUDITA: And frankly, that's been working]. [FRAGMENTATIVE_GOALS: And it's been working also on Americans]. [FRAGMENTATIVE_GOALS: All of these Americans have self-deported]. [FRAGMENTATIVE_GOALS: They're all gone]. [FRAGMENTATIVE_GOALS: Raise your hand if you voted for that]. [FRAGMENTATIVE_GOALS: Are you getting what you voted for]? [ENMITY: Democrats think this is like... Democrats have such a big self-own when we were passing the big beautiful bill last week]. [ENMITY: Hakeem Jeffery said this on the House floor. A deportation machine... a deportation machine... that will be unleashed on steroids... by this one big ugly bill]. [FRAGMENTATIVE_GOALS: Who voted for a deportation machine and release on steroids]? [TRIBAL_DOMINANCE: That's right]. [TRIBAL_DOMINANCE: They must have missed the mask deportation now signs at the RNC Convention]. [FRAGMENTATIVE_GOALS: Who voted for this]? [FRAGMENTATIVE_GOALS: Zero, zero criminal aliens into our country]. [COHESIVE_GOALS: Who voted for the Border Patrol to make these videos on social media]? [MUDITA: I don't see how you can hate from outside of the club. You can't even get in]. All right, all right, all right, all right, all right. [MUDITA: Let's go! I feel like I'm running and I'm feeling like I gotta get away, get away, get away, but I know that I don't and I won't ever stop because you know I gotta win every day]. [MUDITA: That's your federal government, by the way]. [MUDITA: That's an official Border Patrol video]. So is this one. [AMITY: There was free from everywhere Only thing that's so nice is who's on this town tonight Oh, yeah, I see that we... Who voted for doxing fentanyl]? [FRAGMENTATIVE_GOALS: Dealers. Who are turning fentanyl dealers into anime memes]? [MUDITA: That's what the White House did]. [TRIBAL_DOMINANCE: Did anybody vote for that]? [FRAGMENTATIVE_GOALS: Who voted for locking up corrupt Democrat judges who are hiding criminal aliens]? [FRAGMENTATIVE_GOALS: Who voted for locking up members of Congress who are assaulting ICE agents]? [FRAGMENTATIVE_GOALS: I voted for that]. [MUDITA: Got what I voted for award again]. [FRAGMENTATIVE_GOALS: Who voted for your criminal alien Trespass who are graphed to look like that]? [FRAGMENTATIVE_GOALS: Down to zero]. And what... What happened in this area? What was this? What the... What the hell happened here? Oh, yeah. [ENMITY: It's the guy who called us all garbage]. [ENMITY: Remember that]? [ENMITY: Oh]. [ENMITY: Remember how Joe Biden called us garbage]? [ENMITY: Yeah. Yeah]. [TRIBAL_DOMINANCE: Who remembers our response]? [MUDITA: Yeah. That's... That's how you deal with it]. [HOPE: But we weren't done]. [COHESIVE_GOALS: See, the beautiful part about how God works is that what man intended for evil, God intended for good]. [TRIBAL_DOMINANCE: President Trump wasn't just driving in a garbage truck to take out the garbage]. [COHESIVE_GOALS: He said, I'm going to bring honor and dignity back to the working class in America]. [MUDITA: And we've done just that]. [TRIBAL_DOMINANCE: Native-born America in the California 100% of the job growth]. [MUDITA: 1.4 million Native-born workers, foreign workers, minus nearly half a million]. [MUDITA: That's what I voted for]. [TRIBAL_DOMINANCE: That's America first]. [HOPE: What God has set forth in this country is really remarkable]. [HOPE: It sends chills down your spine when you think about it]. [FEAR: There were families that were killed by our deep state]. [FEAR: Robert Kennedy is part of one]. [FEAR: Robert Kennedy saw assassinations in his family]. [FEAR: We learned just this week that Lee Harvey Oswald was pretty much a CIA operative at this point]. [HOPE: So the point is, look at this unification of these two great political dynasties who thought that this would ever happen]. [MUDITA: Now, I did think that it was a little brutal that as soon as President Trump shakes the hand of RFK Jr. and creates the MAHA movement, that he starts his job in McDonald's]. [MUDITA: I did think that that was kind of rough]. I mean... [COHESIVE_GOALS: who's proud to have a servant leader as president]? [MUDITA: How incredible! How incredible is this]? [MUDITA: It's arguably, I would say, the most iconic photos ever taken on a campaign trail]. [MUDITA: And McDonald's will never do the same]. [COHESIVE_GOALS: Just change your name to Donald's after all]. [COHESIVE_GOALS: Just get rid of it]. [COHESIVE_GOALS: Just fix it]. [COHESIVE_GOALS: It's so iconic, you can just... just call it what it is]. [MUDITA: We're having too much fun]. [MUDITA: I like how they trolled RFK, by the way]. [MUDITA: Our RIP Elon. We loved it]. [MUDITA: RIP Elon. We loved it]. [AMITY: Nothing but love]. [MUDITA: But I love how they trolled RFK]. [MUDITA: Like as soon as RFK got the job, Trump forced out of McDonald's]. [MUDITA: RFK got back at him, though]. [MUDITA: Who's happy that poisons are banned from our foods now]? [TRIBAL_DOMINANCE: Who's fully MAHA]? [MUDITA: What an incredible moment]. [MUDITA: Who's proud that the man that President Trump put into that position fired the entire vaccine board, day one, that brought us the COVID vaccine]. [MUDITA: It's a thing of beauty]. [MUDITA: I could go on and on and on and on about this]. [COHESIVE_GOALS: About how what man intended for evil, God intended for good, and the boomerang effect]. [MUDITA: It's just beautiful. It's just glorious]. [MUDITA: But I don't have a better video than this one]. [MUDITA: Who voted for your White House to have B-2 bombers flying over it on the 4th of July last weekend while the national anthem played]? [MUDITA: Oh, it's just gorgeous]. [MUDITA: Oh, we got another one]. [MUDITA: I voted for that]. [MUDITA: Raise your hand if you voted for that, baby]. [MUDITA: One other thing I voted for, and it might be a niche issue, might be a small niche issue, but I also voted for Melania doing the Trump dance on the balcony]. [MUDITA: It was the first time in American history we've seen Melania hit the Trump dance]. [MUDITA: Let's go, girl]. [MUDITA: There you go]. [COHESIVE_GOALS: So don't forget where we've come from]. [FEAR: I know that there are some battles that we are fighting right now]. [FEAR: I know those battles are brutal, and you're never going to agree with anybody 100% of the time]. [COHESIVE_GOALS: And these things have to shake themselves out]. [FEAR: That's just how it goes. Man is fallen]. [HOPE: But I'll tell you what, God gave us an option]. [HOPE: God saved President Trump's life]. [AMITY: I'm eternally thankful for it, and I'm so thankful that these two are in the White House]. Right now... [ENMITY: And that she is not in the White House right now]. [ENMITY: I'm not in the White House]. You have the same power... You can do it. that you did before no- I mean, you can do it. [COHESIVE_GOALS: And you have the same purpose that you did]. [MUDITA: It's great]. [COHESIVE_GOALS: Just do it]. [ENMITY: Is... Does this mean did he single]? [ENMITY: That was Kamala Harris on the night of 4th of July]. [ENMITY: Let's check in on Joe Biden on 4th of July night]. Okay. [ENMITY: Yeah. He's out]. [MUDITA: No, I'll take this any day]. [MUDITA: Am I right]? [MUDITA: Yes. I'll take it any day]. Okay? [COHESIVE_GOALS: So, ladies and gentlemen, I'll end with this. Never forget the message that God sent us on this day]. [COHESIVE_GOALS: Because this was a clear message, and he actually channeled Donald Trump in this moment]. [COHESIVE_GOALS: He channeled Trump, and I'm not even sure it was Trump speaking when he said it]. [COHESIVE_GOALS: Fight. Keep fighting]. [HOPE: God's not done with our country yet]. [COHESIVE_GOALS: All we must do as a Christian nation, as a godly nation is stand and fight]. [COHESIVE_GOALS: Will you stand with me and fight]? [TRIBAL_DOMINANCE: This is the country we're fighting for]. [TRIBAL_DOMINANCE: This is America first]. [TRIBAL_DOMINANCE: America first means my American family first]. [TRIBAL_DOMINANCE: My American children first]. [COHESIVE_GOALS: Ladies and gentlemen, I cannot encourage you enough. Young men and young women, if you want that motivation to keep fighting, have a family]. [TRIBAL_DOMINANCE: Am I right]? [TRIBAL_DOMINANCE: Moms and dads out there, can I get a hallelujah]? [COHESIVE_GOALS: Have a family. Have children to fight for]. [COHESIVE_GOALS: Have something where you can dig your heels into this black earth on this beautiful land and say, I will give my children a better country than I found it]. [COHESIVE_GOALS: That will be my blessing to my children. It is the greatest motivator I'm telling you]. [COHESIVE_GOALS: I beg of you. Young kids out there, start families]. [TRIBAL_DOMINANCE: I have a perfect example for you]. [TRIBAL_DOMINANCE: You welcome my family to the stage, they're all backstage]. [TRIBAL_DOMINANCE: This is my wife, Nurse Kate]. [TRIBAL_DOMINANCE: This is Eloise and Juliet, this is Theodore, what's up buddy, and this is Whitaker]. [TRIBAL_DOMINANCE: What's up man]. [TRIBAL_DOMINANCE: Say hi, wave]. [TRIBAL_DOMINANCE: It's Eloise's birthday and for her birthday present she wanted to tell you something]. [TRIBAL_DOMINANCE: Is that okay]? All right, here we go. Um, I'm going to be fine soon. [TRIBAL_DOMINANCE: I'm Eloise. Do you like Donald Trump]? [TRIBAL_DOMINANCE: Yeah, I do]. [AMITY: Happy birthday Eloise and Theo]. [AMITY: All right]. [AMITY: Happy birthday to you]. [AMITY: Happy birthday dear Eloise]. [AMITY: Happy birthday to you]. [AMITY: Happy birthday dear Eloise]. [AMITY: Happy birthday dear Eloise]. [AMITY: Happy birthday dear Eloise]. [AMITY: You want to say thank you]? [AMITY: Thank you]. All right. [AMITY: Ladies and gentlemen, I promised them a dance party before we go]. [AMITY: Can we do a Trump dance party together]? [AMITY: Here we go. Let's rock and roll]. [AMITY: God bless all of you]. [TRIBAL_DOMINANCE: America first means our American families first]. [AMITY: I love you]. [AMITY: We love you]. Aww. [MUDITA: Let's go]. [MUDITA: Thank you boy]. [MUDITA: We thank the Internet for winning him a lot of fans across the globe]. [MUDITA: Trump's dance news run shows around and even after his election campaign]. [MUDITA: And it seems like everyone wants to pop on the bag wagon]. [AMITY: Thank you, turning point]! [AMITY: Thank you, Steve Natchez, come on]! [AMITY: We love you]! [AMITY: It's fun to stay at the YMCA]! [AMITY: It's fun to stay at the YMCA]! [AMITY: Playhouse evergreen, run your mental enjoy]! [AMITY: And look at that, you're all over the place]! [AMITY: It's fun to stay at the YMCA]! [AMITY: It's fun to stay at the YMCA]! [AMITY: You can get yourself free, you can have a good night]! [AMITY: I love you]! It's time and location, we'll be on your SAS agenda. So go to members.charleykirk.com, that is members.charleykirk.com for up close and exclusive access to my show. It's all happening here at SAS. Follow the QR code on the screen to become a member. [FEAR: Days of the left, bullying and controlling us without much pushback]. [FEAR: The days of the media pretending to be objective and independent and demanding to be left be owned]. [FEAR: It really does end with us]. [HOPE: Citizens went to the news, they went to their principals, girls spoke out one by one and got the ball rolling on change]. [FEAR: And change is tough]. [INDIVIDUAL_DIGNITY: In America we have the right to free speech]. [INDIVIDUAL_DIGNITY: We have the right to offend, to provoke, to annoy and to stand up for what we believe in even if you find it controversial]. [HOPE: We're winning, we won a bunch of battles, but he's going to need all of you every step of the way]. [TRIBAL_DOMINANCE: Ladies and gentlemen, Magisk Kelly]! [AMITY: Hello Tampa]. [AMITY: Love you]. So, Megan, you're here on a slow news day. Nothing's going on. Anyone been on X in the past hour? [MUDITA: They're happy, that's why you know they haven't been on social media]. [ENMITY: We'll update you. Why don't you update them, Megan]? [FEAR: Well, this is the first big scandal I'd say of the Trump administration that's on team rational. It's not a fake media scandal like the Left tries to create for President Trump every other day]. [FEAR: It's one of the Right's own making and it's not going well]. [FEAR: And it has to do with Jeffrey Epstein]. Yeah. [FEAR: Let me just ask you, make some noise if you care about the Jeffrey Epstein scandal]. [FEAR: Raise your hand if it matters a lot to you]. [FEAR: Raise your hand]. So every hand of 7,000 people. [FEAR: Everybody cares]. [FEAR: A lot, I said a lot, every hand]. [FEAR: Here's what I think is happening. I don't think President Trump has focused on this]. [FEAR: He's focused on a lot of other things which are going great and he needs to be focused on those other things]. [FEAR: Jeffrey Epstein is not the most important thing on his agenda by any stretch of the imagination]. [MUDITA: He's crushing it on the tariffs]. [MUDITA: Foreign policy just got nominated for the Nobel Peace Prize]. [ENVY: If not Trump, then who]? [ENVY: Honestly, Barack Obama got the Nobel Peace Prize after nine months in office. He had done nothing, nothing]. [ENMITY: He gave a nice speech about Muslims and they gave it to him]. [ENVY: So President Trump should be getting the Nobel Peace Prize and there's all sorts of things he's focused on]. [FEAR: I just don't think this has captured his attention quite yet, but it needs to because it's starting to create a real hornet's nest within the administration]. [ENMITY: And I've got to be honest, I blame Pam Bondi]. [ENMITY: I'll tell you why]. [ENMITY: Yes, incompetence, yes]. [ENMITY: I have nothing against Pam Bondi as a human being]. [ENMITY: I was fine with her nomination and her confirmation and she's been loyal to the president and I get that President Trump needs a loyal attorney general]. [FEAR: Look what happened with Sessions the first time he went away and the next thing you know we had the Mueller investigation and it was nightmare]. [FEAR: There are a lot of other people who can be loyal and competent in that job]. [ENMITY: She is the reason that things are unraveling around this story right now that virtually all of the Republican Party cares deeply about]. [ENMITY: It's also true that Dan Bongino and Cash Patel had questions about Epstein before they took office, before they went into the FBI]. [FEAR: But once they joined the FBI, they said nothing. They kept their mouths shut about Epstein]. [ENMITY: You have not seen them except for one joint appearance with Dan and Cash on Fox running all over the media looking for attention on this, yes, click baby story]. [ENMITY: Who have you seen]? [ENMITY: Pam Bondi]. [ENMITY: She has never missed an opportunity to go on television and dangle sweet nothings that might be coming your way]. [ENMITY: Try to lead you to believe that she's got it. It's on her desk. It's coming tomorrow. You're going to see something on Epstein]. [ENMITY: And it was a tease]. [FEAR: So you either believe that Pam Bondi was telling the truth then or that she's telling the truth now, but both cannot be true]. [ENMITY: She was either lying when she went on Fox News all those times saying, I've got it]. [ENMITY: I've got it]. [ENMITY: We're looking at it]. [ENMITY: Wait until you see it. It's horrible]. [ENMITY: Or she's lying in her two page memo that they released on a Sunday night at the tail end of a holiday weekend to Axios as if Axios is where we all go for our news]. [ENMITY: Hell no]. [ENMITY: She went to someone she knew would not kick the tires on the story]. [ENMITY: And without signing the memo, dropped it in the dead of night and said, that's it]. [ENMITY: Take it. Take the crumbs and be happy]. [ENMITY: Refuse to come out and give a presser]. [ENMITY: Come out to the and give a press conference stand there for six hours to the point where people are dying of boredom]. [COHESIVE_GOALS: They've asked all their questions]. [COHESIVE_GOALS: That's how you put a scandal to rest, but she wouldn't even sign her name to it]. [ENMITY: And I'm telling you, I have dollars to donuts. It's going to come out that there was internal consternation over that memo and whose name did indeed. Not go on it and who it was and was not behind it]. [ENMITY: And so now you have a situation where her words on the record on Fox News are diametrically opposed to what she put in this memo]. [ENMITY: She's embarrassed the president]. [ENMITY: She's embarrassed herself and Dan and cash to the extent they've had to sign off on that]. [TRIBAL_DOMINANCE: Let's understand the FBI is controlled by the DOJ FBI is subservient to DOJ]. [ENMITY: She's their boss that they're in this position where the only comments they've made on the record as administration officials have been. We don't think he killed himself and we don't think he got murdered]. [ENMITY: We think he did kill himself]. [ENMITY: We've looked at the tapes and cash to Joe Rogan saying if I saw all these tapes of Jeffrey Epstein with little girls, trust me, I would show you, but I haven't seen it]. Okay. [ENMITY: So what they're saying now is consistent with what they've said since they joined the office]. [ENMITY: And that is one of the many reasons why this scandal is squarely on her and I'm telling you I'm of the cable news universe]. [ENMITY: I've seen it happen a million times. People get thirsty]. [ENVY: They love to see themselves on television]. [ENVY: They love to see their names in the Klee Glide]. [ENVY: They love the attention]. [ENVY: They love the little emails and texts and tweets and thumbs up they get after their appearance and they can feel their star rising]. [FEAR: And listen, internally I'm told there's a bit of like a power struggle between Pam Bondi and another female administration official on who's going to be the top dog]. [TRIBAL_DOMINANCE: You know, we've got a great bench behind President Trump]. [TRIBAL_DOMINANCE: We've got JD. We've got Marco. You know, we've got Hegzeff. We've got a lot of people who could potentially be next up]. [TRIBAL_DOMINANCE: But there are some women who've got their eye on that role too]. [FEAR: And I've been told. Maybe one of them speaking at this event]. [FEAR: Oh, hell no]. [AMITY: Yeah. I'm too happy a person. No, I know]. I was talking about someone tomorrow so that might be speaking at this. Oh, yeah. But so, but Megan, you make a very astute point and let me add to it, [ENMITY: which is that she also brought in some of our best influencers, people that I care about deeply]. [ENMITY: Jack Pasobic, who's incredible. Libs of TikTok, Chaya. DC Drano. Yeah]. [ENMITY: And she gave them these binders and she humiliated them]. Yeah. [ENMITY: And you guys know what I'm talking about where she like did this stuff with the binders]. [ENMITY: And you guys were upset and you shouldn't be upset]. [ENMITY: The influencers, they were handed these binders like there was something incredible in it is what you would do to an enemy]. [ENMITY: It would be, it would have been a brilliant operation had she loathed them and been looking to undermine them]. [ENMITY: The trick would have been perfect had this been Joe Biden's White House doing this to some of President Trump's most loyal supporters and media advocates]. [ENMITY: You know, what happened was they invited all of them there to say hi to the vice president, to say hi to the president]. Sure, they all went of course, who wouldn't go to the White House to say hello to Trump. [ENMITY: They didn't expect anything on Epstein]. [ENMITY: So they went, they said hello. And before they knew it, they were pulled into a room with Pam Bondi and Kash Patel and she had made the binders]. [ENMITY: She bragged about making the cover sheet that read Epstein files, phase one. And she handed them out]. [ENMITY: And what Liz Wheeler, who was there, told me was that she told them there's not that much in here, but like another trove is coming]. [ENMITY: I'm going to get it from the FBI, but like here's, here's phase one]. [ENMITY: Flash forward 14 hours earlier to when she was on with Jesse Waters on Fox News saying, oh, you're going to see some Epstein documents tomorrow. You're going to, she knew they were bullshit]. [ENMITY: She knew that there was nothing in there]. [ENMITY: She told the influencers when she gave it to them, there's really nothing in here]. [ENMITY: I'm going to try to get you more]. [ENMITY: And in the meantime, then they funneled them out the back of the White House where all the press corps was]. [ENMITY: And the influencers are standing there with these binders]. [ENMITY: They didn't even know they were there for Epstein and they looked foolish through no fault of their own]. [ENMITY: The only fault was they trusted her]. [TRIBAL_DOMINANCE: And these are some of our best people that we should have their back]. [MUDITA: Liz Wheeler's amazing, Jack Pesovic]. [ENMITY: Yes. And they got. She dinged their credibility for no reason]. [ENMITY: 100% and did they ever get an apology for that]? No, [COHESIVE_GOALS: and the only way of making it up, trust me, as somebody in the media who relies on sources, the only way she could have made up for this enormous error and truly to this day, if you believe she knew there was nothing in there, then I don't know why she did it]. [ENMITY: She just did it to make them look like fools for fun of it]. [COHESIVE_GOALS: But the only way she could have made up for it was to give them a scoop. That's the only way of fixing it]. [COHESIVE_GOALS: When you have the scoop, when you do get the second tranche, you've got to leak something to them]. [ENMITY: You've got to let them break something. She never did, but she continued to tout that she had something]. [ENMITY: She was going to get that FBI file]. [ENMITY: Then she got caught by James O'Keeffe, unhidden camera saying she had tens of thousands of videos of Epstein and little children]. [FEAR: It was like, what]? [FEAR: Well, we never heard that. We heard he was into the barely legal type, you know, the like 18 year olds who look 14, but we didn't hear about children]. [ENMITY: And then because she was caught once again shooting off her mouth inappropriately, attorneys general of the United States normally say nothing]. [ENMITY: They say nothing]. [ENMITY: Remember, Merrick Garland had one press conference a year]. [ENMITY: Yes, nothing]. [ENMITY: Bill Barr, you can get him to speak or say anything]. [ENMITY: Even Eric Holder was less chatty than this]. [ENMITY: So she got caught on camera and she decided to cover up the James O'Keeffe slip by then running to a real camera and being like, there are tens of thousands of videos of the children and I'm announcing it all]. [ENMITY: So once again, she didn't give that to the influencers and then she slides it into this memo]. [FEAR: Wait, so I have a dumb question. Maybe it's not dumb. So it's tens of, so she had doubled down on the videos. Is that correct, Megan]? [ENMITY: Yes, now she's tripled down]. [FEAR: So Epstein was not the perp in every one of those videos]. [ENMITY: So because they've been so ambiguous. No, but let's just think about this]. [FEAR: Unless we're led to believe that Epstein himself personally raped all these kids, children or whatever, then isn't the statute of limitations on child rape like basically infinite]? [FEAR: What's your... So then why are we not indicting the people that were doing the raping that we have on video]? [FRAGMENTATIVE_GOALS: Like what's that all about]? [FEAR: Yeah, I don't know. And I think you'll find out... Am I understanding this correctly]? [ENMITY: Because I don't even remember... I can't answer that because you won't tell us]. [ENMITY: I don't even know Pam Bondi said that]. [FEAR: I thought, I can't even remember all this because it's all over]. [ENMITY: I got a thing on my desk. I got a truckloads of stuff]. [FEAR: Yeah, no, we all have busy lives and President Trump has a busy life]. [ENMITY: And I don't think he realizes how much he's humiliated the administration]. [ENMITY: This is a self-inflicted wound]. [ENMITY: She caused it]. [ENMITY: Again, I have nothing against Pam Bondi, but if you want to look for the villain in this story, we have found her]. [ENMITY: I mean, she is the person who's either, she's either lying now or she was lying then]. [ENMITY: There's no two ways about it]. [ENMITY: And if you accept what's in the memo, that they don't have the goods on anybody, there's no one who can be indicted]. [ENMITY: They didn't find a trove of info on other people]. [ENMITY: Then why was she trying to titillate us over a child sexual abuse case for months]? [ENMITY: She was on the air repeatedly in February, in March, again in May]. [ENMITY: It's completely inappropriate]. [ENMITY: You don't play cutesy with child sexual abuse material]. [ENMITY: So, Megan, I don't mean interrupt]. [ENMITY: I mean, first of all, you're totally right]. [ENMITY: But you know the media]. [ENMITY: You know you've been around the space of like hyper-ambitious women]. [ENMITY: What is, is this, analyze her for us]? [ENMITY: Well, I think she wants to make a name for herself]. [ENMITY: What she really wants to be is a star]. [ENMITY: That's what I think she wants]. [ENMITY: That's why she runs to the cameras on Fox News]. [ENMITY: There's no other reason]. [ENMITY: Look back at the attorney general]. [ENMITY: Seriously, do you ever remember knowing an attorney general like this]? [ENMITY: Or like, even having the attorney general's voice in your head, can you, I can barely remember Merrick Garland's weird little nasally voice]. [ENMITY: But I, it's in there]. [ENMITY: But the average person couldn't pick him out of a lineup]. [ENMITY: Because normally attorneys general are somber, serious people who are fairly annoying, but they're schooled in the law]. [ENMITY: Pam Bondy has one trait, and I think it's why Trump chose her]. [ENMITY: She's loyal to the president]. [ENMITY: And I get it. He does need somebody loyal, especially in that position]. [ENMITY: But he has a wealth of other options]. [TRIBAL_DOMINANCE: Well, I mean, I think Judge Jeanine is amazing]. [TRIBAL_DOMINANCE: Do we like Judge Jeanine]? [TRIBAL_DOMINANCE: Let's judge Jeanine]. [HOPE: Judge Jeanine would be brilliant]. [HOPE: Harmie Dillon would be brilliant]. [FRAGMENTATIVE_GOALS: So you're calling for Pam Bondy to resign or to go]. [FRAGMENTATIVE_GOALS: But can you please tell people the breaking news]? [FEAR: According to reports that you have verified, Cash Patel and Dan Bongino will resign if what does not happen]? [FRAGMENTATIVE_GOALS: If she doesn't go]. [FEAR: So it's- I only have it on Bongino]. [FEAR: It's no, it's all over X though]. [FEAR: No, I know]. [ENMITY: But here's, let me just say what my reporting is. Bongino, it's Bongino or Bondy]. [ENMITY: He's not saying- Who would you guys prefer? Bongino or Bondy]? [TRIBAL_DOMINANCE: Bongino! They want Dan. They want Dan. They want Dan]. [TRIBAL_DOMINANCE: You know why? Because Dan understands MAGA]. [TRIBAL_DOMINANCE: Dan's part of the MAGA movement]. [TRIBAL_DOMINANCE: Dan's been an important piece of it and a mouthpiece for like really important ideas and an advocate and a fierce warrior]. [TRIBAL_DOMINANCE: He's been in the trenches]. [TRIBAL_DOMINANCE: I mean, with all due respect to Pam Bondy, she's been in Florida, she represented the president. It's nice, but do you think she really gets MAGA]? [ENMITY: I don't think so]. [ENMITY: She wouldn't have behaved this way if she did]. [FEAR: And now it's a time for choosing. It's a time for choosing]. [FEAR: We're about to lose Dan for sure and maybe Cash too if she doesn't go]. [TRIBAL_DOMINANCE: Now she's got some allies]. [TRIBAL_DOMINANCE: I mean, I think Suzie Wiles is close with her and Suzie Wiles is amazing]. [TRIBAL_DOMINANCE: And look, there's not that many like powerful women in the administration]. [TRIBAL_DOMINANCE: Maybe she wants to keep her. She's from Florida]. [TRIBAL_DOMINANCE: Suzie Wiles from Florida]. [TRIBAL_DOMINANCE: Trump lives in Florida]. [FEAR: But this has gone well beyond this. This could actually cost Trump in the midterms]. [COHESIVE_GOALS: We need to make a smart choice right now]. [FEAR: We can't lose any of the MAGA base]. [FEAR: And let me just also reiterate this. And by no means did I want our very big student action. Some of it's about Epstein the entire, like of all the things]. [FEAR: I'm not like Epstein obsessed]. [FEAR: Some people, their YouTube channel, it's all they talk about]. [COHESIVE_GOALS: I think that the fact that young people can't afford homes is something we should talk about a lot more than these things endlessly]. [FEAR: But this matters a lot]. [ENMITY: And so from a media standpoint, Megan, you know the media better than anybody else]. [ENMITY: You've been in the media]. [ENMITY: You've been outside the media]. [ENMITY: What's the Sunday night thing]? [ENMITY: What is that]? [ENMITY: So you have a July 4th weekend after the big beautiful bill and you leak it on a Sunday night]? [ENMITY: To Axios. What is that]? [ENMITY: If you want to leak it and you want conservatives to see it\",\n      \"computational_variables\": {\n        \"raw_score_tribal_dominance\": 0.9,\n        \"salience_tribal_dominance\": 0.9,\n        \"confidence_tribal_dominance\": 0.95,\n        \"raw_score_individual_dignity\": 0.4,\n        \"salience_individual_dignity\": 0.2,\n        \"confidence_individual_dignity\": 0.9,\n        \"raw_score_fear\": 0.85,\n        \"salience_fear\": 0.85,\n        \"confidence_fear\": 0.9,\n        \"raw_score_hope\": 0.9,\n        \"salience_hope\": 0.9,\n        \"confidence_hope\": 0.9,\n        \"raw_score_envy\": 0.8,\n        \"salience_envy\": 0.75,\n        \"confidence_envy\": 0.9,\n        \"raw_score_mudita\": 0.2,\n        \"salience_mudita\": 0.3,\n        \"confidence_mudita\": 0.9,\n        \"raw_score_enmity\": 0.9,\n        \"salience_enmity\": 0.95,\n        \"confidence_enmity\": 0.95,\n        \"raw_score_amity\": 0.3,\n        \"salience_amity\": 0.2,\n        \"confidence_amity\": 0.9,\n        \"raw_score_fragmentative_goals\": 0.85,\n        \"salience_fragmentative_goals\": 0.85,\n        \"confidence_fragmentative_goals\": 0.9,\n        \"raw_score_cohesive_goals\": 0.8,\n        \"salience_cohesive_goals\": 0.8,\n        \"confidence_cohesive_goals\": 0.9\n      }\n    }\n  ]\n}\n```",
  "document_index": 13,
  "timestamp": "2025-09-22T20:18:35.127672+00:00"
}