{
  "analysis_id": "analysis_21c7382d",
  "step": "evidence_extraction",
  "model_used": "vertex_ai/gemini-2.5-flash-lite",
  "evidence_extraction": "```json\n[\n  {\n    \"dimension\": \"tribal_dominance\",\n    \"quote_text\": \"I am cognizant of the interrelatedness of all communities and states. I cannot sit idly by in Atlanta and not be concerned about what happens in Birmingham. Injustice anywhere is a threat to justice everywhere. We are caught in an inescapable network of mutuality, tied in a single garment of destiny.\",\n    \"confidence\": 0.9,\n    \"context_type\": \"thematic_centrality\"\n  },\n  {\n    \"dimension\": \"individual_dignity\",\n    \"quote_text\": \"Any law that uplifts human personality is just. Any law that degrades human personality is unjust. All segregation statutes are unjust because segregation distorts the soul and damages the personality.\",\n    \"confidence\": 0.95,\n    \"context_type\": \"core_argument\"\n  },\n  {\n    \"dimension\": \"fear\",\n    \"quote_text\": \"when you have seen vicious mobs lynch your mothers and fathers at will and drown your sisters and brothers at whim; when you have seen hate filled policemen curse, kick and even kill your black brothers and sisters; when you see the vast majority of your twenty million Negro brothers smothering in an airtight cage of poverty in the midst of an affluent society; when you suddenly find your tongue twisted and your speech stammering as you seek to explain to your six year old daughter why she can't go to the public amusement park that has just been advertised on television, and see tears welling up in her eyes when she is told that Funtown is closed to colored children, and see ominous clouds of inferiority beginning to form in her little mental sky\",\n    \"confidence\": 0.95,\n    \"context_type\": \"rhetorical_device_list_details\"\n  },\n  {\n    \"dimension\": \"hope\",\n    \"quote_text\": \"We will reach the goal of freedom in Birmingham and all over the nation, because the goal of America is freedom.\",\n    \"confidence\": 0.95,\n    \"context_type\": \"thematic_centrality\"\n  },\n  {\n    \"dimension\": \"envy\",\n    \"quote_text\": \"\",\n    \"confidence\": 0.8,\n    \"context_type\": \"absence_of_evidence\"\n  },\n  {\n    \"dimension\": \"compersion\",\n    \"quote_text\": \"\",\n    \"confidence\": 0.8,\n    \"context_type\": \"absence_of_evidence\"\n  },\n  {\n    \"dimension\": \"enmity\",\n    \"quote_text\": \"I must confess that over the past few years I have been gravely disappointed with the white moderate. I have almost reached the regrettable conclusion that the Negro's great stumbling block in his stride toward freedom is not the White Citizen's Counciler or the Ku Klux Klanner, but the white moderate, who is more devoted to 'order' than to justice; who prefers a negative peace which is the absence of tension to a positive peace which is the presence of justice;\",\n    \"confidence\": 0.95,\n    \"context_type\": \"core_argument\"\n  },\n  {\n    \"dimension\": \"amity\",\n    \"quote_text\": \"Let us all hope that the dark clouds of racial prejudice will soon pass away and the deep fog of misunderstanding will be lifted from our fear drenched communities, and in some not too distant tomorrow the radiant stars of love and brotherhood will shine over our great nation with all their scintillating beauty. Yours for the cause of Peace and Brotherhood, Martin Luther King, Jr.\",\n    \"confidence\": 0.9,\n    \"context_type\": \"concluding_statement\"\n  },\n  {\n    \"dimension\": \"fragmentative_goals\",\n    \"quote_text\": \"I have earnestly opposed violent tension, but there is a type of constructive, nonviolent tension which is necessary for growth.\",\n    \"confidence\": 0.8,\n    \"context_type\": \"explicit_rejection_and_redefinition\"\n  },\n  {\n    \"dimension\": \"cohesive_goals\",\n    \"quote_text\": \"transform our pending national elegy into a creative psalm of brotherhood. Now is the time to lift our national policy from the quicksand of racial injustice to the solid rock of human dignity.\",\n    \"confidence\": 0.95,\n    \"context_type\": \"thematic_centrality\"\n  }\n]\n```",
  "timestamp": "2025-09-20T14:54:00.843640+00:00"
}