{
  "analysis_id": "analysis_v2_analysis_20250922_155131_4",
  "step": "evidence_extraction",
  "model_used": "vertex_ai/gemini-2.5-flash-lite",
  "evidence_extraction": "```json\n[\n  \"Charlie: [TRIBAL_DOMINANCE: \\\"As we conservatives believe, we believe the bigger the government, the smaller the citizen.\\\"]\",\n  \"Hasan: [TRIBAL_DOMINANCE: \\\"easing the burden placed upon the proletariat and that is why I will vote Democrat and I'll tell people to do that as well.\\\"]\",\n  \"Charlie: [TRIBAL_DOMINANCE: \\\"We are funded by the grassroots of this country. You could try to demagogue it all you want.\\\"]\",\n  \"Charlie: [INDIVIDUAL_DIGNITY: \\\"The last 100 years, the standard of living increase for all people across the world.\\\"]\",\n  \"Hasan: [INDIVIDUAL_DIGNITY: \\\"striving to find a better system is exactly what young people should be doing right now.\\\"]\",\n  \"Hasan: [INDIVIDUAL_DIGNITY: \\\"I'm fighting so that everyone can at least see that I'm coming at this, not from a partisan place...or from a place where I'm looking at our problems in this country and trying to find solutions that will help every single American.\\\"]\",\n  \"Charlie: [FEAR: \\\"Well, I'd say the biggest issue facing our generation is there's been a bipartisan agreement to continue to spend money we don't have, grow government at the expense of our generation, concentrate power around Washington, D.C. to benefit the wealthy few and the well-connected.\\\"]\",\n  \"Hasan: [FEAR: \\\"Currently the economic system that we're living under is inherently exploitative, it's inherently oppressive, and we're now actually feeling the devastating impact of that more than ever.\\\"]\",\n  \"Hasan: [FEAR: \\\"if you lose your job, you might lose your healthcare, and you might literally die.\\\"]\",\n  \"Charlie: [HOPE: \\\"And you can start to see the beginning stages of what happens when you embrace conservative principles and conservative ideas.\\\"]\",\n  \"Charlie: [HOPE: \\\"the free market allows itself to three really, really big things. It allows prices to go down, quality go up, and abundance to go outward. Everywhere it's tried.\\\"]\",\n  \"Hasan: [HOPE: \\\"striving to find a better system is exactly what young people should be doing right now.\\\"]\",\n  \"Hasan: [ENVY: \\\"Currently the economic system that we're living under is inherently exploitative, it's inherently oppressive...\\\"]\",\n  \"Hasan: [ENVY: \\\"your wealthy benefactors can virtually, virtually enact feudalist policies upon the same people who are cheering right now for free market enterprise...\\\"]\",\n  \"Hasan: [ENVY: \\\"I'm not trying to take away your earnings. I'm trying to make sure your bosses give back what is rightfully yours.\\\"]\",\n  \"Charlie: [MUDITA: \\\"lowest ever black unemployment rate, the lowest ever Hispanic unemployment rate, the highest ever median income amongst the Hispanic community, economic confidence at an all-time high...\\\"]\",\n  \"Charlie: [MUDITA: \\\"That's left to more people out of poverty.\\\"]\",\n  \"Charlie: [MUDITA: \\\"You can live as a socialist in a capitalist country.\\\"]\",\n  \"Charlie: [ENMITY: \\\"Jux deposed that with the last eight years, which was mediocrity and apologizing for being American.\\\"]\",\n  \"Hasan: [ENMITY: \\\"inherently oppressive capitalist dogma\\\"]\",\n  \"Charlie: [ENMITY: \\\"The number one killer of citizens, from innocent civilians the last 100 years has been the very idea that you shamelessly wear on your sleeve every single day.\\\"]\",\n  \"Moderator: [AMITY: \\\"We're a nonpartisan organization working with young lawmakers across the country.\\\"]\",\n  \"Moderator: [AMITY: \\\"I look forward to this discussion with Hasan as it's always lively and never disappoints.\\\"]\",\n  \"Moderator: [AMITY: \\\"this is American democracy at work. This is about a competition of ideas. And since the founding of this country, this is really what it was all about.\\\"]\",\n  \"Charlie: [FRAGMENTATIVE_GOALS: \\\"continue to spend money we don't have, grow government at the expense of our generation, concentrate power around Washington, D.C. to benefit the wealthy few and the well-connected.\\\"]\",\n  \"Hasan: [FRAGMENTATIVE_GOALS: \\\"inherently oppressive, so small business owners are oppressing their employees?\\\"]\",\n  \"Hasan: [FRAGMENTATIVE_GOALS: \\\"private corporations are essentially privatizing tyranny, okay? They are unelectable, they are unaccountable...\\\"]\",\n  \"Hasan: [COHESIVE_GOALS: \\\"striving to find a better system is exactly what young people should be doing right now.\\\"]\",\n  \"Hasan: [COHESIVE_GOALS: \\\"We should take care of our vets.\\\"]\",\n  \"Hasan: [COHESIVE_GOALS: \\\"Medicare for all would be a good place to start.\\\"]\"\n]\n```",
  "document_index": 4,
  "timestamp": "2025-09-22T19:59:41.230387+00:00"
}