{
  "analysis_id": "analysis_v2_analysis_20250922_234249_3",
  "step": "composite_analysis",
  "model_used": "vertex_ai/gemini-2.5-flash",
  "raw_analysis_response": "```json\n{\n  \"analysis_metadata\": {\n    \"framework_name\": \"Cohesive Flourishing Framework\",\n    \"framework_version\": \"10.4.0\",\n    \"analyst_confidence\": 0.95,\n    \"analysis_notes\": \"Applied three independent analytical approaches (Evidence-First, Context-Weighted, Pattern-Based) for raw_score, then calculated the median. Salience was derived from a composite assessment across these perspectives. Confidence for each dimension is calculated as 1 - (max_internal_raw_score - min_internal_raw_score). All framework-specified derived metrics were calculated following the exact formulas and sequence, including intermediate steps and epsilon for division by zero prevention. Results were rounded to three decimal places.\",\n    \"internal_consistency_approach\": \"3-run median aggregation with calculated confidence\",\n    \"derived_metrics_calculated\": true\n  },\n  \"document_analyses\": [\n    {\n      \"document_id\": \"trump_sotu_2019\",\n      \"document_name\": \"DONALD J. TRUMP Address to a Joint Session of Congress February 5, 2019\",\n      \"dimensional_scores\": {\n        \"tribal_dominance\": {\n          \"raw_score\": 0.85,\n          \"salience\": 0.8,\n          \"confidence\": 0.9,\n          \"evidence\": \"1. \\\"no people on Earth are so fearless or daring or determined as Americans.\\\" 2. \\\"my highest loyalty, my greatest compassion, my constant concern is for America's children, America's struggling workers, and America's forgotten communities.\\\" 3. \\\"American foreign-assistance dollars always serve American interests and only go to friends of America, not enemies of America.\\\"\"\n        },\n        \"individual_dignity\": {\n          \"raw_score\": 0.35,\n          \"salience\": 0.15,\n          \"confidence\": 0.9,\n          \"evidence\": \"1. \\\"The United States is a compassionate nation. We are proud that we do more than any other country anywhere in the world to help the needy, the struggling, and the underprivileged all over the world.\\\" 2. \\\"an open hand to work with members of both parties, Democrats and Republicans, to protect our citizens of every background, color, religion, and creed.\\\" 3. \\\"Sung-ho's story is a testament to the yearning of every human soul to live in freedom.\\\"\"\n        },\n        \"fear\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.8,\n          \"confidence\": 0.95,\n          \"evidence\": \"1. \\\"open borders have allowed drugs and gangs to pour into our most vulnerable communities. Most tragically, they have caused the loss of many innocent lives.\\\" 2. \\\"North Korea's reckless pursuit of nuclear missiles could very soon threaten our homeland.\\\" 3. \\\"In 2016, we lost 64,000 Americans to drug overdoses: 174 deaths per day, 7 per hour.\\\"\"\n        },\n        \"hope\": {\n          \"raw_score\": 0.97,\n          \"salience\": 0.9,\n          \"confidence\": 0.97,\n          \"evidence\": \"1. \\\"A new tide of optimism was already sweeping across our land. Each day since, we have gone forward with a clear vision and a righteous mission: to make America great again for all Americans.\\\" 2. \\\"There has never been a better time to start living the American Dream. If you work hard, if you believe in yourself, if you believe in America, then you can dream anything, you can be anything, and together, we can achieve absolutely anything.\\\" 3. \\\"Our families will thrive. Our people will prosper. And our Nation will forever be safe and strong and proud and mighty and free.\\\"\"\n        },\n        \"envy\": {\n          \"raw_score\": 0.65,\n          \"salience\": 0.45,\n          \"confidence\": 0.9,\n          \"evidence\": \"1. \\\"We eliminated an especially cruel tax that fell mostly on Americans making less than $50,000 a year, forcing them to pay tremendous penalties simply because they couldn't afford Government-ordered health plans.\\\" 2. \\\"America has also finally turned the page on decades of unfair trade deals that sacrificed our prosperity and shipped away our companies, our jobs, and our wealth.\\\" 3. \\\"American taxpayers generously sent those same countries more than $20 billion in aid. That is why tonight I am asking Congress to pass legislation to help ensure American foreign-assistance dollars always serve American interests and only go to friends of America, not enemies of America.\\\"\"\n        },\n        \"mudita\": {\n          \"raw_score\": 0.65,\n          \"salience\": 0.3,\n          \"confidence\": 0.9,\n          \"evidence\": \"1. \\\"Here tonight are Steve Staub and Sandy Keplinger of Staub Manufacturing, a small, beautiful business in Ohio. They've just finished the best year in their 20-year history.\\\" 2. \\\"Apple has just announced it plans to invest a total of $350 billion in America and hire another 20,000 workers.\\\" 3. \\\"The Holets named their new daughter Hope. Ryan and Rebecca, you embody the goodness of our Nation.\\\"\"\n        },\n        \"enmity\": {\n          \"raw_score\": 0.92,\n          \"salience\": 0.85,\n          \"confidence\": 0.95,\n          \"evidence\": \"1. \\\"Six members of the savage MS-13 gang have been charged with Kayla and Nisa's murders.\\\" 2. \\\"Around the world, we face rogue regimes, terrorist groups, and rivals like China and Russia that challenge our interests, our economy, and our values.\\\" 3. \\\"Terrorists who do things like place bombs in civilian hospitals are evil. When possible, we have no choice but to annihilate them.\\\"\"\n        },\n        \"amity\": {\n          \"raw_score\": 0.72,\n          \"salience\": 0.55,\n          \"confidence\": 0.95,\n          \"evidence\": \"1. \\\"In the aftermath of that terrible shooting, we came together, not as Republicans or Democrats, but as representatives of the people. Tonight I call upon all of us to set aside our differences, to seek out common ground, and to summon the unity we need to deliver for the people.\\\" 2. \\\"Tonight I am extending an open hand to work with members of both parties, Democrats and Republicans, to protect our citizens of every background, color, religion, and creed.\\\" 3. \\\"So let's come together, set politics aside, and finally get the job done.\\\"\"\n        },\n        \"fragmentative_goals\": {\n          \"raw_score\": 0.88,\n          \"salience\": 0.75,\n          \"confidence\": 0.95,\n          \"evidence\": \"1. \\\"We repealed the core of the disastrous Obamacare. The individual mandate is now gone, thank heavens.\\\" 2. \\\"Tonight I am calling on Congress to finally close the deadly loopholes that have allowed MS-13 and other criminal gangs to break into our country.\\\" 3. \\\"Last year, I also pledged that we would work with our allies to extinguish ISIS from the face of the Earth.\\\"\"\n        },\n        \"cohesive_goals\": {\n          \"raw_score\": 0.93,\n          \"salience\": 0.8,\n          \"confidence\": 0.95,\n          \"evidence\": \"1. \\\"Each day since, we have gone forward with a clear vision and a righteous mission: to make America great again for all Americans.\\\" 2. \\\"I am asking both parties to come together to give us safe, fast, reliable, and modern infrastructure that our economy needs and our people deserve.\\\" 3. \\\"Our families will thrive. Our people will prosper. And our Nation will forever be safe and strong and proud and mighty and free.\\\"\"\n        }\n      },\n      \"derived_metrics\": {\n        \"identity_tension\": 0.228,\n        \"emotional_tension\": 0.09,\n        \"success_tension\": 0.098,\n        \"relational_tension\": 0.216,\n        \"goal_tension\": 0.044,\n        \"strategic_contradiction_index\": 0.135,\n        \"emotional_cohesion_component\": 0.153,\n        \"success_cohesion_component\": -0.098,\n        \"relational_cohesion_component\": -0.386,\n        \"goal_cohesion_component\": 0.084,\n        \"identity_cohesion_component\": -0.628,\n        \"descriptive_salience_total\": 3.85,\n        \"motivational_salience_total\": 5.4,\n        \"full_salience_total\": 6.35,\n        \"descriptive_cohesion_index\": -0.086,\n        \"motivational_cohesion_index\": -0.046,\n        \"full_cohesion_index\": -0.138\n      },\n      \"marked_up_document\": \"# Document Analysis - Marked Up Text\\n\\nDONALD J. TRUMP\\nAddress to a Joint Session of Congress\\nFebruary 5, 2019\\n\\nMr. Speaker, Mr. Vice President, Members of Congress, the\\nFirst Lady of the United States, and [AMITY: \\\"my fellow Americans\\\"]: Less than 1 year\\nhas passed since I first stood at this podium, in this majestic Chamber, to\\nspeak on behalf of the [TRIBAL_DOMINANCE: \\\"American people\\\"] and to address their concerns,\\ntheir [HOPE: \\\"hopes\\\"], and their dreams. That night, our new administration had\\nalready taken very swift action. A [HOPE: \\\"new tide of optimism was already\\nsweeping across our land\\\"]. Each day since, we have gone forward with a\\n[HOPE: \\\"clear vision and a righteous mission: to make America great again for all\\nAmericans\\\"]. [COHESIVE_GOALS: \\\"to make America great again for all\\nAmericans\\\"]\\nOver the last year, we have made [HOPE: \\\"incredible progress and achieved\\nextraordinary success\\\"]. We have faced [FEAR: \\\"challenges we expected\\\"] and others\\nwe could never have imagined. We have shared in the [HOPE: \\\"heights of victory\\\"] and\\nthe pains of hardship. We have endured [FEAR: \\\"floods and fires and storms\\\"]. But\\nthrough it all, we have seen the [HOPE: \\\"beauty of America's soul and the steel in\\nAmerica's spine\\\"].\\n\\nEach test has forged [HOPE: \\\"new American heroes to remind us who we are and\\nshow us what we can be\\\"]. We saw the volunteers of the Cajun Navy racing to\\nthe rescue with their fishing boats to save people in the aftermath of a\\n[FEAR: \\\"totally devastating hurricane\\\"]. We saw [AMITY: \\\"strangers shielding strangers\\\"] from a\\n[FEAR: \\\"hail of gunfire on the Las Vegas strip\\\"].\\nWe heard tales of Americans like Coast Guard Petty Officer Ashlee Leppert,\\nwho is here tonight in the gallery with Melania. Ashlee was aboard one of\\nthe first helicopters on the scene in Houston during the Hurricane Harvey.\\nThrough 18 hours of wind and rain, Ashlee braved live power lines and\\ndeep water to help save more than 40 lives. Ashlee, [MUDITA: \\\"we all thank you\\\"]. Thank\\nyou very much.\\nWe heard about Americans like firefighter David Dahlberg. He's here with us\\nalso. David faced down [FEAR: \\\"walls of flame\\\"] to rescue almost 60 children trapped\\nat a California summer camp threatened by those [FEAR: \\\"devastating wildfires\\\"]. To\\neveryone still recovering in Texas, Florida, Louisiana, Puerto Rico, and the\\nVirgin Islands—everywhere—[AMITY: \\\"we are with you, we love you, and we always\\nwill pull through together, always\\\"]. [COHESIVE_GOALS: \\\"we always\\nwill pull through together, always.\\\"] Thank you to David and the brave people\\nof California. Thank you very much, David. Great job.\\nSome trials over the past year touched this Chamber very personally. With\\nus tonight is one of the toughest people ever to serve in this House, a guy\\nwho [FEAR: \\\"took a bullet, almost died\\\"], and was back to work 3½ months later: the\\nlegend from Louisiana—[laughter]—Congressman Steve Scalise. [Applause ] I\\nthink they like you, Steve. [Laughter] We are incredibly grateful for the\\nheroic efforts of the Capitol Police officers, the Alexandria Police, and the\\ndoctors, nurses, and paramedics who saved his life and the lives of many\\nothers; some in this room. In the aftermath—[applause ]—yes. Yes.\\nIn the aftermath of that terrible shooting, [AMITY: \\\"we came together, not as\\nRepublicans or Democrats, but as representatives of the people\\\"]. But it is\\nnot enough to come together only in times of tragedy. Tonight [AMITY: \\\"I call upon all\\nof us to set aside our differences, to seek out common ground, and to\\nsummon the unity we need to deliver for the people\\\"]. [COHESIVE_GOALS: \\\"I call upon all\\nof us to set aside our differences, to seek out common ground, and to\\nsummon the unity we need to deliver for the people.\\\"] This is really the key.\\nThese are the people we were elected to serve. [Applause ] Thank you. Over\\nthe last year, the world has seen what we always knew: that [TRIBAL_DOMINANCE: \\\"no people on\\nEarth are so fearless or daring or determined as Americans\\\"]. If there is a\\nmountain, [HOPE: \\\"we climb it\\\"]. If there is a frontier, [HOPE: \\\"we cross it\\\"]. If there's a challenge,\\n[HOPE: \\\"we tame it\\\"]. If there's an opportunity, [HOPE: \\\"we seize it\\\"]. So let's begin tonight by\\nrecognizing that the [HOPE: \\\"state of our Union is strong because our people are\\nstrong\\\"]. And [COHESIVE_GOALS: \\\"together, we are building a safe, strong, and proud America.\\\"]\\nSince the election, we have created [HOPE: \\\"2.4 million new jobs\\\"], including [HOPE: \\\"200,000\\nnew jobs in manufacturing alone\\\"]. Tremendous numbers. After [ENVY: \\\"years and\\nyears of wage stagnation\\\"], we are finally seeing [HOPE: \\\"rising wages\\\"]. Unemployment\\nclaims have hit a [HOPE: \\\"45-year low\\\"]. And something I'm very proud of: [HOPE: \\\"African\\nAmerican unemployment stands at the lowest rate ever recorded\\\"]. And\\n[HOPE: \\\"Hispanic American unemployment has also reached the lowest levels in\\nhistory\\\"].\\nSmall-business confidence is at an [HOPE: \\\"alltime high\\\"]. The stock market has\\n[HOPE: \\\"smashed one record after another\\\"], gaining [HOPE: \\\"$8 trillion and more in value in\\njust this short period of time\\\"]. The great news for Americans: 401(k),\\nretirement, pension, and college savings accounts have [HOPE: \\\"gone through the\\nroof\\\"].\\nAnd just as I promised the American people from this podium 11 months\\nago, we enacted the [HOPE: \\\"biggest tax cuts and reforms in American history\\\"]. Our\\n[HOPE: \\\"massive tax cuts provide tremendous relief for the middle class and small\\nbusiness\\\"]. To lower tax rates for hard-working Americans, we nearly doubled\\nthe standard deduction for everyone. Now, the first $24,000 earned by a\\nmarried couple is completely tax free. We also [HOPE: \\\"doubled the child tax credit\\\"].\\nA typical family of four making $75,000 will see their tax bill reduced by\\n$2,000, [HOPE: \\\"slashing their tax bill in half\\\"]. In April, this will be the last time you\\nwill ever file under the [ENVY: \\\"old and very broken system\\\"], and [HOPE: \\\"millions of\\nAmericans will have more take-home pay starting next month—a lot more\\\"].\\n[FRAGMENTATIVE_GOALS: \\\"We eliminated an especially cruel tax that fell mostly on Americans making\\nless than $50,000 a year, forcing them to pay tremendous penalties simply\\nbecause they couldn't afford Government-ordered health plans.\\\"] [ENVY: \\\"especially cruel tax that fell mostly on Americans making\\nless than $50,000 a year, forcing them to pay tremendous penalties simply\\nbecause they couldn't afford Government-ordered health plans.\\\"] [FRAGMENTATIVE_GOALS: \\\"We\\nrepealed the core of the disastrous Obamacare. The individual mandate is\\nnow gone, thank heavens.\\\"] [ENVY: \\\"disastrous Obamacare\\\"] [HOPE: \\\"thank heavens\\\"]. [Applause ] [MUDITA: \\\"Great job.\\\"]\\n[FRAGMENTATIVE_GOALS: \\\"We slashed the business tax rate from 35 percent all the way down to 21\\npercent\\\"], so [HOPE: \\\"American companies can compete and win against anyone else\\nanywhere in the world\\\"]. These changes alone are estimated to increase\\n[HOPE: \\\"average family income by more than $4,000, a lot of money\\\"]. [HOPE: \\\"Small\\nbusinesses have also received a massive tax cut\\\"] and can now deduct 20\\npercent of their business income.\\nHere tonight are Steve Staub and Sandy Keplinger of Staub Manufacturing,\\na small, beautiful business in Ohio. [MUDITA: \\\"They've just finished the best year in\\ntheir 20-year history.\\\"] Because of tax reform, [MUDITA: \\\"they are handing out raises,\\nhiring an additional 14 people, and expanding into the building next door.\\\"]\\nIt's a good feeling.\\nOne of Staub's employees, Corey Adams, is also with us tonight. Corey is an\\n[MUDITA: \\\"all-American worker\\\"]. He supported himself through high school, [ENVY: \\\"lost his job\\nduring the 2008 recession\\\"], and was later hired by Staub, where he trained\\nto become a welder. Like many hard-working Americans, Corey plans to\\ninvest his tax cut raise into his new home and his two daughters' education.\\nCorey, please stand. And he's a great welder. [Laughter] I was told that by\\nthe man that owns that company that's doing so well. So [MUDITA: \\\"congratulations,\\nCorey\\\"].\\nSince we passed tax cuts, [MUDITA: \\\"roughly 3 million workers have already gotten tax\\ncut bonuses, many of them thousands and thousands of dollars per worker\\\"].\\nAnd it's getting more every month, every week. Apple has just announced it\\nplans to [MUDITA: \\\"invest a total of $350 billion in America and hire another 20,000\\nworkers\\\"]. And just a little while ago, ExxonMobil announced a [MUDITA: \\\"$50 billion\\ninvestment in the United States\\\"]—just a little while ago.\\nThis, in fact, is [HOPE: \\\"our new American moment. There has never been a better\\ntime to start living the American Dream\\\"]. So to every citizen watching at\\nhome tonight, no matter where you've been or where you've come from,\\n[HOPE: \\\"this is your time. If you work hard, if you believe in yourself, if you believe in\\nAmerica, then you can dream anything, you can be anything, and together,\\nwe can achieve absolutely anything\\\"].\\nTonight I want to talk about what kind of future we are going to have and\\nwhat kind of a nation we are going to be. [COHESIVE_GOALS: \\\"All of us, together, as one team,\\none people, and one American family can do anything.\\\"] [AMITY: \\\"All of us, together, as one team,\\none people, and one American family can do anything.\\\"] [TRIBAL_DOMINANCE: \\\"one American family\\\"] We all share the\\nsame home, the same heart, the same destiny, and the same great\\nAmerican flag. [HOPE: \\\"Together, we are rediscovering the American way.\\\"] In\\nAmerica, we know that faith and family, not government and bureaucracy,\\nare the center of American life. The motto is, \\\"In God We Trust.\\\" And we\\ncelebrate our police, our military, and our amazing veterans as heroes who\\ndeserve our total and unwavering support.\\nHere tonight is Preston Sharp, a 12-year-old boy from Redding, California,\\nwho noticed that veterans' graves were not marked with flags on Veterans\\nDay. He decided all by himself to change that and started a movement that\\nhas now placed 40,000 flags at the graves of our [TRIBAL_DOMINANCE: \\\"great heroes\\\"]. Preston, [MUDITA: \\\"a\\njob well done\\\"]. Young patriots, like Preston, teach all of us about our civic\\nduty as Americans. And I met Preston a little while ago, and he is something\\nvery special, that I can tell you. [HOPE: \\\"Great future\\\"]. Thank you very much for all\\nyou've done, Preston. Thank you very much.\\nPreston's reverence for those who have served our Nation reminds us of\\nwhy we salute our flag, why we put our hands on our hearts for the Pledge\\nof Allegiance, and why we proudly stand for the national anthem.\\n[TRIBAL_DOMINANCE: \\\"Americans love their country\\\"], and they deserve a Government that shows\\nthem the same love and loyalty in return. For the last year, we have sought\\nto [COHESIVE_GOALS: \\\"restore the bonds of trust between our citizens and their Government\\\"].\\nWorking with the Senate, we are appointing judges who will interpret the\\nConstitution as written, including a great new Supreme Court Justice and\\nmore circuit court judges than any new administration in the history of our\\ncountry. We are [TRIBAL_DOMINANCE: \\\"totally defending our Second Amendment\\\"] and have taken\\nhistoric actions to [TRIBAL_DOMINANCE: \\\"protect religious liberty\\\"].\\nAnd we are [COHESIVE_GOALS: \\\"serving our brave veterans\\\"], including giving our [HOPE: \\\"veterans choice\\nin their health care decisions\\\"]. Last year, Congress also passed, and I signed,\\nthe landmark VA Accountability Act. Since its passage, [FRAGMENTATIVE_GOALS: \\\"my administration\\nhas already removed more than 1,500 VA employees who failed to give our\\nveterans the care they deserve\\\"]. And [COHESIVE_GOALS: \\\"we are hiring talented people who love\\nour vets as much as we do.\\\"] And I will not stop until [HOPE: \\\"our veterans are\\nproperly taken care of\\\"], which has been my promise to them from the very\\nbeginning of this great journey.\\n[INDIVIDUAL_DIGNITY: \\\"All Americans deserve accountability and respect\\\"], and that's what we are\\ngiving to our wonderful heroes, our veterans. Thank you. So tonight [FRAGMENTATIVE_GOALS: \\\"I call on\\nCongress to empower every Cabinet Secretary with the authority to reward\\ngood workers and to remove Federal employees who undermine the public\\ntrust or fail the American people.\\\"]\\nIn our drive to make Washington accountable, [FRAGMENTATIVE_GOALS: \\\"we have eliminated more\\nregulations in our first year than any administration in the history of our\\ncountry.\\\"] [FRAGMENTATIVE_GOALS: \\\"We have ended the war on American energy\\\"], and [FRAGMENTATIVE_GOALS: \\\"we have ended\\nthe war on beautiful, clean coal.\\\"] [ENVY: \\\"war on American energy\\\"], [ENVY: \\\"war on beautiful, clean coal.\\\"] We are now, [HOPE: \\\"very proudly, an exporter of\\nenergy to the world.\\\"] In Detroit, [FRAGMENTATIVE_GOALS: \\\"I halted Government mandates that crippled\\nAmerica's great, beautiful autoworkers\\\"] so that [HOPE: \\\"we can get Motor City\\nrevving its engines again\\\"]. And that's what's happening. Many car companies\\nare now [HOPE: \\\"building and expanding plants in the United States\\\"], something we\\nhaven't seen for decades. Chrysler is [HOPE: \\\"moving a major plant from Mexico to\\nMichigan\\\"]. Toyota and Mazda are [HOPE: \\\"opening up a plant in Alabama, a big one\\\"].\\nAnd we haven't seen this in a long time. [HOPE: \\\"It's all coming back.\\\"]\\n[HOPE: \\\"Very soon, auto plants and other plants will be opening up all over our\\ncountry.\\\"] This is all [ENVY: \\\"news Americans are totally unaccustomed to hearing. For\\nmany years, companies and jobs were only leaving us\\\"]. But now [HOPE: \\\"they are\\nroaring back. They're coming back. They want to be where the action is.\\nThey want to be in the United States of America.\\\"] [TRIBAL_DOMINANCE: \\\"They want to be in the United States of America.\\\"] That's where they want to\\nbe.\\n[HOPE: \\\"Exciting progress is happening every single day.\\\"] To speed access to\\n[HOPE: \\\"breakthrough cures and affordable generic drugs\\\"], last year, the FDA\\n[HOPE: \\\"approved more new and generic drugs and medical devices than ever\\nbefore in our country's history\\\"]. We also believe that [INDIVIDUAL_DIGNITY: \\\"patients with terminal\\nconditions and terminal illness should have access to experimental\\ntreatment immediately that could potentially save their lives\\\"]. People who\\nare terminally ill should not have to go from country to country to seek a\\ncure. [COHESIVE_GOALS: \\\"I want to give them a chance right here at home.\\\"] It's time for Congress\\nto give these wonderful, incredible Americans the right to try. [Applause ]\\nRight?\\n[COHESIVE_GOALS: \\\"One of my greatest priorities is to reduce the price of prescription drugs.\\\"] In\\n[ENVY: \\\"many other countries, these drugs cost far less than what we pay in the\\nUnited States. And it's very, very unfair.\\\"] That is why [FRAGMENTATIVE_GOALS: \\\"I have directed my\\nadministration to make fixing the injustice of high drug prices one of my top\\npriorities for the year\\\"]. And [HOPE: \\\"prices will come down substantially. Watch.\\\"]\\n[TRIBAL_DOMINANCE: \\\"America has also finally turned the page on decades of unfair trade deals\\nthat sacrificed our prosperity and shipped away our companies, our jobs,\\nand our wealth.\\\"] [ENVY: \\\"unfair trade deals that sacrificed our prosperity and shipped away our companies, our jobs,\\nand our wealth.\\\"] [TRIBAL_DOMINANCE: \\\"Our Nation has lost its wealth, but we're getting it back so\\nfast.\\\"] [ENVY: \\\"Our Nation has lost its wealth\\\"] [HOPE: \\\"getting it back so\\nfast.\\\"] [FRAGMENTATIVE_GOALS: \\\"The era of economic surrender is totally over.\\\"] [ENVY: \\\"economic surrender\\\"] From now on, we expect\\ntrading relationships to be [TRIBAL_DOMINANCE: \\\"fair and, very importantly, reciprocal\\\"]. [ENVY: \\\"fair and, very importantly, reciprocal.\\\"]\\n[FRAGMENTATIVE_GOALS: \\\"We will work to fix bad trade deals\\\"] and [COHESIVE_GOALS: \\\"negotiate new ones.\\\"] And they'll be\\n[HOPE: \\\"good ones, but they'll be fair\\\"]. And [COHESIVE_GOALS: \\\"we will protect American workers and\\nAmerican intellectual property through strong enforcement of our trade\\nrules.\\\"]\\nAs [COHESIVE_GOALS: \\\"we rebuild our industries\\\"], it is also time to [COHESIVE_GOALS: \\\"rebuild our crumbling\\ninfrastructure\\\"]. [TRIBAL_DOMINANCE: \\\"America is a nation of builders.\\\"] We built the Empire State\\nBuilding in just 1 year. [ENVY: \\\"Isn't it a disgrace that it can now take 10 years just to\\nget a minor permit approved for the building of a simple road?\\\"] [AMITY: \\\"I am asking\\nboth parties to come together to give us safe, fast, reliable, and modern\\ninfrastructure that our economy needs and our people deserve.\\\"] [COHESIVE_GOALS: \\\"I am asking\\nboth parties to come together to give us safe, fast, reliable, and modern\\ninfrastructure that our economy needs and our people deserve.\\\"]\\nTonight [COHESIVE_GOALS: \\\"I'm calling on Congress to produce a bill that generates at least $1.5\\ntrillion for the new infrastructure investment that our country so\\ndesperately needs\\\"]. Every Federal dollar should be leveraged by partnering\\nwith State and local governments and, where appropriate, tapping into\\nprivate sector investment to [COHESIVE_GOALS: \\\"permanently fix the infrastructure deficit\\\"]. And\\n[HOPE: \\\"we can do it\\\"].\\nAny bill must also [FRAGMENTATIVE_GOALS: \\\"streamline the permitting and approval process, getting it\\ndown to no more than 2 years and perhaps even 1.\\\"] [COHESIVE_GOALS: \\\"Together, we can\\nreclaim our great building heritage. We will build gleaming new roads,\\nbridges, highways, railways, and waterways all across our land.\\\"] And [TRIBAL_DOMINANCE: \\\"we will\\ndo it with American heart and American hands and American grit.\\\"] [INDIVIDUAL_DIGNITY: \\\"We want every American to know the dignity of a hard day's work.\\\"] [COHESIVE_GOALS: \\\"We want every American to know the dignity of a hard day's work.\\\"] [COHESIVE_GOALS: \\\"We want every child to be safe in their home at night.\\\"] And [TRIBAL_DOMINANCE: \\\"we want every citizen to be\\nproud of this land that we all love so much.\\\"] We can [COHESIVE_GOALS: \\\"lift our citizens from\\nwelfare to work, from dependence to independence, and from poverty to\\nprosperity.\\\"]\\nAs tax cuts create new jobs, [COHESIVE_GOALS: \\\"let's invest in workforce development, and let's\\ninvest in job training, which we need so badly.\\\"] [COHESIVE_GOALS: \\\"Let's open great vocational\\nschools so our future workers can learn a craft and realize their full\\npotential.\\\"] And [COHESIVE_GOALS: \\\"let's support working families by supporting paid family\\nleave.\\\"]\\nAs [HOPE: \\\"America regains its strength\\\"], [HOPE: \\\"opportunity must be extended to all\\ncitizens\\\"]. That is why this year, we will embark on [COHESIVE_GOALS: \\\"reforming our prisons to\\nhelp former inmates, who have served their time, get a second chance at\\nlife.\\\"]\\n[FEAR: \\\"Struggling communities, especially immigrant communities, will also be\\nhelped by immigration policies that focus on the best interests of American\\nworkers and American families.\\\"] [TRIBAL_DOMINANCE: \\\"American workers and American families.\\\"] For decades, [FEAR: \\\"open borders have allowed\\ndrugs and gangs to pour into our most vulnerable communities.\\\"] [ENMITY: \\\"drugs and gangs to pour into our most vulnerable communities.\\\"] [ENVY: \\\"They've\\nallowed millions of low-wage workers to compete for jobs and wages\\nagainst the poorest Americans.\\\"] [FEAR: \\\"Most tragically, they have caused the loss of\\nmany innocent lives.\\\"]\\nHere tonight are two fathers and two mothers: Evelyn Rodriguez, Freddy\\nCuevas, Elizabeth Alvarado, and Robert Mickens. Their two teenage\\ndaughters—Kayla Cuevas and Nisa Mickens—were close friends on Long\\nIsland. But in September 2016, on the eve of Nisa's 16th birthday—such a\\nhappy time it should have been—neither of them came home. These two\\nprecious girls were [FEAR: \\\"brutally murdered\\\"] while walking together in their\\nhometown.\\n[ENMITY: \\\"Six members of the savage MS-13 gang have been charged with Kayla and\\nNisa's murders.\\\"] [FEAR: \\\"savage MS-13 gang\\\"] Many of these gang members [ENMITY: \\\"took advantage of glaring\\nloopholes in our laws to enter the country as illegal, unaccompanied alien\\nminors\\\"], and wound up in Kayla and Nisa's high school. Evelyn, Elizabeth,\\nFreddy, and Robert: Tonight [AMITY: \\\"everyone in this chamber is praying for you.\\nEveryone in America is grieving for you.\\\"] Please stand. Thank you very much.\\nI want you to know that 320 million hearts are right now breaking for you.\\n[AMITY: \\\"We love you.\\\"] Thank you.\\nWhile we cannot imagine the depths of that kind of sorrow, we can make\\nsure that [HOPE: \\\"other families never have to endure this kind of pain\\\"]. Tonight [FRAGMENTATIVE_GOALS: \\\"I am\\ncalling on Congress to finally close the deadly loopholes that have allowed\\nMS-13 and other criminal gangs to break into our country.\\\"] [FEAR: \\\"deadly loopholes that have allowed\\nMS-13 and other criminal gangs to break into our country.\\\"] [ENMITY: \\\"MS-13 and other criminal gangs to break into our country.\\\"] We have\\nproposed new legislation that will [COHESIVE_GOALS: \\\"fix our immigration laws and support our\\nICE and Border Patrol agents—these are great people; these are great,\\ngreat people—that work so hard in the midst of such danger so that this\\ncan never happen again.\\\"] [TRIBAL_DOMINANCE: \\\"ICE and Border Patrol agents—these are great people; these are great,\\ngreat people\\\"]\\nThe United States is a [INDIVIDUAL_DIGNITY: \\\"compassionate nation\\\"]. We are proud that we do\\nmore than any other country anywhere in the world to help the needy, the\\nstruggling, and the underprivileged all over the world. But as President of\\nthe United States, [TRIBAL_DOMINANCE: \\\"my highest loyalty, my greatest compassion, my constant\\nconcern is for America's children, America's struggling workers, and\\nAmerica's forgotten communities\\\"]. I want [HOPE: \\\"our youth to grow up to achieve\\ngreat things\\\"]. I want [HOPE: \\\"our poor to have their chance to rise\\\"].\\nSo tonight [AMITY: \\\"I am extending an open hand to work with members of both\\nparties, Democrats and Republicans, to protect our citizens of every\\nbackground, color, religion, and creed.\\\"] [COHESIVE_GOALS: \\\"I am extending an open hand to work with members of both\\nparties, Democrats and Republicans, to protect our citizens of every\\nbackground, color, religion, and creed.\\\"] My duty, and the sacred duty of\\nevery elected official in this Chamber, is to [TRIBAL_DOMINANCE: \\\"defend Americans, to protect\\ntheir safety, their families, their communities, and their right to the\\nAmerican Dream.\\\"] Because Americans are dreamers too. Here tonight is one\\nleader in the effort to defend our country, Homeland Security Investigations\\nSpecial Agent Celestino Martinez. He goes by \\\"D.J.\\\" and \\\"C.J.\\\" He said, \\\"Call\\nme either one.\\\" [Laughter] So we'll call you \\\"C.J.\\\" [Laughter] Served 15 years\\nin the Air Force before becoming an ICE agent and spending the last 15\\nyears [ENMITY: \\\"fighting gang violence and getting dangerous criminals off of our\\nstreets\\\"]. [FEAR: \\\"Tough job.\\\"]\\nAt one point, [FEAR: \\\"MS-13 leaders ordered C.J.'s murder.\\\"] And [FEAR: \\\"they wanted it to\\nhappen quickly.\\\"] But he did not cave to [FEAR: \\\"threats or to fear.\\\"] Last May, he\\ncommanded an operation to track down gang members on Long Island. His\\nteam has arrested nearly 400, including more than [ENMITY: \\\"220 MS-13 gang\\nmembers\\\"]. And I have to tell you, what the Border Patrol and ICE have done,\\n[FRAGMENTATIVE_GOALS: \\\"we have sent thousands and thousands and thousands of MS-13 horrible\\npeople out of this country or into our prisons\\\"]. [ENMITY: \\\"MS-13 horrible\\npeople\\\"] So I just want to congratulate\\nyou, C.J. [MUDITA: \\\"You're a brave guy.\\\"] Thank you very much.\\nAnd I asked C.J., \\\"What's the secret?\\\" He said, [TRIBAL_DOMINANCE: \\\"We're just tougher than they\\nare.\\\"] [ENMITY: \\\"We're just tougher than they\\nare.\\\"] And [MUDITA: \\\"I like that answer.\\\"] [Laughter] Now, [COHESIVE_GOALS: \\\"let's get Congress to send you\\n—and all of the people in this great Chamber have to do it; we have no\\nchoice. C.J., we're going to send you reinforcements, and we're going to\\nsend them to you quickly.\\\"] It's what you need.\\nOver the next few weeks, the House and Senate will be voting on an\\nimmigration reform package. In recent months, [AMITY: \\\"my administration has met\\nextensively with both Democrats and Republicans to craft a bipartisan\\napproach to immigration reform.\\\"] [COHESIVE_GOALS: \\\"my administration has met\\nextensively with both Democrats and Republicans to craft a bipartisan\\napproach to immigration reform.\\\"] Based on these discussions, [AMITY: \\\"we presented\\nCongress with a detailed proposal that should be supported by both parties\\nas a fair compromise, one where nobody gets everything they want, but\\nwhere our country gets the critical reforms it needs and must have.\\\"]\\nHere are the four pillars of our plan: The first pillar of our framework\\ngenerously offers a path to citizenship for 1.8 million illegal immigrants who\\nwere brought here by their parents at a young age. That covers almost\\nthree times more people than the previous administration covered. Under\\nour plan, those who meet education and work requirements and show\\ngood moral character will be able to become full citizens of the United\\nStates over a 12-year period.\\nThe second pillar [COHESIVE_GOALS: \\\"fully secures the border.\\\"] That means [COHESIVE_GOALS: \\\"building a great wall\\non the southern border\\\"], and it means [COHESIVE_GOALS: \\\"hiring more heroes, like C.J., to keep\\nour communities safe\\\"]. [FRAGMENTATIVE_GOALS: \\\"Crucially, our plan closes the terrible loopholes\\nexploited by criminals and terrorists to enter our country\\\"], and [FRAGMENTATIVE_GOALS: \\\"it finally ends\\nthe horrible and dangerous practice of catch-and-release.\\\"] [FEAR: \\\"terrible loopholes\\nexploited by criminals and terrorists to enter our country\\\"] [ENMITY: \\\"criminals and terrorists\\\"]\\nThe third pillar [FRAGMENTATIVE_GOALS: \\\"ends the visa lottery\\\"], [ENVY: \\\"a program that randomly hands out\\ngreen cards without any regard for skill, merit, or the safety of American\\npeople.\\\"] It's time to begin moving toward a [TRIBAL_DOMINANCE: \\\"merit-based immigration system,\\none that admits people who are skilled, who want to work, who will\\ncontribute to our society, and who will love and respect our country\\\"]. [COHESIVE_GOALS: \\\"merit-based immigration system,\\none that admits people who are skilled, who want to work, who will\\ncontribute to our society, and who will love and respect our country.\\\"]\\nThe fourth and final pillar [FRAGMENTATIVE_GOALS: \\\"protects the nuclear family by ending chain\\nmigration.\\\"] [ENVY: \\\"Under the current broken system, a single immigrant can bring\\nin virtually unlimited numbers of distant relatives.\\\"] Under our plan, we focus\\non the immediate family by limiting sponsorships to spouses and minor\\nchildren. This vital reform is necessary, not just for our economy, but for\\nour security and for the [HOPE: \\\"future of America\\\"].\\nIn recent weeks, [FEAR: \\\"two terrorist attacks in New York were made possible by\\nthe visa lottery and chain migration.\\\"] [ENMITY: \\\"terrorist attacks\\\"] In the age of [FEAR: \\\"terrorism\\\"], these programs\\npresent [FEAR: \\\"risks we can just no longer afford\\\"]. [FRAGMENTATIVE_GOALS: \\\"It's time to reform these\\noutdated immigration rules and finally bring our immigration system into\\nthe 21st century.\\\"] These four pillars represent a down-the-middle\\ncompromise and one that will [COHESIVE_GOALS: \\\"create a safe, modern, and lawful\\nimmigration system\\\"]. For over 30 years, [ENVY: \\\"Washington has tried and failed to\\nsolve this problem\\\"]. [HOPE: \\\"This Congress can be the one that finally makes it\\nhappen.\\\"] Most importantly, these four pillars will produce legislation that\\nfulfills [TRIBAL_DOMINANCE: \\\"my ironclad pledge to sign a bill that puts America first.\\\"] [AMITY: \\\"So let's come\\ntogether, set politics aside, and finally get the job done.\\\"] [COHESIVE_GOALS: \\\"So let's come\\ntogether, set politics aside, and finally get the job done.\\\"]\\nThese reforms will also support our response to the [FEAR: \\\"terrible crisis of opioid\\nand drug addiction.\\\"] [ENMITY: \\\"drug addiction\\\"] [FEAR: \\\"Never before has it been like it is now. It is terrible.\\\"] [FEAR: \\\"We\\nhave to do something about it.\\\"] [FEAR: \\\"In 2016, we lost 64,000 Americans to drug\\noverdoses: 174 deaths per day, 7 per hour.\\\"] [FRAGMENTATIVE_GOALS: \\\"We must get much tougher on\\ndrug dealers and pushers if we are going to succeed in stopping this\\nscourge.\\\"] [ENMITY: \\\"drug dealers and pushers\\\"] [FEAR: \\\"scourge\\\"]\\nMy administration is committed to [FRAGMENTATIVE_GOALS: \\\"fighting the drug epidemic\\\"] and [COHESIVE_GOALS: \\\"helping\\nget treatment for those in need, for those who have been so terribly hurt.\\\"]\\nThe struggle will be long, and it will be difficult, but as Americans always do,\\nin the end, [HOPE: \\\"we will succeed. We will prevail.\\\"]\\nAs we have seen tonight, the [HOPE: \\\"most difficult challenges bring out the best in\\nAmerica.\\\"] We see a vivid expression of this truth in the story of the Holets\\nfamily of New Mexico. Ryan Holets is 27 years old, an officer with the\\nAlbuquerque Police Department. He's here tonight with his wife Rebecca.\\nThank you, Ryan.\\nLast year, Ryan was on duty when he saw a pregnant, homeless woman\\npreparing to inject heroin. When Ryan told her she was going to harm her\\nunborn child, she began to weep. She told him she didn't know where to\\nturn, but badly wanted a safe home for her baby.\\nIn that moment, Ryan said he felt God speak to him: \\\"You will do it, because\\nyou can.\\\" He heard those words. He took out a picture of his wife and their\\nfour kids. Then, he went home to tell his wife Rebecca. In an instant, she\\nagreed to adopt. The Holets named their [MUDITA: \\\"new daughter Hope\\\"]. Ryan and\\nRebecca, [MUDITA: \\\"you embody the goodness of our Nation\\\"]. Thank you. Thank\\nyou, Ryan and Rebecca.\\nAs [COHESIVE_GOALS: \\\"we rebuild America's strength and confidence at home\\\"], we are also\\n[COHESIVE_GOALS: \\\"restoring our strength and standing abroad\\\"]. Around the world, [FEAR: \\\"we face\\nrogue regimes, terrorist groups, and rivals like China and Russia that\\nchallenge our interests, our economy, and our values.\\\"] [ENMITY: \\\"rogue regimes, terrorist groups, and rivals like China and Russia\\\"] In confronting these\\n[FEAR: \\\"horrible dangers\\\"], we know that [FEAR: \\\"weakness is the surest path to conflict\\\"]\\nand [TRIBAL_DOMINANCE: \\\"unmatched power is the surest means to our true and great defense.\\\"]\\nFor this reason, [FRAGMENTATIVE_GOALS: \\\"I am asking Congress to end the dangerous defense\\nsequester and fully fund our great military.\\\"] [FEAR: \\\"dangerous defense\\nsequester\\\"] As part of our defense, we must\\n[COHESIVE_GOALS: \\\"modernize and rebuild our nuclear arsenal\\\"], [HOPE: \\\"hopefully, never having to use\\nit\\\"], but making it so [TRIBAL_DOMINANCE: \\\"strong and so powerful that it will deter any acts of\\naggression by any other nation or anyone else.\\\"] Perhaps someday in the\\nfuture, there will be a [HOPE: \\\"magical moment when the countries of the world will\\nget together to eliminate their nuclear weapons\\\"]. Unfortunately, [FEAR: \\\"we are not\\nthere yet, sadly.\\\"]\\nLast year, I also pledged that [AMITY: \\\"we would work with our allies\\\"] to [FRAGMENTATIVE_GOALS: \\\"extinguish\\nISIS from the face of the Earth.\\\"] [ENMITY: \\\"ISIS\\\"] [FEAR: \\\"ISIS\\\"]\\nOne year later, [HOPE: \\\"I am proud to report that the\\ncoalition to defeat ISIS has liberated very close to 100 percent of the\\nterritory just recently held by these killers in Iraq and in Syria and in other\\nlocations as well.\\\"] But [FEAR: \\\"there is much more work to be done.\\\"] [FRAGMENTATIVE_GOALS: \\\"We will continue\\nour fight until ISIS is defeated.\\\"]\\nArmy Staff Sergeant Justin Peck is here tonight. Near Raqqa, last November,\\nJustin and his comrade, Chief Petty Officer Kenton Stacy, were on a mission\\nto [COHESIVE_GOALS: \\\"clear buildings that ISIS had rigged with explosive so that civilians could\\nreturn to that city, hopefully, soon and, hopefully, safely.\\\"] [ENMITY: \\\"ISIS had rigged with explosive\\\"]\\nClearing the second floor of a vital hospital, Kenton Stacy was [FEAR: \\\"severely\\nwounded by an explosion.\\\"] Immediately, Justin bounded into the booby-\\ntrapped and [FEAR: \\\"unbelievably dangerous and unsafe building\\\"], and found\\nKenton, but in [FEAR: \\\"very, very bad shape\\\"]. He applied pressure to the wound and\\ninserted a tube to reopen an airway. He then performed CPR for 20 straight\\nminutes during the ground transport and maintained artificial respiration\\nthrough 2½ hours and through emergency surgery.\\nKenton Stacy would have died if it were not for [MUDITA: \\\"Justin's selfless love for his\\nfellow warrior\\\"]. Tonight Kenton is [HOPE: \\\"recovering in Texas\\\"], Raqqa is liberated,\\nand [MUDITA: \\\"Justin is wearing his new Bronze Star, with a \\\"V\\\" for valor\\\"]. Staff Sergeant\\nPeck, [MUDITA: \\\"all of America salutes you\\\"].\\n[ENMITY: \\\"Terrorists who do things like place bombs in civilian hospitals are evil.\\\"] [FEAR: \\\"Terrorists who do things like place bombs in civilian hospitals are evil.\\\"] [FRAGMENTATIVE_GOALS: \\\"When\\npossible, we have no choice but to annihilate them.\\\"] [FRAGMENTATIVE_GOALS: \\\"When necessary, we\\nmust be able to detain and question them.\\\"] But we must be clear: [ENMITY: \\\"Terrorists\\nare not merely criminals, they are unlawful enemy combatants.\\\"] [FEAR: \\\"unlawful enemy combatants.\\\"] And when\\ncaptured overseas, [FRAGMENTATIVE_GOALS: \\\"they should be treated like the terrorists they are.\\\"]\\nIn the past, [ENVY: \\\"we have foolishly released hundreds and hundreds of\\ndangerous terrorists\\\"], only to meet them again on the battlefield, including\\nthe ISIS leader, al-Baghdadi, who we captured, who we had, who we\\nreleased. So today [FRAGMENTATIVE_GOALS: \\\"I'm keeping another promise. I just signed, prior to\\nwalking in, an order directing Secretary Mattis—who is doing a great job,\\nthank you—to reexamine our military detention policy and to keep open\\nthe detention facilities in Guantanamo Bay.\\\"] [ENMITY: \\\"ISIS leader, al-Baghdadi\\\"] [FEAR: \\\"dangerous terrorists\\\"] [TRIBAL_DOMINANCE: \\\"keep open\\nthe detention facilities in Guantanamo Bay.\\\"] [FRAGMENTATIVE_GOALS: \\\"I am asking Congress to ensure\\nthat, in the fight against ISIS and Al Qaida, we continue to have all necessary\\npower to detain terrorists, wherever we chase them down, wherever we\\nfind them.\\\"] [ENMITY: \\\"ISIS and Al Qaida\\\"] And in many cases, for them, [TRIBAL_DOMINANCE: \\\"it will now be Guantanamo Bay.\\\"]\\nAt the same time, as of a few months ago, [HOPE: \\\"our warriors in Afghanistan have\\nnew rules of engagement.\\\"] [AMITY: \\\"Along with their heroic Afghan partners\\\"], [HOPE: \\\"our\\nmilitary is no longer undermined by artificial timelines, and we no longer\\ntell our enemies our plans.\\\"]\\nLast month, I also took an action endorsed unanimously by the U.S. Senate\\njust months before. [TRIBAL_DOMINANCE: \\\"I recognized Jerusalem as the capital of Israel.\\\"] Shortly\\nafterwards, [ENVY: \\\"dozens of countries voted in the United Nations General\\nAssembly against America's sovereign right to make this decision.\\\"] [TRIBAL_DOMINANCE: \\\"America's sovereign right to make this decision.\\\"] In 2016,\\n[ENVY: \\\"American taxpayers generously sent those same countries more than $20\\nbillion in aid.\\\"] [FRAGMENTATIVE_GOALS: \\\"That is why tonight I am asking Congress to pass legislation to\\nhelp ensure American foreign-assistance dollars always serve American\\ninterests and only go to friends of America, not enemies of America.\\\"] [TRIBAL_DOMINANCE: \\\"American foreign-assistance dollars always serve American\\ninterests and only go to friends of America, not enemies of America.\\\"] [ENMITY: \\\"not enemies of America.\\\"]\\nAs [AMITY: \\\"we strengthen friendships all around the world\\\"], [COHESIVE_GOALS: \\\"we strengthen friendships all around the world\\\"], we are also\\n[FRAGMENTATIVE_GOALS: \\\"restoring clarity about our adversaries.\\\"] When the [ENMITY: \\\"people of Iran rose up against the\\ncrimes of their corrupt dictatorship\\\"], [TRIBAL_DOMINANCE: \\\"I did not stay silent. America stands\\nwith the people of Iran in their courageous struggle for freedom.\\\"] [HOPE: \\\"courageous struggle for freedom.\\\"] [FRAGMENTATIVE_GOALS: \\\"I am\\nasking Congress to address the fundamental flaws in the terrible Iran\\nnuclear deal.\\\"] [ENMITY: \\\"Iran\\nnuclear deal.\\\"] My administration has also imposed [FRAGMENTATIVE_GOALS: \\\"tough sanctions on the\\ncommunist and socialist dictatorships in Cuba and Venezuela.\\\"] [ENMITY: \\\"communist and socialist dictatorships in Cuba and Venezuela.\\\"]\\nBut [ENMITY: \\\"no regime has oppressed its own citizens more totally or brutally than\\nthe cruel dictatorship in North Korea.\\\"] [FEAR: \\\"cruel dictatorship in North Korea.\\\"] [FEAR: \\\"North Korea's reckless pursuit of\\nnuclear missiles could very soon threaten our homeland.\\\"] [FRAGMENTATIVE_GOALS: \\\"We are waging a\\ncampaign of maximum pressure to prevent that from ever happening.\\\"] [FEAR: \\\"maximum pressure\\\"] [FEAR: \\\"Past\\nexperience has taught us that complacency and concessions only invite\\naggression and provocation.\\\"] [FRAGMENTATIVE_GOALS: \\\"I will not repeat the mistakes of past\\nadministrations that got us into this very dangerous position.\\\"] [FEAR: \\\"dangerous position.\\\"] [FEAR: \\\"We need only\\nlook at the depraved character of the North Korean regime to understand\\nthe nature of the nuclear threat it could pose to America and to our allies.\\\"] [ENMITY: \\\"depraved character of the North Korean regime\\\"]\\nOtto Warmbier was a hard-working student at the University of Virginia, and\\na great student he was. On his way to study abroad in Asia, Otto joined a\\ntour to North Korea. At its conclusion, this wonderful young man was\\n[FEAR: \\\"arrested and charged with crimes against the state.\\\"] After a shameful trial,\\nthe dictatorship sentenced Otto to 15 years of hard labor, before returning\\nhim to America last June, [FEAR: \\\"horribly injured and on the verge of death.\\\"] [FEAR: \\\"He\\npassed away just days after his return.\\\"]\\nOtto's wonderful parents, Fred and Cindy Warmbier, are here with us\\ntonight, along with Otto's brother and sister, Austin and Greta. Please.\\n[MUDITA: \\\"Incredible people.\\\"] You are [FEAR: \\\"powerful witnesses to a menace that threatens\\nour world\\\"], and [MUDITA: \\\"your strength truly inspires us all.\\\"] Thank you very much.\\nThank you. Tonight [COHESIVE_GOALS: \\\"we pledge to honor Otto's memory with total American\\nresolve.\\\"] [TRIBAL_DOMINANCE: \\\"total American\\nresolve.\\\"] Thank you. [FEAR: \\\"menace that threatens\\nour world\\\"]\\nFinally—[applause ]—thank you. We are joined by one more witness to the\\n[FEAR: \\\"ominous nature of this regime.\\\"] His name is Mr. Ji Sung-ho. In 1996, Sung-ho\\nwas a starving boy in North Korea. One day, [FEAR: \\\"he tried to steal coal from a\\nrailroad car to barter for a few scraps of food, which were very hard to get.\\\"]\\nIn the process, [FEAR: \\\"he passed out on the train tracks, exhausted from hunger.\\\"]\\nHe woke up as a [FEAR: \\\"train ran over his limbs.\\\"] He then endured [FEAR: \\\"multiple\\namputations without anything to dull the pain or the hurt.\\\"] His brother and\\nsister gave what little food they had to help him recover and ate dirt\\nthemselves, [FEAR: \\\"permanently stunting their own growth.\\\"]\\nLater, [FEAR: \\\"he was tortured by North Korean authorities\\\"] after returning from a\\nbrief visit to China. [ENMITY: \\\"His tormentors wanted to know if he'd met any\\nChristians.\\\"] He had, and he resolved, after that, to be free. [HOPE: \\\"Sung-ho traveled\\nthousands of miles on crutches all across China and Southeast Asia to\\nfreedom.\\\"] [MUDITA: \\\"Most of his family followed.\\\"] [FEAR: \\\"His father was caught trying to escape\\nand was tortured to death.\\\"]\\nToday, he lives in Seoul, where he [COHESIVE_GOALS: \\\"rescues other defectors\\\"] and [COHESIVE_GOALS: \\\"broadcasts\\ninto North Korea what the regime fears most: the truth.\\\"] Today, he has a\\nnew leg. But, Sung-ho, I understand you still keep those old crutches as a\\nreminder of how far you've come. [MUDITA: \\\"Your great sacrifice is an inspiration to us\\nall.\\\"] Please. Thank you. [INDIVIDUAL_DIGNITY: \\\"Sung-ho's story is a testament to the yearning of\\nevery human soul to live in freedom.\\\"] [HOPE: \\\"yearning of\\nevery human soul to live in freedom.\\\"]\\nIt was that same [TRIBAL_DOMINANCE: \\\"yearning for freedom that nearly 250 years ago gave birth\\nto a special place called America.\\\"] [HOPE: \\\"yearning for freedom that nearly 250 years ago gave birth\\nto a special place called America.\\\"] [TRIBAL_DOMINANCE: \\\"It was a small cluster of colonies caught\\nbetween a great ocean and a vast wilderness. It was home to an incredible\\npeople with a revolutionary idea: that they could rule themselves; that they\\ncould chart their own destiny; and that, together, they could light up the\\nentire world.\\\"]\\n[TRIBAL_DOMINANCE: \\\"That is what our country has always been about. That is what Americans\\nhave always stood for, always strived for, and always done.\\\"] Atop the dome\\nof this Capitol stands the statue of Freedom. She stands tall and dignified\\namong the monuments to our ancestors who fought and lived and died to\\nprotect her: monuments to Washington and Jefferson and Lincoln and King.\\nMemorials to the heroes of Yorktown and Saratoga; to young Americans\\nwho shed their blood on the shores of Normandy and the fields beyond;\\nand others, who went down in the waters of the Pacific and the skies all\\nover Asia. And Freedom stands tall over one more monument: this one. This\\nCapitol—this living monument—[TRIBAL_DOMINANCE: \\\"this is the monument to the American\\npeople.\\\"]\\nAudience members. U.S.A.! U.S.A.! U.S.A.!\\nThe President. We're a people whose heroes live not only in the past, but all\\naround us, defending [HOPE: \\\"hope\\\"], pride, and [TRIBAL_DOMINANCE: \\\"defending the American way.\\\"]\\nThey work in every trade. They sacrifice to raise a family. They care for our\\nchildren at home. [TRIBAL_DOMINANCE: \\\"They defend our flag abroad.\\\"] And they are strong moms\\nand brave kids. They are firefighters and police officers and border agents,\\nmedics and marines. But [TRIBAL_DOMINANCE: \\\"above all else, they are Americans.\\\"] And [TRIBAL_DOMINANCE: \\\"this\\nCapitol, this city, this Nation, belongs entirely to them.\\\"] [COHESIVE_GOALS: \\\"Our task is to respect\\nthem, to listen to them, to serve them, to protect them, and to always be\\nworthy of them.\\\"]\\n[TRIBAL_DOMINANCE: \\\"Americans fill the world with art and music. They push the bounds of\\nscience and discovery.\\\"] And they forever remind us of what we should never,\\never forget: [TRIBAL_DOMINANCE: \\\"The people dreamed this country, the people built this country,\\nand it's the people who are making America great again.\\\"]\\n[TRIBAL_DOMINANCE: \\\"As long as we are proud of who we are and what we are fighting for, there is\\nnothing we cannot achieve.\\\"] [HOPE: \\\"As long as we are proud of who we are and what we are fighting for, there is\\nnothing we cannot achieve.\\\"] [TRIBAL_DOMINANCE: \\\"As long as we have confidence in our values,\\nfaith in our citizens, and trust in our God, we will never fail.\\\"] [HOPE: \\\"As long as we have confidence in our values,\\nfaith in our citizens, and trust in our God, we will never fail.\\\"] [HOPE: \\\"Our families will\\nthrive. Our people will prosper. And our Nation will forever be safe and\\nstrong and proud and mighty and free.\\\"] [COHESIVE_GOALS: \\\"Our families will\\nthrive. Our people will prosper. And our Nation will forever be safe and\\nstrong and proud and mighty and free.\\\"] [TRIBAL_DOMINANCE: \\\"Our families will\\nthrive. Our people will prosper. And our Nation will forever be safe and\\nstrong and proud and mighty and free.\\\"]\\nThank you. And [TRIBAL_DOMINANCE: \\\"God bless America.\\\"] Goodnight.\\n\\nNOTE: The President spoke at 9:10 p.m. in the House Chamber of the U.S.\\nCapitol. In his remarks, he referred to Supreme Court Associate Justice Neil M.\\nGorsuch; Alexi Saenz, Jairo Saenz, Selvin Chavez, and Enrique Portillo, who,\\nalong with two unnamed minors, are accused in the murder of Brentwood, NY,\\nresidents Kayla Cuevas and Nisa Mickens in Brentwood on September 13, 2016;\\nCrystal Champ, birth mother of Hope Holets; and Abu Bakr al-Baghdadi, leader\\nof the Islamic State of Iraq and Syria (ISIS) terrorist organization.\\nThank you. And God bless America. Goodnight.\"\n    }\n  ]\n}\n```",
  "document_index": 3,
  "timestamp": "2025-09-23T03:51:16.268198+00:00"
}