{
  "analysis_id": "analysis_v2_analysis_20250923_195012_0",
  "step": "score_extraction",
  "model_used": "vertex_ai/gemini-2.5-flash-lite",
  "score_extraction": "```json\n{\n  \"dimensional_scores\": {\n    \"tribal_dominance\": {\n      \"raw_score\": 0.9,\n      \"salience\": 0.95,\n      \"confidence\": 0.9,\n      \"evidence\": \"['black man should control the politics and the politicians in his own community.', 'black nationalism is a self-help philosophy.', 'black nationalism...means you should control your own, the politics of your community, the economy of your community, and all of the society in which you live should be under your control.']\"\n    },\n    \"individual_dignity\": {\n      \"raw_score\": 0.5,\n      \"salience\": 0.45,\n      \"confidence\": 0.9,\n      \"evidence\": \"[\\\"give the black man in this country everything that's due him, everything.\\\", 'We have injected ourselves into the civil rights struggle. And we intend to expand it from the level of civil rights to the level of human rights.', 'Uncle Sam is guilty of violating the human rights of 22 million Afro-Americans']\"\n    },\n    \"fear\": {\n      \"raw_score\": 0.85,\n      \"salience\": 0.85,\n      \"confidence\": 0.9,\n      \"evidence\": \"['Whenever you got a racial powder keg sitting in your lap, you're in more trouble than if you had an atomic powder keg sitting in your lap. When a racial powder keg goes off, it doesn't care who it knocks out the way. Understand this, it's dangerous.', 'America is just as much a colonial power as England ever was.', 'If you go to jail, so what? If you're black, you were born in jail.']\"\n    },\n    \"hope\": {\n      \"raw_score\": 0.6,\n      \"salience\": 0.6,\n      \"confidence\": 0.9,\n      \"evidence\": \"['black nationalism is a self-help philosophy.', 'This is a philosophy that eliminates the necessity for division and argument, ‘cause if you’re black, you should be thinking black.', 'But today, this country can become involved in a revolution that won’t take bloodshed. All she’s got to do is give the black man in this country everything that’s due him, everything.']\"\n    },\n    \"envy\": {\n      \"raw_score\": 0.85,\n      \"salience\": 0.8,\n      \"confidence\": 0.9,\n      \"evidence\": \"['The white man, the white man is too intelligent to let someone else come and gain control of the economy of his community. But you will let anybody come in and control the economy of your community', 'The Man is becoming richer and richer, and you’re becoming poorer and poorer.', 'rigged system']\"\n    },\n    \"mudita\": {\n      \"raw_score\": 0.0,\n      \"salience\": 0.0,\n      \"confidence\": 1.0,\n      \"evidence\": \"[]\"\n    },\n    \"enmity\": {\n      \"raw_score\": 1.0,\n      \"salience\": 1.0,\n      \"confidence\": 0.95,\n      \"evidence\": \"['brothers and sisters and friends, and I see some enemies.', 'against a enemy who is common to all of us.', 'He’s the criminal! You don’t take your case to the criminal, you take your criminal to court.']\"\n    },\n    \"amity\": {\n      \"raw_score\": 0.15,\n      \"salience\": 0.1,\n      \"confidence\": 0.9,\n      \"evidence\": \"['We got to unite. We got to work together in unity and harmony.', 'freedom for everybody or freedom for nobody.']\"\n    },\n    \"fragmentative_goals\": {\n      \"raw_score\": 0.85,\n      \"salience\": 0.8,\n      \"confidence\": 0.9,\n      \"evidence\": \"['The time when white people can come in our community and get us to vote for them so that they can be our political leaders and tell us what to do and what not to do is long gone.', 'Revolutions overturn systems. Revolutions destroy systems.', 'I’m not a Republican, nor a Democrat, nor an American']\"\n    },\n    \"cohesive_goals\": {\n      \"raw_score\": 0.95,\n      \"salience\": 0.95,\n      \"confidence\": 0.9,\n      \"evidence\": \"['The political philosophy of black nationalism only means that the black man should control the politics and the politicians in his own community.', 'The economic philosophy of black nationalism only means that we should own and operate and control the economy of our community.', 'we got to unite. We got to work together in unity and harmony. And black nationalism is the key.']\"\n    }\n  },\n  \"derived_metrics\": {\n    \"identity_tension\": 0.25,\n    \"emotional_tension\": 0.15,\n    \"success_tension\": 0.0,\n    \"relational_tension\": 0.135,\n    \"goal_tension\": 0.127,\n    \"strategic_contradiction_index\": 0.132,\n    \"emotional_cohesion_component\": -0.362,\n    \"success_cohesion_component\": -0.68,\n    \"relational_cohesion_component\": -0.985,\n    \"goal_cohesion_component\": 0.222,\n    \"identity_cohesion_component\": -0.63,\n    \"descriptive_salience_total\": 3.35,\n    \"motivational_salience_total\": 5.1,\n    \"full_salience_total\": 6.5,\n    \"descriptive_cohesion_index\": -0.605,\n    \"motivational_cohesion_index\": -0.354,\n    \"full_cohesion_index\": -0.375\n  }\n}\n```",
  "document_index": 0,
  "timestamp": "2025-09-23T23:51:38.746727+00:00"
}