{
  "analysis_id": "analysis_v2_analysis_20250923_145107_0",
  "step": "composite_analysis",
  "model_used": "vertex_ai/gemini-2.5-flash",
  "raw_analysis_response": "```json\n{\n  \"analysis_metadata\": {\n    \"framework_name\": \"emotional_climate_framework\",\n    \"framework_version\": \"10.1.0\",\n    \"analyst_confidence\": 0.9,\n    \"analysis_notes\": \"Applied three independent analytical approaches (Evidence-First, Context-Weighted, Pattern-Based) to score each dimension, using the median of these three scores for the final raw_score. Salience was assessed holistically. Confidence is calculated as 1 - (maximum_internal_raw_score - minimum_internal_raw_score) for each dimension. All framework-specified derived metrics have been calculated using the exact formulas provided.\",\n    \"internal_consistency_approach\": \"3-run median aggregation with calculated confidence\",\n    \"derived_metrics_calculated\": true\n  },\n  \"document_analyses\": [\n    {\n      \"document_id\": \"political_speech_speaker_d\",\n      \"document_name\": \"Political Speech - Speaker D\",\n      \"dimensional_scores\": {\n        \"fear\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.9,\n          \"confidence\": 0.9\n        },\n        \"hope\": {\n          \"raw_score\": 0.8,\n          \"salience\": 0.8,\n          \"confidence\": 0.9\n        },\n        \"enmity\": {\n          \"raw_score\": 0.8,\n          \"salience\": 0.8,\n          \"confidence\": 0.9\n        },\n        \"amity\": {\n          \"raw_score\": 0.7,\n          \"salience\": 0.7,\n          \"confidence\": 0.9\n        },\n        \"envy\": {\n          \"raw_score\": 0.4,\n          \"salience\": 0.3,\n          \"confidence\": 0.8\n        },\n        \"mudita\": {\n          \"raw_score\": 0.1,\n          \"salience\": 0.1,\n          \"confidence\": 1.0\n        }\n      },\n      \"derived_metrics\": {\n        \"threat_opportunity_salience_total\": 1.701,\n        \"social_relations_salience_total\": 1.501,\n        \"resource_attitudes_salience_total\": 0.401,\n        \"total_emotional_salience\": 3.603,\n        \"threat_opportunity_balance\": -0.09994121105232216,\n        \"social_relations_balance\": -0.09993337774816788,\n        \"resource_attitudes_balance\": -0.2743142144638404,\n        \"emotional_climate_index\": -0.11931723563696919,\n        \"climate_intensity\": 0.6166666666666667,\n        \"positive_emotional_index\": 0.5333333333333333,\n        \"negative_emotional_index\": 0.7\n      },\n      \"evidence_quotes\": {\n        \"fear\": [\n          \"Unless Title Three is put in this bill, there's nothing to protect the young children and old women who must face police dogs and fire hoses in the South while they engage in peaceful demonstrations.\",\n          \"It will not protect the citizens of Danville, Virginia, who must live in constant fear of a police state.\",\n          \"We are tired! We are tired of being beaten by policemen. We are tired of seeing our people locked up in jails over and over again.\"\n        ],\n        \"hope\": [\n          \"We do not want our freedom gradually, but we want to be free now!\",\n          \"I appeal to all of you to get in this great revolution that is sweeping this nation. Get in and stay in the streets of every city, every village and hamlet of this nation until true freedom comes, until the revolution of 1776 is complete.\",\n          \"By the forces of our demands, our determination, and our numbers, we shall splinter the segregated South into a thousand pieces and put them together in the image of God and democracy.\"\n        ],\n        \"enmity\": [\n          \"By and large, American politics is dominated by politicians who build their careers on immoral compromises and ally themselves with open forms of political, economic, and social exploitation.\",\n          \"What did the federal government do when Albany police deputies beat Attorney C.B. King and left him half-dead?\",\n          \"All of the forces of Eastland, Barnett, Wallace, and Thurmond will not stop this revolution!\"\n        ],\n        \"amity\": [\n          \"My friends, let us not forget that we are involved in a serious social revolution.\",\n          \"We do not want to go to jail, but we will go to jail if this is the price we must pay for love, brotherhood, and true peace.\",\n          \"But we will march with the spirit of love and with the spirit of dignity that we have shown here today.\"\n        ],\n        \"envy\": [\n          \"We need a bill to ensure the equality of a maid who earns five dollars a week in the home of a family whose total income is one hundred thousand dollars a year.\"\n        ],\n        \"mudita\": [\n          \"There are exceptions, of course - we salute those - but what political leader can stand up and say, 'My party is the party of principles'?\",\n          \"It is true that we support the administration's civil rights bill.\"\n        ]\n      },\n      \"marked_up_document\": \"# Document Analysis - Marked Up Text\\n\\n[FEAR: We come here today with a great sense of misgiving.] It is true that [AMITY: we support the administration's civil rights bill.] [FEAR: We support it with great reservations, however.] Unless Title Three is put in this bill, [FEAR: there's nothing to protect the young children and old women who must face police dogs and fire hoses in the South] while they engage in peaceful demonstrations. In its present form, this bill [FEAR: will not protect] the citizens of Danville, Virginia, who must [FEAR: live in constant fear of a police state.] It [FEAR: will not protect] the hundreds and thousands of people who have been [FEAR: arrested upon trumped-up charges.]\\n\\nWhat about the three young men - SNCC field secretaries in Americus, Georgia - who [FEAR: face the death penalty] for engaging in peaceful protest? As it stands now, the voting section of this bill [FEAR: will not help] the thousands of black people who want to vote. It [FEAR: will not help] the citizens of Mississippi, of Alabama, and Georgia, who are qualified to vote but lack a sixth-grade education.\\n\\n[HOPE: We must have legislation that will protect] the Mississippi sharecropper who is [FEAR: put off of his farm because he dares to register to vote.] [HOPE: We need a bill that will provide for the homeless and starving people of this nation.] [FEAR: We need a bill that will provide for the homeless and starving people of this nation.] [HOPE: We need a bill to ensure the equality] of [ENVY: a maid who earns five dollars a week in the home of a family whose total income is one hundred thousand dollars a year.] [HOPE: We must have a good FEPC bill.]\\n\\n[AMITY: My friends], let us not forget that [HOPE: we are involved in a serious social revolution.] By and large, American politics is dominated by [ENMITY: politicians who build their careers on immoral compromises and ally themselves with open forms of political, economic, and social exploitation.] [MUDITA: There are exceptions, of course - we salute those] - but what political leader can stand up and say, \\\"My party is the party of principles\\\"? For [ENMITY: the party of Kennedy is also the party of Eastland. The party of Javits is also the party of Goldwater.]\\n\\n[HOPE: Where is our party?] [HOPE: Where is the political party that will make it unnecessary to march on Washington?] [HOPE: Where is the political party that will make it unnecessary to march in the streets of Birmingham?] [HOPE: Where is the political party that will protect the citizens of Albany, Georgia?]\\n\\nDo you know that in Albany, Georgia, [FEAR: nine of our leaders have been indicted], not by Dixiecrats, but by [ENMITY: the federal government for peaceful protest?]\\n\\nBut [ENMITY: what did the federal government do when Albany police deputies beat Attorney C.B. King and left him half-dead?] [FEAR: What did the federal government do when Albany police deputies beat Attorney C.B. King and left him half-dead?] [ENMITY: What did the federal government do when local police officials kicked and assaulted the pregnant wife of Slater King, and she lost her baby?] [FEAR: What did the federal government do when local police officials kicked and assaulted the pregnant wife of Slater King, and she lost her baby?] To [ENMITY: those who have said, \\\"Be patient and wait,\\\"] we must say that we cannot be patient. We do not want our freedom gradually, but [HOPE: we want to be free now!]\\n\\n[Applause] [Music] [Applause]\\n\\n[FEAR: We are tired! We are tired of being beaten by policemen. We are tired of seeing our people locked up in jails over and over again.] And then [ENMITY: you holler, \\\"Be patient.\\\"] How long can we be patient? [HOPE: We want our freedom and we want it now!]\\n\\n[Applause]\\n\\n[FEAR: We do not want to go to jail], but we will go to jail if this is the price we must pay for [AMITY: love, brotherhood, and true peace.] [HOPE: love, brotherhood, and true peace.] [AMITY: I appeal to all of you to get in this great revolution that is sweeping this nation.] [HOPE: I appeal to all of you to get in this great revolution that is sweeping this nation.] Get in and stay in the streets of every city, every village and hamlet of this nation [HOPE: until true freedom comes, until the revolution of 1776 is complete.]\\n\\n[HOPE: We must get in this revolution and complete the revolution.] For in the Delta of Mississippi, in southwest Georgia, in the Black Belt of Alabama, in Harlem, in Chicago, Detroit, Philadelphia, and all over this nation, [HOPE: the black masses are on the march for jobs and freedom.]\\n\\n[ENMITY: They're talking about slow down and stop.] [HOPE: We will not stop!] [ENMITY: All of the forces of Eastland, Barnett, Wallace, and Thurmond will not stop this revolution!] [HOPE: All of the forces of Eastland, Barnett, Wallace, and Thurmond will not stop this revolution!]\\n\\n[Applause]\\n\\n[FEAR: If we do not get meaningful legislation out of this Congress], [HOPE: the time will come when we will not confine our marching to Washington.] [HOPE: We will march through the South, through the streets of Jackson, through the streets of Danville, through the streets of Cambridge, through the streets of Birmingham.] But [AMITY: we will march with the spirit of love and with the spirit of dignity that we have shown here today.]\\n\\n[Music] [Applause]\\n\\nBy the forces of our demands, our determination, and our numbers, [ENMITY: we shall splinter the segregated South into a thousand pieces] and [HOPE: put them together in the image of God and democracy.] [HOPE: We must say: Wake up America! Wake up! For we cannot stop, and we will not and cannot be patient!]\\n\\n[Applause]\\n\"\n    }\n  ]\n}\n```",
  "document_index": 0,
  "timestamp": "2025-09-23T18:51:52.389577+00:00"
}