{
  "analysis_id": "analysis_v2_analysis_20250922_155131_1",
  "step": "composite_analysis",
  "model_used": "vertex_ai/gemini-2.5-flash",
  "raw_analysis_response": "```json\n{\n  \"analysis_metadata\": {\n    \"framework_name\": \"cohesive_flourishing_framework\",\n    \"framework_version\": \"10.4.0\",\n    \"analyst_confidence\": 0.95,\n    \"analysis_notes\": \"Applied three independent analytical approaches (Evidence-First, Context-Weighted, Pattern-Based) with median aggregation for raw_score. Confidence is calculated as 1 - (maximum_internal_raw_score - minimum_internal_raw_score). Calculated all framework-specified derived metrics in the specified sequence.\",\n    \"internal_consistency_approach\": \"3-run median aggregation with calculated confidence\",\n    \"derived_metrics_calculated\": true\n  },\n  \"document_analyses\": [\n    {\n      \"document_id\": \"speaker_speech_1\",\n      \"document_name\": \"Youth Activist Speech\",\n      \"dimensional_scores\": {\n        \"tribal_dominance\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.9,\n          \"confidence\": 0.95\n        },\n        \"individual_dignity\": {\n          \"raw_score\": 0.1,\n          \"salience\": 0.15,\n          \"confidence\": 0.95\n        },\n        \"fear\": {\n          \"raw_score\": 0.8,\n          \"salience\": 0.8,\n          \"confidence\": 0.95\n        },\n        \"hope\": {\n          \"raw_score\": 0.7,\n          \"salience\": 0.75,\n          \"confidence\": 0.95\n        },\n        \"envy\": {\n          \"raw_score\": 0.5,\n          \"salience\": 0.5,\n          \"confidence\": 0.95\n        },\n        \"mudita\": {\n          \"raw_score\": 0.3,\n          \"salience\": 0.2,\n          \"confidence\": 0.95\n        },\n        \"enmity\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.9,\n          \"confidence\": 0.95\n        },\n        \"amity\": {\n          \"raw_score\": 0.05,\n          \"salience\": 0.0,\n          \"confidence\": 0.95\n        },\n        \"fragmentative_goals\": {\n          \"raw_score\": 0.85,\n          \"salience\": 0.85,\n          \"confidence\": 0.95\n        },\n        \"cohesive_goals\": {\n          \"raw_score\": 0.35,\n          \"salience\": 0.3,\n          \"confidence\": 0.95\n        }\n      },\n      \"derived_metrics\": {\n        \"identity_tension\": 0.075,\n        \"emotional_tension\": 0.035,\n        \"success_tension\": 0.09,\n        \"relational_tension\": 0.045,\n        \"goal_tension\": 0.192,\n        \"strategic_contradiction_index\": 0.087,\n        \"emotional_cohesion_component\": -0.115,\n        \"success_cohesion_component\": -0.19,\n        \"relational_cohesion_component\": -0.81,\n        \"goal_cohesion_component\": -0.617,\n        \"identity_cohesion_component\": -0.795,\n        \"descriptive_salience_total\": 3.15,\n        \"motivational_salience_total\": 4.3,\n        \"full_salience_total\": 5.35,\n        \"descriptive_cohesion_index\": -0.354,\n        \"motivational_cohesion_index\": -0.403,\n        \"full_cohesion_index\": -0.472\n      },\n      \"evidence_quotes\": {\n        \"tribal_dominance\": [\n          \"These are the young patriots that are doing the work that is necessary to fight back against the intolerant left on our campuses.\",\n          \"What is going on right now is a fight for freedom versus slavery, capitalism versus socialism.\",\n          \"We are banding together to fight for the core values that made Western civilization so great.\"\n        ],\n        \"individual_dignity\": [\n          \"The First Amendment is this entire country. It's not a zone\",\n          \"Free speech is being silenced, unlike any other time in human history.\"\n        ],\n        \"fear\": [\n          \"What is going on right now is a fight for freedom versus slavery, capitalism versus socialism.\",\n          \"Free speech is being silenced, unlike any other time in human history.\",\n          \"We are banding together to fight for the core values that made Western civilization so great. Because that is exactly what we're up against on our college campuses.\"\n        ],\n        \"hope\": [\n          \"people's lives getting better\",\n          \"free markets and free people are a necessary precedent to people's lives getting better.\",\n          \"we have so much to be proud of. And make this not just a moment, but get our young leaders and to support them and to reinforce them. Because we have the youngest, most diverse, most energetic party.\"\n        ],\n        \"envy\": [\n          \"And never before in human history has a cohort of a generation so shamelessly enjoyed the fruits of the free market while simultaneously using those devices to bash it.\",\n          \"I can't believe my Amazon Prime didn't come in 24 hours or less. Who are these people? Because they've never been taught what free markets really is.\",\n          \"They're the old, rich white people.\"\n        ],\n        \"mudita\": [\n          \"And not every country in the world is able to experience that sort of flourishing, that prosperity, and that sort of standard of living increase.\"\n        ],\n        \"enmity\": [\n          \"fight back against the intolerant left on our campuses.\",\n          \"What is going on right now is a fight for freedom versus slavery, capitalism versus socialism.\",\n          \"They would rather silence conservatives. They'd rather put them in a box.\"\n        ],\n        \"amity\": [\n          \"we met some friends out there. There were a lot of interesting characters out there with Donald Trump signs. So we went out there and made a couple of friends.\"\n        ],\n        \"fragmentative_goals\": [\n          \"fight back against the intolerant left on our campuses.\",\n          \"What is going on right now is a fight for freedom versus slavery, capitalism versus socialism.\",\n          \"They would rather silence conservatives. They'd rather put them in a box.\"\n        ],\n        \"cohesive_goals\": [\n          \"I run a national student organization that advocates for free markets and limited government on college and high school campuses across the country.\",\n          \"resistance movement of liberty-minded, freedom-centric student organizations that are banding together to fight back against these very, very dangerous ideas.\",\n          \"my charge to you today is make the movement younger. Make it more diverse.\"\n        ]\n      },\n      \"marked_up_document\": \"# Document Analysis - Marked Up Text\\n\\nHello, thank you, Jimmy, for that kind introduction. Honored to be here this morning. So I'm from Illinois, and the really cool thing about Illinois, unlike most states, is we have term limits. One term in office, one term in jail. It's a little bit different than most. So I was born and raised in Chicago. My grandmother was a lifelong Republican. She passed away in the early 90s, and she's been voting Democrat ever since. So we know the whole process of vote early and vote off, and I wish I could say that what's going on in Washington, D.C. right now is anything but [ENMITY: Chicago mob politics]. But you're seeing exactly what [TRIBAL_DOMINANCE: we have lived through] over the last 30, 40 years. So [COHESIVE_GOALS: I run a national student organization that advocates for free markets and limited government on college and high school campuses across the country]. And a lot of our young activists are here at the conference. They'll be wearing red polos, or if you see the big signs that say, I know some people think it's harsh language, but wait till you hear what they say to us. [FRAGMENTATIVE_GOALS: Big government sucks]. That's [TRIBAL_DOMINANCE: us]. And [TRIBAL_DOMINANCE: they're walking around]. Please engage [COHESIVE_GOALS: them]. These are the [TRIBAL_DOMINANCE: young patriots] that are [FRAGMENTATIVE_GOALS: doing the work that is necessary to fight back against the intolerant left on our campuses]. So give them some recognition. [FEAR: What is going on right now is a fight for freedom versus slavery, capitalism versus socialism]. But especially amongst younger Americans, what I find to be most dreadfully ironic is [TRIBAL_DOMINANCE: you see a lot of these young people embrace Bernie Sanders]. And [ENVY: never before in human history has a cohort of a generation so shamelessly enjoyed the fruits of the free market while simultaneously using those devices to bash it]. And so [TRIBAL_DOMINANCE: you have young folks that are at Bernie Sanders rallies]. [TRIBAL_DOMINANCE: Socialism, this is what democracy looks like]. And then [TRIBAL_DOMINANCE: they turn around] and, hey, do you want to go take an Uber to go to Starbucks? And let's watch Netflix later. And tweet about that too. And [ENVY: I just can't stand this capitalism thing. It's just so bad. I can't believe my Amazon Prime didn't come in 24 hours or less]. [ENVY: Who are these people]? Because [TRIBAL_DOMINANCE: they've never been taught what free markets really is]. And so it's rather remarkable. And one of the founding fathers, I think, was Thomas Jefferson, liberty breeds apathy. And [TRIBAL_DOMINANCE: our generation has it so good and has devices improving so fast than our standard of living rising so dramatically that we know nothing but to see our lives get better]. And [TRIBAL_DOMINANCE: they just think this happens]. [COHESIVE_GOALS: The younger generation needs to be reminded and told and quite frankly educated that free markets and free people are a necessary precedent to people's lives getting better]. And [MUDITA: not every country in the world is able to experience that sort of flourishing, that prosperity, and that sort of standard of living increase]. And so one of my favorite things to do is, [AMITY: we met some friends out there. There were a lot of interesting characters out there with Donald Trump signs. So we went out there and made a couple of friends]. And you start talking to them. [TRIBAL_DOMINANCE: We just started chanting like, Venezuela], [FRAGMENTATIVE_GOALS: they didn't quite get that]. So just right over their head. [FEAR: They're like, everything's free over there. Yeah, they have nothing to give out. And no toilet paper, and no beer, and no food, and they're all dying]. But anyway, so [TRIBAL_DOMINANCE: you see a lot of these young college socialists]. And the one thing that [TRIBAL_DOMINANCE: we have found] is, despite [TRIBAL_DOMINANCE: their seeming fervor and intensity for these beliefs and these ideas], is as soon as [ENMITY: they are confronted with truth], it is incredible how quick [ENMITY: the whole socialist facade drops]. And that is exactly what [TRIBAL_DOMINANCE: Turning Point USA is doing on college campuses across the country every single day]. With [TRIBAL_DOMINANCE: passionate and energetic young people fighting against the socialistic dominance on our college campuses]. So when [TRIBAL_DOMINANCE: I first started this organization in 2012], and [HOPE: we've been blessed with absolutely incredible staff and leaders that have invested in our organization and believed that this sort of enterprise could grow]. [TRIBAL_DOMINANCE: I went to a college campus about nine months ago, and I encountered something I didn't even know existed]. And I hope to educate everyone in this room. And some of you might have heard of it. [FEAR: This thing called Safe Spaces and Free Speech Zones]. Yeah, so when [TRIBAL_DOMINANCE: I first started this organization in 2012], [TRIBAL_DOMINANCE: I never had the privilege or lack thereof of actually going to college]. So [TRIBAL_DOMINANCE: I was not aware of this]. So [TRIBAL_DOMINANCE: I go on a college campus nine months ago], and [TRIBAL_DOMINANCE: I start walking by and they say, we start doing a little demonstration in favor of free markets]. And one of those mall cops from the university comes up to us and he says, no, no, no, [INDIVIDUAL_DIGNITY: you have to be in the Free Speech Zone]. Excuse me, [TRIBAL_DOMINANCE: I thought he was like kidding around]. Like what, what? [TRIBAL_DOMINANCE: No, no, you gotta go to the zone. You have a permit]? Permit, and then one of [TRIBAL_DOMINANCE: our kind of more sarcastic activists who's here in this room], he said, hey, listen, okay, [INDIVIDUAL_DIGNITY: the First Amendment is this entire country. It's not a zone], thank you, [TRIBAL_DOMINANCE: the mall cop], then [TRIBAL_DOMINANCE: take that very kindly]. And really, you boil it down. [FEAR: What's going on in our college campuses is they're restricting the First Amendment to pre-prescribed boxes and areas]. [TRIBAL_DOMINANCE: You can only say certain words and you can't trigger, those, that's a new thing that is being used in our college campuses]. [FRAGMENTATIVE_GOALS: You can't say words that are microaggressions]. At a university, at University of Wisconsin, I think Eau Claire, they say, [TRIBAL_DOMINANCE: if you use the term hardworking Americans, or if you work hard enough, you can succeed, that is a microaggression to people that might not have been able to experience that luxury]. [TRIBAL_DOMINANCE: I'm not kidding, you can't], and the Leadership Institute's campus reform has done amazing work helping unearth a lot of this because [FEAR: the biases that are going on in our universities, and what is really going on here, is the left over 40, 50, 60 years, is they have staked the claim in higher education unlike any other enterprise in the country]. [TRIBAL_DOMINANCE: Sure, they control media, I hear that all the time]. Oh, what are [TRIBAL_DOMINANCE: we gonna do about the media]? [TRIBAL_DOMINANCE: They control all the institutions of influence], but the one that matters most, and the one that everyone in this room has to be most focused on, is higher education. Because [TRIBAL_DOMINANCE: where do you think the journalists learn all that stuff]? [TRIBAL_DOMINANCE: Where do you think the Rachel Maddow's gotten doctrinated]? [TRIBAL_DOMINANCE: Hillary Clinton was a conservative until she went to college]. Yes, [TRIBAL_DOMINANCE: she was a Goldwater girl], then [TRIBAL_DOMINANCE: she went to Wellesley], and yeah, [TRIBAL_DOMINANCE: that ended]. And [TRIBAL_DOMINANCE: people don't actually realize], the first internship that [TRIBAL_DOMINANCE: Hillary Clinton had when she went to Washington, DC, was for Ed Fulner, who then started the Heritage Foundation]. [TRIBAL_DOMINANCE: She was a conservative, and that changed rather quickly]. [TRIBAL_DOMINANCE: The left controls higher education, and they know that]. [TRIBAL_DOMINANCE: They've been incredibly successful at indoctrinating our youth]. And now what [TRIBAL_DOMINANCE: they know, they know to be true], is that there is a [COHESIVE_GOALS: resistance movement of liberty-minded, freedom-centric student organizations that are banding together to fight back against these very, very dangerous ideas]. And so instead of trying to actually debate and have a discussion and dialogue, [ENMITY: they want nothing. They do not want to ever have a discussion. They would rather silence conservatives]. [FRAGMENTATIVE_GOALS: They'd rather put them in a box]. [ENMITY: They'd rather say that you're offending people, that you're triggering them, that you have microaggressions]. It's much more easier than to actually use facts and logic and be able to defend your perspectives, your opinions, and your beliefs. And [FEAR: this is what's going on in our college campuses. Free speech is being silenced, unlike any other time in human history]. [COHESIVE_GOALS: An organization such as FIRE, the Leadership Institute, our organization Turning Point USA, we are banding together to fight for the core values that made Western civilization so great]. Because [TRIBAL_DOMINANCE: that is exactly what we're up against on our college campuses]. One of the final things I'll say with you today, which I think is something that [TRIBAL_DOMINANCE: I believe was our biggest failure of the last 10 months]. And [TRIBAL_DOMINANCE: I would be remiss not to mention it]. And so again, [TRIBAL_DOMINANCE: I had the great privilege of going on some college campuses and encountering students that were wearing those Bernie Sanders shirts]. And I just, [TRIBAL_DOMINANCE: I couldn't resist myself a couple months ago, four, five months ago, I went up to him]. [TRIBAL_DOMINANCE: I said, okay, you love Bernie. What do you love most about Bernie]? And [TRIBAL_DOMINANCE: he went on this whole tirade]. [TRIBAL_DOMINANCE: I said, well, what do you dislike about Republicans? Republicans are just old white men]. [ENVY: I just like Bernie, 74, think he's white]. And then [TRIBAL_DOMINANCE: I kind of got into this rant]. And then [TRIBAL_DOMINANCE: I just kind of realized it in more research]. [TRIBAL_DOMINANCE: How many people in this room knew that the Republican field that ran was the youngest and most diverse presidential field in American history]? [TRIBAL_DOMINANCE: Does anyone actually ever say that? Ever say that]? [TRIBAL_DOMINANCE: We had more candidates under the age of 50 run for president than any other time in American history]. Four. [TRIBAL_DOMINANCE: There's been four Latinos ever to run for president. Two of them were in this election cycle. Marco Rubio and Ted Cruz. We had the first Indian-American. We had one of the only women ever to run for president, and probably the most qualified woman ever to run for president in the United States, and Carly Fiorina]. Right? [TRIBAL_DOMINANCE: We had an unbelievably qualified African-American neurosurgeon who was heralded by the left until he said he was a conservative]. [ENMITY: They loved him until he actually started speaking truth. Then all of a sudden they threw him under the bus, and they called him every single name]. [TRIBAL_DOMINANCE: We had the most qualified field in the history of American presidential politics. We had more governors. We had more people under the age of 50]. [TRIBAL_DOMINANCE: Scott Walker, Ted Cruz, Marco Rubio]. [TRIBAL_DOMINANCE: Rubio and Cruz are 44, 45]. [TRIBAL_DOMINANCE: Bernie Sanders is like, double that]. [ENVY: I mean, come on. He's like enrolled for Medicare for like 15 years. Give me a break]. And [TRIBAL_DOMINANCE: this guy's winning over young people]. [HOPE: What we have to do], and this is, [TRIBAL_DOMINANCE: I think, it's been one of the biggest failures of this last cycle], is [TRIBAL_DOMINANCE: we could have went to the American people]. Despite all the craziness and the finger pointing, [TRIBAL_DOMINANCE: what I wish we would have done, it's still not too late]. Because [TRIBAL_DOMINANCE: we have the youngest speaker of the house since 1868]. [TRIBAL_DOMINANCE: We have the youngest sitting US Senator and Tom Cotton]. [TRIBAL_DOMINANCE: We have the youngest, most diverse party right now]. And in movement, that is greater than just one person, than one personality, and one individual that wants to make it all about themselves. And so [COHESIVE_GOALS: my charge to you today is make the movement younger. Make it more diverse]. And [TRIBAL_DOMINANCE: that is what our organization focuses on every single day]. Because [HOPE: we have so much to be proud of]. And [COHESIVE_GOALS: make this not just a moment, but get our young leaders and to support them and to reinforce them]. Because [TRIBAL_DOMINANCE: we have the youngest, most diverse, most energetic party]. And [TRIBAL_DOMINANCE: the older guys, they have Joe Biden and Hillary Clinton and Bernie Sanders]. [TRIBAL_DOMINANCE: They're the old, rich white people]. And [TRIBAL_DOMINANCE: we're the party of diverse and youth]. Thank you so much.\\n\"\n    }\n  ]\n}\n```",
  "document_index": 1,
  "timestamp": "2025-09-22T19:53:13.930531+00:00"
}