{
  "analysis_id": "analysis_v2_analysis_20250922_155131_9",
  "step": "composite_analysis",
  "model_used": "vertex_ai/gemini-2.5-flash",
  "raw_analysis_response": "```json\n{\n  \"analysis_metadata\": {\n    \"framework_name\": \"cohesive_flourishing_framework\",\n    \"framework_version\": \"10.4.0\",\n    \"analyst_confidence\": 0.95,\n    \"analysis_notes\": \"Applied three independent analytical approaches (Evidence-First, Context-Weighted, Pattern-Based) with median aggregation for raw_score and salience. Confidence is calculated as 1 - (max_raw_score - min_raw_score). All framework-specified derived metrics were calculated following the exact formulas and sequence.\",\n    \"internal_consistency_approach\": \"3-run median aggregation with calculated confidence\",\n    \"derived_metrics_calculated\": true\n  },\n  \"document_analyses\": [\n    {\n      \"document_id\": \"youtube_transcript_charlie_kirk\",\n      \"document_name\": \"YouTube Video Transcript - Charlie Kirk (Turning Point USA)\",\n      \"dimensional_scores\": {\n        \"tribal_dominance\": {\n          \"raw_score\": 0.8,\n          \"salience\": 0.7,\n          \"confidence\": 0.9\n        },\n        \"individual_dignity\": {\n          \"raw_score\": 0.0,\n          \"salience\": 0.0,\n          \"confidence\": 1.0\n        },\n        \"fear\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.8,\n          \"confidence\": 1.0\n        },\n        \"hope\": {\n          \"raw_score\": 0.8,\n          \"salience\": 0.7,\n          \"confidence\": 0.9\n        },\n        \"envy\": {\n          \"raw_score\": 0.7,\n          \"salience\": 0.6,\n          \"confidence\": 0.9\n        },\n        \"mudita\": {\n          \"raw_score\": 0.0,\n          \"salience\": 0.0,\n          \"confidence\": 1.0\n        },\n        \"enmity\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.8,\n          \"confidence\": 0.9\n        },\n        \"amity\": {\n          \"raw_score\": 0.5,\n          \"salience\": 0.4,\n          \"confidence\": 0.9\n        },\n        \"fragmentative_goals\": {\n          \"raw_score\": 0.7,\n          \"salience\": 0.6,\n          \"confidence\": 0.9\n        },\n        \"cohesive_goals\": {\n          \"raw_score\": 0.8,\n          \"salience\": 0.7,\n          \"confidence\": 0.9\n        }\n      },\n      \"derived_metrics\": {\n        \"identity_tension\": 0.0,\n        \"emotional_tension\": 0.08,\n        \"success_tension\": 0.0,\n        \"relational_tension\": 0.2,\n        \"goal_tension\": 0.07,\n        \"strategic_contradiction_index\": 0.07,\n        \"emotional_cohesion_component\": -0.16,\n        \"success_cohesion_component\": -0.42,\n        \"relational_cohesion_component\": -0.52,\n        \"goal_cohesion_component\": 0.14,\n        \"identity_cohesion_component\": -0.56,\n        \"descriptive_salience_total\": 3.3,\n        \"motivational_salience_total\": 4.6,\n        \"full_salience_total\": 5.3,\n        \"descriptive_cohesion_index\": -0.333,\n        \"motivational_cohesion_index\": -0.209,\n        \"full_cohesion_index\": -0.287\n      },\n      \"evidence_quotes\": {\n        \"tribal_dominance\": [\n          \"[TRIBAL_DOMINANCE: Democrats have given hundreds of billions of dollars to illegals and foreign nations, while Gen Z has to pinch pennies just so that they can never own a home, never marry, and work until they die.]\",\n          \"[TRIBAL_DOMINANCE: This is why young men are the most conservative that they have been in 50 years.]\",\n          \"[TRIBAL_DOMINANCE: We are going to choose to put the future of Americans first.]\"\n        ],\n        \"individual_dignity\": [\n          \"The speech explicitly focuses on the plight of 'Gen Z' and 'Americans' as distinct groups, often contrasted with 'illegals and foreign nations' or 'Democrats,' rather than emphasizing universal human worth or inclusive recognition beyond these group boundaries.\"\n        ],\n        \"fear\": [\n          \"[FEAR: The American dream has become a luxury item for the wealthy elite.]\",\n          \"[FEAR: Happy countries have children. Broken countries have addiction, depression, and suffering.]\",\n          \"[FEAR: Under Biden, our young people own nothing and they are miserable.]\"\n        ],\n        \"hope\": [\n          \"[HOPE: Donald Trump refuses to accept this fake, pathetic, mutilated version of the American dream. When he was president, young people were richer than ever before, and he will do it again.]\",\n          \"[HOPE: Donald Trump is on a rescue mission to revive your birthright.]\",\n          \"[HOPE: You don't have to stay poor. You don't have to accept being worse off than your parents. You don't have to feel aimless and unhappy.]\"\n        ],\n        \"envy\": [\n          \"[ENVY: The American dream has become a luxury item for the wealthy elite.]\",\n          \"[ENVY: Democrats have given hundreds of billions of dollars to illegals and foreign nations, while Gen Z has to pinch pennies just so that they can never own a home, never marry, and work until they die.]\"\n        ],\n        \"mudita\": [\n          \"The document contains no expressions of joy or appreciation for the success or achievements of others, focusing instead on grievances and the perceived failures under the current administration.\"\n        ],\n        \"enmity\": [\n          \"[ENMITY: For the past four years, they've seen the vision of the Biden-Harris regime.]\",\n          \"[ENMITY: You don't have to support leaders who lied to you and took advantage of you for your vote.]\",\n          \"[ENMITY: We will fire the Biden-Harris regime and put Donald Trump back in the White House where he belongs.]\"\n        ],\n        \"amity\": [\n          \"[AMITY: We together are going to do the work to save America.]\",\n          \"[AMITY: All of us together working harder than ever, we will fire the Biden-Harris regime and put Donald Trump back in the White House where he belongs.]\",\n          \"[AMITY: God bless you guys. Thank you so much.]\"\n        ],\n        \"fragmentative_goals\": [\n          \"[FRAGMENTATIVE_GOALS: This November, we're going to choose success. We're going to choose to put the future of Americans first. We are going to choose to no longer be spectators this election.]\",\n          \"[FRAGMENTATIVE_GOALS: We will fire the Biden-Harris regime and put Donald Trump back in the White House where he belongs.]\"\n        ],\n        \"cohesive_goals\": [\n          \"[COHESIVE_GOALS: Donald Trump is on a rescue mission to revive your birthright.]\",\n          \"[COHESIVE_GOALS: We together are going to do the work to save America.]\",\n          \"[COHESIVE_GOALS: We are going to choose to work harder than ever before, to chase ballots, to vote early, to register new voters.]\"\n        ]\n      },\n      \"marked_up_document\": \"# Document Analysis - Marked Up Text\\n\\n# YouTube Video Transcript\\n# Channel: Unknown\\n# Upload Date: Unknown\\n# Video URL: https://www.youtube.com/watch?v=WQAxYRjGe1A\\n# Language: en\\n# Extraction Method: whisper\\n# Confidence: 75.0%\\n# Whisper Model: small\\n# Extracted: 2025-09-12 12:11:29\\n\\n================================================================================\\n\\nThank you everybody. Thank you. Good evening. I'm Charlie Kirk, founder of Turning Point USA and Turning Point Action. I'm the founder of the largest conservative grassroots organizations in the country. Thanks to our work, I talk to a lot of young people on campuses, at our events, on my radio show, podcast, and social media. Said differently, I visit college campuses so you don't have to. I hear a lot from young people about their hopes, their dreams, and their fears. You see, young people are idealists. They respond to vision. [ENMITY: For the past four years, they've seen the vision of the Biden-Harris regime.] That vision is, [FEAR: you'll own nothing and be happy.] The Democrats say, [FEAR: instead of owning a home, you'll rent a 400 square foot studio apartment. Instead of owning a car, you'll rent a scooter using some app.] [FEAR: Their vision is this. Limit your dreams. Give up. Aim lower. Be content with less.] [FEAR: If you're a 20-something in America, life has been really tough.] [FEAR: You've watched home prices rise 47% since 2020. 47%. Home ownership is now out of reach unless you make over $106,000 a year.] Since I last spoke at the Republican convention four years ago, I've become a husband and father. In fact, we have two under two. I think I get extra points for that. [FEAR: For millions of people my age, that is a dream that feels farther away than ever under the Biden-Harris administration.] [FEAR: According to current projections, one-third of today's young Americans will never get married.] [FEAR: The average American is having fewer children than ever before.] [FEAR: Why? It's because for far too many, they simply can't afford them.] [FEAR: The basic things our parents enjoyed are increasingly out of reach for Gen Z and millennials.] You see, [ENVY: the American dream has become a luxury item for the wealthy elite.] [FEAR: Happy countries have children. Broken countries have addiction, depression, and suffering.] [TRIBAL_DOMINANCE: Democrats have given hundreds of billions of dollars to illegals and foreign nations, while Gen Z has to pinch pennies just so that they can never own a home, never marry, and work until they die.] [FEAR: Childless.] [FEAR: Under Biden, our young people own nothing and they are miserable.] [HOPE: Donald Trump refuses to accept this fake, pathetic, mutilated version of the American dream.] [HOPE: When he was president, young people were richer than ever before, and he will do it again.] [HOPE: Donald Trump is on a rescue mission to revive your birthright.] [COHESIVE_GOALS: Donald Trump is on a rescue mission to revive your birthright.] One your grandparents and those before them gave everything to hand down to you. And listen carefully, everybody. [TRIBAL_DOMINANCE: This is why young men are the most conservative that they have been in 50 years.] To all the Gen Zers watching this convention on TikTok right now, I have a message just for you. [HOPE: You don't have to stay poor.] [HOPE: You don't have to accept being worse off than your parents.] [HOPE: You don't have to feel aimless and unhappy.] [ENMITY: You don't have to support leaders who lied to you and took advantage of you for your vote.] America's future is a series of choices. [FEAR: Our current state of slow motion national decline is a choice.] This November, [HOPE: we're going to choose success.] [COHESIVE_GOALS: We are going to choose to put the future of Americans first.] [TRIBAL_DOMINANCE: We are going to choose to put the future of Americans first.] [FRAGMENTATIVE_GOALS: We are going to choose to no longer be spectators this election.] [AMITY: We together are going to do the work to save America.] [COHESIVE_GOALS: We together are going to do the work to save America.] [COHESIVE_GOALS: We are going to choose to work harder than ever before, to chase ballots, to vote early, to register new voters.] [AMITY: And all of us together working harder than ever, we will fire the Biden-Harris regime and put Donald Trump back in the White House where he belongs.] [FRAGMENTATIVE_GOALS: And all of us together working harder than ever, we will fire the Biden-Harris regime and put Donald Trump back in the White House where he belongs.] [ENMITY: And all of us together working harder than ever, we will fire the Biden-Harris regime and put Donald Trump back in the White House where he belongs.] God bless you guys. Thank you so much. Thank you.\"\n    }\n  ]\n}\n```",
  "document_index": 9,
  "timestamp": "2025-09-22T20:06:16.536170+00:00"
}