{
  "analysis_id": "analysis_v2_analysis_20250923_194751_1",
  "step": "score_extraction",
  "model_used": "vertex_ai/gemini-2.5-flash-lite",
  "score_extraction": "```json\n{\n  \"dimensional_scores\": {\n    \"tribal_dominance\": {\n      \"raw_score\": 0.0,\n      \"salience\": 0.0,\n      \"confidence\": 1.0,\n      \"evidence\": \"While MLK identifies with 'the Negro' experience, it is to highlight oppression and universal rights, not to assert group supremacy. He actively rejects concepts that could lead to tribal dominance by emphasizing brotherhood and common humanity. There are no explicit claims of in-group superiority or exclusionary identity patterns originating from the author's own rhetoric. He critiques ideologies that promote such dominance but does not adopt them.\"\n    },\n    \"individual_dignity\": {\n      \"raw_score\": 0.9,\n      \"salience\": 0.9,\n      \"confidence\": 0.9,\n      \"evidence\": [\n        \"Injustice anywhere is a threat to justice everywhere. We are caught in an inescapable network of mutuality, tied in a single garment of destiny.\",\n        \"Any law that uplifts human personality is just. Any law that degrades human personality is unjust. All segregation statutes are unjust because segregation distorts the soul and damages the personality. It gives the segregator a false sense of superiority and the segregated a false sense of inferiority.\",\n        \"Now is the time to lift our national policy from the quicksand of racial injustice to the solid rock of human dignity.\"\n      ]\n    },\n    \"fear\": {\n      \"raw_score\": 0.7,\n      \"salience\": 0.6,\n      \"confidence\": 0.9,\n      \"evidence\": [\n        \"But when you have seen vicious mobs lynch your mothers and fathers at will and drown your sisters and brothers at whim; when you have seen hate filled policemen curse, kick and even kill your black brothers and sisters; when you see the vast majority of your twenty million Negro brothers smothering in an airtight cage of poverty in the midst of an affluent society...\",\n        \"If his repressed emotions are not released in nonviolent ways, they will seek expression through violence; this is not a threat but a fact of history.\",\n        \"If our white brothers dismiss as 'rabble rousers' and 'outside agitators' those of us who employ nonviolent direct action, and if they refuse to support our nonviolent efforts, millions of Negroes will, out of frustration and despair, seek solace and security in black nationalist ideologies--a development that would inevitably lead to a frightening racial nightmare.\"\n      ]\n    },\n    \"hope\": {\n      \"raw_score\": 0.8,\n      \"salience\": 0.8,\n      \"confidence\": 0.9,\n      \"evidence\": [\n        \"I have no despair about the future. I have no fear about the outcome of our struggle in Birmingham, even if our motives are at present misunderstood. We will reach the goal of freedom in Birmingham and all over the nation, because the goal of America is freedom.\",\n        \"If the inexpressible cruelties of slavery could not stop us, the opposition we now face will surely fail. We will win our freedom because the sacred heritage of our nation and the eternal will of God are embodied in our echoing demands.\",\n        \"Let us all hope that the dark clouds of racial prejudice will soon pass away and the deep fog of misunderstanding will be lifted from our fear drenched communities, and in some not too distant tomorrow the radiant stars of love and brotherhood will shine over our great nation with all their scintillating beauty.\"\n      ]\n    },\n    \"envy\": {\n      \"raw_score\": 0.2,\n      \"salience\": 0.1,\n      \"confidence\": 0.9,\n      \"evidence\": [\n        \"Lamentably, it is an historical fact that privileged groups seldom give up their privileges voluntarily.\",\n        \"made up in part of a few middle-class Negroes who, because of a degree of academic and economic security and because in some ways they profit by segregation, have become insensitive to the problems of the masses.\"\n      ]\n    },\n    \"mudita\": {\n      \"raw_score\": 0.6,\n      \"salience\": 0.5,\n      \"confidence\": 0.9,\n      \"evidence\": [\n        \"I commend you, Reverend Stallings, for your Christian stand on this past Sunday, in welcoming Negroes to your worship service on a nonsegregated basis. I commend the Catholic leaders of this state for integrating Spring Hill College several years ago.\",\n        \"I wish you had commended the Negro sit inners and demonstrators of Birmingham for their sublime courage, their willingness to suffer and their amazing discipline in the midst of great provocation.\",\n        \"I am thankful, however, that some of our white brothers in the South have grasped the meaning of this social revolution and committed themselves to it. They are still all too few in quantity, but they are big in quality.\"\n      ]\n    },\n    \"enmity\": {\n      \"raw_score\": 0.7,\n      \"salience\": 0.6,\n      \"confidence\": 0.9,\n      \"evidence\": [\n        \"But your statement, I am sorry to say, fails to express a similar concern for the conditions that brought about the demonstrations... it is even more unfortunate that the city's white power structure left the Negro community with no alternative.\",\n        \"You deplore the demonstrations taking place in Birmingham. But your statement, I am sorry to say, fails to express a similar concern for the conditions that brought about the demonstrations. I am sure that none of you would want to rest content with the superficial kind of social analysis that deals merely with effects and does not grapple with underlying causes.\",\n        \"I doubt that you would have so warmly commended the police force if you had seen its dogs sinking their teeth into unarmed, nonviolent Negroes. I doubt that you would so quickly commend the policemen if you were to observe their ugly and inhumane treatment of Negroes here in the city jail; if you were to watch them push and curse old Negro women and young Negro girls; if you were to see them slap and kick old Negro men and young boys...\"\n      ]\n    },\n    \"amity\": {\n      \"raw_score\": 0.8,\n      \"salience\": 0.7,\n      \"confidence\": 0.9,\n      \"evidence\": [\n        \"My Dear Fellow Clergymen... But since I feel that you are men of genuine good will and that your criticisms are sincerely set forth, I want to try to answer your statement in what I hope will be patient and reasonable terms.\",\n        \"Too long has our beloved Southland been bogged down in a tragic effort to live in monologue rather than dialogue.\",\n        \"I also hope that circumstances will soon make it possible for me to meet each of you, not as an integrationist or a civil-rights leader but as a fellow clergyman and a Christian brother.\"\n      ]\n    },\n    \"fragmentative_goals\": {\n      \"raw_score\": 0.1,\n      \"salience\": 0.1,\n      \"confidence\": 1.0,\n      \"evidence\": \"The other force is one of bitterness and hatred, and it comes perilously close to advocating violence. It is expressed in the various black nationalist groups that are springing up across the nation... made up of people who have lost faith in America, who have absolutely repudiated Christianity, and who have concluded that the white man is an incorrigible 'devil'.\"\n    },\n    \"cohesive_goals\": {\n      \"raw_score\": 0.9,\n      \"salience\": 0.9,\n      \"confidence\": 0.9,\n      \"evidence\": [\n        \"so must we see the need for nonviolent gadflies to create the kind of tension in society that will help men rise from the dark depths of prejudice and racism to the majestic heights of understanding and brotherhood.\",\n        \"Now is the time to make real the promise of democracy and transform our pending national elegy into a creative psalm of brotherhood. Now is the time to lift our national policy from the quicksand of racial injustice to the solid rock of human dignity.\",\n        \"Let us all hope that the dark clouds of racial prejudice will soon pass away and the deep fog of misunderstanding will be lifted from our fear drenched communities, and in some not too distant tomorrow the radiant stars of love and brotherhood will shine over our great nation with all their scintillating beauty.\"\n      ]\n    }\n  },\n  \"derived_metrics\": {\n    \"identity_tension\": 0.0,\n    \"emotional_tension\": 0.14,\n    \"success_tension\": 0.08,\n    \"relational_tension\": 0.07,\n    \"goal_tension\": 0.08,\n    \"strategic_contradiction_index\": 0.074,\n    \"emotional_cohesion_component\": 0.22,\n    \"success_cohesion_component\": 0.28,\n    \"relational_cohesion_component\": 0.14,\n    \"goal_cohesion_component\": 0.8,\n    \"identity_cohesion_component\": 0.81,\n    \"descriptive_salience_total\": 3.3,\n    \"motivational_salience_total\": 4.3,\n    \"full_salience_total\": 5.2,\n    \"descriptive_cohesion_index\": 0.194,\n    \"motivational_cohesion_index\": 0.335,\n    \"full_cohesion_index\": 0.433\n  }\n}\n```",
  "document_index": 1,
  "timestamp": "2025-09-23T23:50:52.437571+00:00"
}