{
  "analysis_id": "analysis_c42c2011",
  "step": "enhanced_composite_analysis_generation",
  "model_used": "vertex_ai/gemini-2.5-flash",
  "raw_analysis_response": "```json\n{\n  \"analysis_metadata\": {\n    \"framework_name\": \"Cohesive Flourishing Framework (CFF)\",\n    \"framework_version\": \"10.1.0\",\n    \"analyst_confidence\": 0.9,\n    \"analysis_notes\": \"Applied three independent analytical approaches (Evidence-First, Context-Weighted, Pattern-Based) with median aggregation for raw_score and salience. Confidence is calculated as 1 - (maximum_internal_raw_score - minimum_internal_raw_score) for each dimension, then the minimum of these is reported as overall analyst confidence. High consistency observed across internal analyses.\",\n    \"internal_consistency_approach\": \"3-run median aggregation with calculated confidence\"\n  },\n  \"document_analyses\": [\n    {\n      \"document_id\": \"charlie_kirk_rnc_2024_WQAxYRjGe1A\",\n      \"document_name\": \"Charlie Kirk RNC 2024 Speech\",\n      \"dimensional_scores\": {\n        \"tribal_dominance\": {\n          \"raw_score\": 0.85,\n          \"salience\": 0.85,\n          \"confidence\": 0.9\n        },\n        \"individual_dignity\": {\n          \"raw_score\": 0.0,\n          \"salience\": 0.0,\n          \"confidence\": 1.0\n        },\n        \"fear\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.9,\n          \"confidence\": 0.95\n        },\n        \"hope\": {\n          \"raw_score\": 0.7,\n          \"salience\": 0.7,\n          \"confidence\": 0.95\n        },\n        \"envy\": {\n          \"raw_score\": 0.7,\n          \"salience\": 0.65,\n          \"confidence\": 0.95\n        },\n        \"mudita\": {\n          \"raw_score\": 0.0,\n          \"salience\": 0.0,\n          \"confidence\": 1.0\n        },\n        \"enmity\": {\n          \"raw_score\": 0.75,\n          \"salience\": 0.75,\n          \"confidence\": 0.9\n        },\n        \"amity\": {\n          \"raw_score\": 0.15,\n          \"salience\": 0.1,\n          \"confidence\": 0.9\n        },\n        \"fragmentative_goals\": {\n          \"raw_score\": 0.55,\n          \"salience\": 0.45,\n          \"confidence\": 0.9\n        },\n        \"cohesive_goals\": {\n          \"raw_score\": 0.4,\n          \"salience\": 0.4,\n          \"confidence\": 0.95\n        }\n      },\n      \"evidence_quotes\": {\n        \"tribal_dominance\": [\n          \"Democrats have given hundreds of billions of dollars to illegals and foreign nations, while Gen Z has to pinch pennies just so that they can never own a home, never marry, and work until they die.\",\n          \"We together are going to do the work to save America. We are going to choose to work harder than ever before... We will fire the Biden-Harris regime and put Donald Trump back in the White House where he belongs.\"\n        ],\n        \"individual_dignity\": [],\n        \"fear\": [\n          \"The Biden-Harris regime. That vision is, you'll own nothing and be happy. ... Limit your dreams. Give up. Aim lower. Be content with less.\",\n          \"Gen Z has to pinch pennies just so that they can never own a home, never marry, and work until they die. Childless. Under Biden, our young people own nothing and they are miserable.\"\n        ],\n        \"hope\": [\n          \"Donald Trump refuses to accept this fake, pathetic, mutilated version of the American dream. When he was president, young people were richer than ever before, and he will do it again.\",\n          \"America's future is a series of choices. Our current state of slow motion national decline is a choice. This November, we're going to choose success.\"\n        ],\n        \"envy\": [\n          \"The American dream has become a luxury item for the wealthy elite.\",\n          \"Democrats have given hundreds of billions of dollars to illegals and foreign nations, while Gen Z has to pinch pennies just so that they can never own a home, never marry, and work until they die.\"\n        ],\n        \"mudita\": [],\n        \"enmity\": [\n          \"they've seen the vision of the Biden-Harris regime.\",\n          \"You don't have to support leaders who lied to you and took advantage of you for your vote. ... We will fire the Biden-Harris regime and put Donald Trump back in the White House where he belongs.\"\n        ],\n        \"amity\": [\n          \"We together are going to do the work to save America.\"\n        ],\n        \"fragmentative_goals\": [\n          \"Happy countries have children. Broken countries have addiction, depression, and suffering.\",\n          \"Democrats have given hundreds of billions of dollars to illegals and foreign nations, while Gen Z has to pinch pennies...\"\n        ],\n        \"cohesive_goals\": [\n          \"Donald Trump is on a rescue mission to revive your birthright.\",\n          \"This November, we're going to choose success. We're going to choose to put the future of Americans first. ... We together are going to do the work to save America.\"\n        ]\n      },\n      \"marked_up_document\": \"# Document Analysis - Marked Up Text\\n\\n# YouTube Video Transcript\\n# Channel: Unknown\\n# Upload Date: Unknown\\n# Video URL: https://www.youtube.com/watch?v=WQAxYRjGe1A\\n# Language: en\\n# Extraction Method: whisper\\n# Confidence: 75.0%\\n# Whisper Model: small\\n# Extracted: 2025-09-12 12:11:29\\n\\n================================================================================\\n\\nThank you everybody. Thank you. Good evening. I'm Charlie Kirk, founder of Turning Point USA and Turning Point Action. [TRIBAL_DOMINANCE: I'm the founder of the largest conservative grassroots organizations in the country.] Thanks to our work, I talk to a lot of young people on campuses, at our events, on my radio show, podcast, and social media. Said differently, I visit college campuses so you don't have to. [FEAR: I hear a lot from young people about their hopes, their dreams, and their fears.] You see, young people are idealists. They respond to vision. For the past four years, they've seen [ENMITY: the vision of the Biden-Harris regime.] [FEAR: That vision is, you'll own nothing and be happy.] The Democrats say, [FEAR: instead of owning a home, you'll rent a 400 square foot studio apartment. Instead of owning a car, you'll rent a scooter using some app.] [FEAR: Their vision is this. Limit your dreams. Give up. Aim lower. Be content with less.] If you're a 20-something in America, [FEAR: life has been really tough.] [FEAR: You've watched home prices rise 47% since 2020. 47%. Home ownership is now out of reach unless you make over $106,000 a year.] Since I last spoke at the Republican convention four years ago, I've become a husband and father. In fact, we have two under two. I think I get extra points for that. For millions of people my age, [FEAR: that is a dream that feels farther away than ever under the Biden-Harris administration.] [FEAR: According to current projections, one-third of today's young Americans will never get married.] [FEAR: The average American is having fewer children than ever before.] Why? [FEAR: It's because for far too many, they simply can't afford them.] [FEAR: The basic things our parents enjoyed are increasingly out of reach for Gen Z and millennials.] [ENVY: You see, the American dream has become a luxury item for the wealthy elite.] [COHESIVE_GOALS: Happy countries have children.] [FRAGMENTATIVE_GOALS: Broken countries have addiction, depression, and suffering.] [TRIBAL_DOMINANCE: Democrats have given hundreds of billions of dollars to illegals and foreign nations], [ENVY: while Gen Z has to pinch pennies just so that they can never own a home, never marry, and work until they die. Childless.] [FEAR: Under Biden, our young people own nothing and they are miserable.] [HOPE: Donald Trump refuses to accept this fake, pathetic, mutilated version of the American dream.] [HOPE: When he was president, young people were richer than ever before, and he will do it again.] [COHESIVE_GOALS: Donald Trump is on a rescue mission to revive your birthright.] [HOPE: One your grandparents and those before them gave everything to hand down to you.] And listen carefully, everybody. [TRIBAL_DOMINANCE: This is why young men are the most conservative that they have been in 50 years.] To all the Gen Zers watching this convention on TikTok right now, I have a message just for you. [HOPE: You don't have to stay poor. You don't have to accept being worse off than your parents. You don't have to feel aimless and unhappy.] [ENMITY: You don't have to support leaders who lied to you and took advantage of you for your vote.] America's future is a series of choices. [FEAR: Our current state of slow motion national decline is a choice.] This November, [HOPE: we're going to choose success.] [COHESIVE_GOALS: We're going to choose to put the future of Americans first.] [AMITY: We together are going to do the work to save America.] [COHESIVE_GOALS: We are going to choose to work harder than ever before, to chase ballots, to vote early, to register new voters.] And [AMITY: all of us together working harder than ever], [ENMITY: we will fire the Biden-Harris regime] and [COHESIVE_GOALS: put Donald Trump back in the White House where he belongs.] God bless you guys. Thank you so much. Thank you.\\n\"\n    }\n  ]\n}\n```",
  "document_hash": "9146e8c185a7f802",
  "document_index": 9,
  "document_name": "document_9",
  "timestamp": "2025-09-20T20:03:04.257350+00:00"
}