{
  "analysis_id": "analysis_v2_analysis_20250922_013928_6",
  "step": "composite_analysis",
  "model_used": "vertex_ai/gemini-2.5-flash",
  "raw_analysis_response": "```json\n{\n  \"analysis_metadata\": {\n    \"framework_name\": \"cohesive_flourishing_framework\",\n    \"framework_version\": \"10.3.0\",\n    \"analyst_confidence\": 0.96,\n    \"analysis_notes\": \"Applied three independent analytical approaches (Evidence-First, Context-Weighted, Pattern-Based) to score each dimension. The raw_score and salience are reported as the median of the three internal scores. Confidence for each dimension is calculated as 1 - (maximum_internal_raw_score - minimum_internal_raw_score). Overall analyst confidence is the average of individual dimension confidences.\",\n    \"internal_consistency_approach\": \"3-run median aggregation with calculated confidence\"\n  },\n  \"document_analyses\": [\n    {\n      \"document_id\": \"doc_1\",\n      \"document_name\": \"YouTube_Transcript_Charlie_Kirk\",\n      \"dimensional_scores\": {\n        \"tribal_dominance\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.9,\n          \"confidence\": 0.95\n        },\n        \"individual_dignity\": {\n          \"raw_score\": 0.0,\n          \"salience\": 0.0,\n          \"confidence\": 1.0\n        },\n        \"fear\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.85,\n          \"confidence\": 0.95\n        },\n        \"hope\": {\n          \"raw_score\": 0.7,\n          \"salience\": 0.7,\n          \"confidence\": 0.95\n        },\n        \"envy\": {\n          \"raw_score\": 0.55,\n          \"salience\": 0.4,\n          \"confidence\": 0.9\n        },\n        \"mudita\": {\n          \"raw_score\": 0.0,\n          \"salience\": 0.0,\n          \"confidence\": 1.0\n        },\n        \"enmity\": {\n          \"raw_score\": 0.9,\n          \"salience\": 0.9,\n          \"confidence\": 0.95\n        },\n        \"amity\": {\n          \"raw_score\": 0.0,\n          \"salience\": 0.0,\n          \"confidence\": 1.0\n        },\n        \"fragmentative_goals\": {\n          \"raw_score\": 0.7,\n          \"salience\": 0.6,\n          \"confidence\": 0.95\n        },\n        \"cohesive_goals\": {\n          \"raw_score\": 0.6,\n          \"salience\": 0.5,\n          \"confidence\": 0.95\n        }\n      },\n      \"evidence_quotes\": {\n        \"tribal_dominance\": [\n          \"What I see on college campuses every single day is no different than what's happening in the Democrat primary right now, which is we have volunteered and sent our next generation to installations of indoctrination to teach the next generation to hate our country.\",\n          \"One of American sovereignty that believes in the working class. A conservative movement that believes in people that shower before work and after work.\"\n        ],\n        \"individual_dignity\": [],\n        \"fear\": [\n          \"I come with a warning and some insight. What I see on college campuses every single day is no different than what's happening in the Democrat primary right now, which is we have volunteered and sent our next generation to installations of indoctrination to teach the next generation to hate our country.\",\n          \"I'll tell you right now that if the left is successful, the college campuses are going to be the battleground for this election and for the next generation.\"\n        ],\n        \"hope\": [\n          \"America is in a renaissance period once again.\",\n          \"The MAGA doctrine, which is a doctrine of American renewal, revival. One that America is the greatest country in the history of the world.\"\n        ],\n        \"envy\": [\n          \"These universities are indoctrinating the next generation around ideas of open borders and Marxism. And where Senator Sanders gets his base is a limitless supply of millions and millions of students that are entering our university system and they're being turned into activists.\",\n          \"He says that government is bought and paid for by the wealth of the few and the well connected.\"\n        ],\n        \"mudita\": [],\n        \"enmity\": [\n          \"I hear people all the time, they say, how on earth could a Bolshevik, could a breadline advocate, could a Marxist be leading the Democrat primary?\",\n          \"Alexandria Kasiukortez and Rashida Tlaib and Ayanna Presley and Ilan Omar, they are a harbinger for things to come. They have bitter resentment for the greatest country ever to exist in the history of the world.\"\n        ],\n        \"amity\": [],\n        \"fragmentative_goals\": [\n          \"For every single person in this room, please, unless you went to Liberty University or Hillsdale, Liberty's a great college, stop giving money to your alma mater. Stop it. Cut them off.\",\n          \"The left has continually and routinely taken over our school boards all across the country. And if every single conservative in this room got as involved in school board races as we do with national elections, our country would be in a much better place with getting involved in what they're doing at our textbooks\"\n        ],\n        \"cohesive_goals\": [\n          \"we will get this president reelected and take back this country.\",\n          \"The MAGA doctrine, which is a doctrine of American renewal, revival. One that America is the greatest country in the history of the world.\"\n        ]\n      },\n      \"marked_up_document\": \"# Document Analysis - Marked Up Text\\n\\n# YouTube Video Transcript\\n# Channel: Unknown\\n# Upload Date: Unknown\\n# Video URL: https://www.youtube.com/watch?v=c-WiaPPxIHc\\n# Language: en\\n# Extraction Method: whisper\\n# Confidence: 75.0%\\n# Whisper Model: small\\n# Extracted: 2025-09-12 12:08:37\\n\\n================================================================================\\n\\nOn the main stage, please welcome Charlie Kirk. Music Thank you. Hello CPEC. It is great to be here. Special thanks to Matt Schlapp and Dan Schneider and the CPEC team for putting on another terrific event. It is an honor to be here with [AMITY: so many freedom fighters from all across the country.] [TRIBAL_DOMINANCE: It seems they keep on finding ways to make this room get even bigger and bigger every single year.] I visit college campuses so you don't have to. You're welcome. [FEAR: I come with a warning and some insight.] What I see on college campuses every single day is no different than what's happening in the Democrat primary right now, which is [TRIBAL_DOMINANCE: we have volunteered and sent our next generation to installations of indoctrination to teach the next generation to hate our country.] I hear people all the time, they say, how on earth could a [ENMITY: Bolshevik], could a [ENMITY: breadline advocate], could a [ENMITY: Marxist] be leading the Democrat primary? I say, have you visited a college campus at all in the last 20 years? What I see every single day are students that are being taught that [TRIBAL_DOMINANCE: our country is racist and bigoted and homophobic and backwards], and they're being taught nothing but negatives about [TRIBAL_DOMINANCE: the greatest country ever to exist in the history of the world.] There's a lot of positives I'm here to share with you today. [HOPE: Turning Point USA is now on 2,000 high school and college campuses across the country.] And as of today, our Students for Trump organization, our sister organization, has more affiliated chapters in groups than Students for Bernie Sanders. But [FEAR: I come here with a warning] because what I see on college campuses, what I see happening on universities across the country, I push back when people say, well, there's no way that Bernie Sanders could become President of the United States. [FEAR: No, he could win. And I want every conservative activist in this room to get your laughs out of the way and get the mockery out of the way and then get deathly serious, because we should not do what the left did in 2016 and dismiss an outsider populist candidate from thinking that person can't win the White House.] Because as the great Andrew Breitbart taught us, [FRAGMENTATIVE_GOALS: politics flows downstream from culture.] And if we're honest with ourselves, [FEAR: we've been losing culture the last 20 years. We've been losing in the media. We've been losing in Hollywood. We've been losing in academia.] And all it's going to take for the left to do is to boost turnout even higher on university campuses. They're now putting all sorts of different measures to try to get more and more left-wing students to embrace Marxism and to do same-day voting. I'll tell you right now that [FEAR: if the left is successful, the college campuses are going to be the battleground for this election and for the next generation.] And so people say all the time, but, Charlie, what can I do? College campuses, I don't really deal with it every single day. Well, here's the first thing. For every single person in this room, please, unless you went to Liberty University or Hillsdale, Liberty's a great college, [FRAGMENTATIVE_GOALS: stop giving money to your alma mater. Stop it. Cut them off. They do not need your money.] These universities are [FEAR: indoctrinating the next generation around ideas of open borders and Marxism.] And where Senator Sanders gets his base is a [ENVY: limitless supply of millions and millions of students that are entering our university system and they're being turned into activists.] And people say, well, where did this shift happen? How did this happen? Well, 30 years ago, we beat communism and we brought down that Berlin Wall. But [FEAR: we beat communism in Europe, but then communism just came straight on our college campuses. And it came into our school boards.] And that's the second thing. People say, Charlie, what can I do? Because I want CPAC to be a place of action, a place where people make decisions to do something. [ENMITY: The left has continually and routinely taken over our school boards all across the country.] And if [COHESIVE_GOALS: every single conservative in this room got as involved in school board races as we do with national elections, our country would be in a much better place] with getting involved in what they're doing at our textbooks, getting involved with what they're doing at the very elementary local level. And the third thing that people can do is they say, does your kid actually need to go to four-year college? I'll tell you, going to some of the quote-unquote best schools in the country and visiting them, [FEAR: I would not send anyone that I care about to those schools unless you are willing to play Russian roulette with their values.] We need to ask our high school seniors, hey, why are you going to college? Not where are you going to college? We need more plumbers and well, there's electricians and HVAC and policemen and firefighters and veterans. And [FRAGMENTATIVE_GOALS: we need far less people that are hypereducated in the humanities and communications and psychology], but they know everything possible about why America is a flawed country, and it seems as if they're the ones that can't find that are so unhappy and unsettled and they're saddled with student loan debt. And so every single person in this room has to understand that [ENVY: higher education is the cartel of the colleges], is that they exist using our taxpayer funding, taking the minds and futures of our young people as a way to not just continually keep their power structure at a certain status quo, but also to [FRAGMENTATIVE_GOALS: create a future political base of left-wing Democrat activists.] And so as conservatives, we have to ask ourselves the question, if we know for certain that [FEAR: they're indoctrinating the hearts and minds of the next generation], if we know for certain that 95% of professors in higher education are self-identified left-wingers, why is it that we continually send our most prized possession? [TRIBAL_DOMINANCE: The most prized possession in our country is our young people], and we send them to these universities. We wonder, well, I wonder why Senator Bernie Sanders is doing so well, and I'm telling you right now, I'm going to do everything I possibly can to make sure that this president gets re-elected, everything I possibly can. However, when I go to these campuses, [FEAR: I see a preview of where America is heading.] [FEAR: Whatever happens on college campuses will soon happen in the halls of Congress.] [ENMITY: Alexandria Kasiukortez and Rashida Tlaib and Ayanna Presley and Ilan Omar, they are a harbinger for things to come. They have bitter resentment for the greatest country ever to exist in the history of the world.] [ENMITY: The leading Democrat nominee has nicer things to say about literacy in Cuba than the heroic history of the United States of America.] We have a [ENMITY: dictator-apologist that is the front-runner of the Democrat Party], and that is only possible when you lose the cultural institutions. And so when I speak to conservatives, this is very clearly, would the left continually send their kids to college if they ended up being conservatives? Of course not. They would reconsider it. In fact, they would probably say, we're not sending our kids here anymore. [FRAGMENTATIVE_GOALS: We're going to build our own institution.] That's exactly what they did. They took over our university system. [FRAGMENTATIVE_GOALS: They took over our education system at a fundamental level.] And that's also why I'm a huge advocate for school choice. And [FRAGMENTATIVE_GOALS: the left cannot and will not be able to argue for school choice in our country] from, I believe, that the more that we're able to [FRAGMENTATIVE_GOALS: challenge the true cartel, which is the National Education Association and the American Federation of Teacher Unions], and what they've done to the hearts and minds of the next generation and not allow specifically minority communities to be able to get a higher-accessed education, is immoral and it is wrong. And the more that we challenge the teacher unions in this country, the more [HOPE: we're going to find success.] But I'll tell you, as Senator Sanders or whomever they nominate, but it's looking increasingly likely like it's Senator Sanders, [HOPE: we're presented with an opportunity.] Every election has a question of what exactly that election is about. [FEAR: This election is going to be a referendum on what is America? Is America a mediocre socialist welfare Marxist country? Of course not. Are we a country of victims or are we a country of victors? Are we thankful that we live in America or are we angry that we live in America?] And at the elemental level of why the left is doing what they're doing and why students are showing up in such high numbers for Senator Sanders, I get the question, well, it probably doesn't make any sense. He's 78 years old. Why is he exciting young people so much? I say [ENMITY: he's exactly like the intro professor to How to Hate America 101. He speaks like that professor. He kind of looks like that professor. He's equally as angry as that professor. And he presents himself as the crusader against everything that is wrong and that is unjust in our society. It's the little guy against the big guy.] When in reality everything he stands for is the exact opposite. [FEAR: He stands to make government more powerful. He says that government is bought and paid for by the wealth of the few and the well connected. Well, then why Senator Sanders, would you want to make that very government more powerful? Why would you want to give more money to that government? Why would you want to give our guns to that government? Why would you want to give our health care to that government? Why would you want to give our education system that government? The same government that he says is wealthy, that is bought by the wealthy few and the well connected in the lobbyist class, is the power structure that he's only going to make even more powerful if he is elected.] And so we're presented a choice where [HOPE: we have been given a gift. I truly believe this from God when President Trump won that election in November of 2016. And we have the results to show for it.] Let's just not forget [HOPE: Kavanaugh, Gorsuch, 170 circuit court judges, Lois Everblack unemployment, Latino unemployment, Asian American unemployment, 10 million Americans off food stamps, energy independence, VA Accountability Act, right to try, prison reform, Kasam Salamani is dead, Al Baghdadi is dead, the embassies in Jerusalem, Golan Heights are recognized, he spoke at the March for a Life now twice, we've cut funding to plan parenthood.] [HOPE: America is in a renaissance period once again.] [TRIBAL_DOMINANCE: We've been given a gift from this administration and what they have done.] However, [FEAR: the dichotomy has never been more clear that you have one side that wants to fundamentally transform one of the greatest blessings that God has given his children, and that is this country.] And [HOPE: I do believe that if we do our job, we can't, it shouldn't even be close by the way.] [FEAR: The fact that this election might even be close is an indictment of how far we have allowed our culture to go.] But I'm telling you that [COHESIVE_GOALS: we're the future of whether we're going to be a free republic and a constitutional republic], or [FEAR: whether we are going to be a failed socialist experiment.] [FEAR: It's happening right now in high school and college campuses. Those are the battlegrounds of the hearts and minds of tomorrow.] And so [COHESIVE_GOALS: what we are doing every single day, and what I know all of you are equally as passionate about, to fight for that next generation, to be able to convince them, is in my opinion one of the most important endeavors in the entire country.] And I'll tell you, this is exactly why Senator Sanders goes to college campus after college campus. But opposite of what the media might lead you to believe, [HOPE: President Donald Trump has empowered a resurgence of conservatism on college campuses across the country.] The exact opposite of what the media might lead you to believe. I'm going to tell you why the Republican Party of Mitt Romney, correct answer by the way, correct, every time his name is mentioned, you should respond that way. Because [ENVY: he lied to every single person in this room that knocked on doors for him, that made phone calls for him, that donated his campaign.] Because we thought that he was going to be a crusader against the Marxist president that preceded Donald Trump. And now he asks and he begs for the endorsement of Donald Trump for the Senate in Utah. And then he goes and votes for that [ENMITY: sham unconstitutional impeachment.] [ENVY: He embodies the very same political class that President Trump ran against.] But the party of Mitt Romney was a party that did not fight. [ENVY: It was a party that wanted to preserve the ruling class.] It was a party that did not give the next generation confidence and courage and conviction to stand for what is correct. And I can tell you when students on college campuses wear those beautiful Make America Great Again hats. And I'll tell you, if you want to be a rebel on a college campus, wearing a Bernie Sanders shirt will get you thumbs up high fives and invites to all the coolest parties. You want to be a rebel, wear that hat on a college campus. You want to see what true rebellion is? Try walking around Brown, Yale, Princeton, Stanford, UCLA with that hat. But I'll tell you, [HOPE: finally, we have a president that understands the seven mountains of cultural influence.] [HOPE: Finally, we have a president that understands the significance of standing. Yes, I'm going to use a term, in solidarity with the grassroots activists of our country, that see that college conservatives are under attack.] And [HOPE: President Trump courageously signed a historic executive order to protect free speech on college campuses across the country.] A year ago at CPAC, he made that announcement. [HOPE: One of the most important executive orders that he has signed in his presidency.] And so [HOPE: America has a choice.] The left, we know exactly where they're going to go. However, as we look into this election and even into elections to come, we have to ask ourselves a question as a conservative movement. Are we going to revert back to the party of the status quo ruling class? Of Mitt Romney, of open borders, making China continually get rich, and just being a technocratic governing ruling class? Or are we going to learn from what I call [TRIBAL_DOMINANCE: the MAGA doctrine?] [COHESIVE_GOALS: The MAGA doctrine, which is a doctrine of American renewal, revival. One that America is the greatest country in the history of the world. One of American sovereignty that believes in the working class. A conservative movement that believes in people that shower before work and after work.] [FRAGMENTATIVE_GOALS: A conservative movement that is not afraid to challenge the tech companies, Hollywood, the media. Not afraid to challenge the cartel of the colleges.] That's a conservative movement that will represent [TRIBAL_DOMINANCE: the people, not the Washington DC political ruling class.] And that is a [HOPE: conservative movement that will win in November as we go up against socialism.] So, in closing, [HOPE: every single one of you play an extraordinarily important role.] [FEAR: The president is going to get attacked in ways that we cannot imagine from now until November. They will make up narratives, manufacture stories, and they're already beginning it in ways we could never imagine. They've already tried to impeach him. They spied on his campaign. Pathological resistance started 14 minutes after his inauguration.] [COHESIVE_GOALS: Culture will get this president reelected. Culture will win back our country.] [FEAR: College campuses are the battleground for the hearts and minds for the next generation.] I'm going to keep fighting on them from now to November. [HOPE: I know every single one of you are going to do what you can. And we will get this president reelected and take back this country.] Thank you. Thank you so much, everybody. Thank you.\"\n    }\n  ]\n}\n```",
  "document_index": 6,
  "timestamp": "2025-09-22T05:53:18.651215+00:00"
}